{
    "id": "lina",
    "symbol": "lina",
    "name": "LINA",
    "platforms": {
        "ethereum": "0xc05d14442a510de4d3d71a3d316585aa0ce32b50"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "\r\nAs a pioneering Blockchain enterprise in Vietnam, our journey begins with the desire to apply technology in solving problems of technological inadequacy in the country's agriculture. Our passion and constant efforts motivated us to rise beyond our expectations. The mission Lina Network chases after is applying transparent technology in connecting humans and providing practical solutions for the society.\r\nAt Lina Network, we believe digital transformation provides great value for life, thereby it is an indispensable tendency in this day and age. We expand our projects in multi-industry such as produce traceability, supply chain, health-care and e-government, etc… with the aim of finding only right answers for all drawbacks and creating positive changes in our society.\r\nLina Network Ecosystem\r\nWe develop projects that are inextricably linked to one another to form an ecosystem which gives facilities for approaching urgent issues in society from different aspects.\r\n·         Lina Review - The world’s first transparent review platform.\r\n·         Lina FarmTrust - Produce traceability and farm management built on Blockchain.\r\n·         Lina Market - An agricultural e-commerce platform, connects manufacturers and consumers.\r\n·         Lina MediTrust - An electronic health record storage and management system.\r\n·         Lina e-Government - A platform that digitizes all information of citizens, verified by the government.\r\nLina Network’s Potentials:\r\n·         A multinational corporation with members from different countries across the world such as Switzerland, Germany, United States, Australia, New Zealand, Japan, Thailand, Vietnam, etc…\r\n·         A leading enterprise in Vietnam that deploys modern technologies such as Blockchain, Big Data and AI.\r\n·         Lina Network ecosystem consists of projects that are inextricably linked to provide transparent solutions and build trust for society.\r\n\r\n"
    },
    "country_origin": "CH",
    "genesis_date": null,
    "contract_address": "0xc05d14442a510de4d3d71a3d316585aa0ce32b50",
    "url": "https://lina.network/",
    "explorers": [
        "https://etherscan.io/token/0xc05d14442a510de4d3d71a3d316585aa0ce32b50",
        "https://ethplorer.io/address/0xc05d14442a510de4d3d71a3d316585aa0ce32b50"
    ],
    "twitter": "lina_network",
    "facebook": "linanetwork.Intl",
    "telegram": "linareviewintl"
}