{
    "id": "margin-call",
    "symbol": "mc",
    "name": "Margin Call",
    "platforms": {
        "binance-smart-chain": "0x899dcde4f486816afae42442d4b1b6a7c6fe9c63"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "MARGIN CALL project with symbol $MC was born on May 19th, 2021, created by a Japanese millionaire whose account was liquidated on the Okex exchange. Before that, he used to trade very successfully on derivatives platforms. However, after the strong liquidity of the Bitcoin price on May 9th, his account was liquidated. He and a few of his developer friends gathered the remaining assets to create a project with the aim to save the trader’s soul and recover your, they have created the new trend called: “Don’t let the exchange spend your money, let’s recover the trading loss together”\r\n\r\nMost of the buyers of $MC are those who have traded losses on major exchanges such as Binance, Okex, Huobi, Bitmex…, with the same goal and mission of “recover the trading loss together”, they all buy this tokens and hold it. Their goal is that each person buys a little, holds a little and shares it with many people, then we can recover our trading loss together thanks to the strong increase in the price of the token that almost everyone also love this.\r\n\r\nIn addition to the financial meaning, $MC also has a social meaning, as it regularly organizes airdrop programs for individuals who suffer from “margin calls” or heavy losses on exchanges, with our hope of sharing their pain. The people who receive the airdrop will also continue the sharing the goal of Margin Call, they will hold $MC without selling, and share with many people the meaningful and mission of $MC."
    },
    "country_origin": "HK",
    "genesis_date": null,
    "contract_address": "0x899dcde4f486816afae42442d4b1b6a7c6fe9c63",
    "url": "https://margincall.cc/",
    "explorers": [
        "https://bscscan.com/token/0x899dcde4f486816afae42442d4b1b6a7c6fe9c63"
    ],
    "twitter": "Mc_announce",
    "telegram": "MC_Community"
}