{
    "id": "mechashiba",
    "symbol": "mec",
    "name": "MechaShiba",
    "platforms": {
        "binance-smart-chain": "0xc2d56d2d136f16ed1c3e219339b272feddf2a376"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "MECHASHIBA is planning to take over this DeFi space with clean codes, celebratory token burns, amazing merchandise & NFT’s  and gamification.\r\n\r\nOur team is extremely committed and have weathered through tough times on many occasions. The Team is diligent and hardworking in ensuring the project continues in the best interest of the community. We adhere to a strict community voting system before spending any marketing budget to ensure full transparency too.\r\n\r\nMechaShiba’s future plans are broken down into MechArt Marketplace, an NFT incubator and NFT & merchandise marketplace with the long term plan of mass commercial adoption of our MechaShiba mascot. MechaShiba owns all copyrights for the MechaShiba image and all profits will be redistributed to our marketing budget, existing holders and token buy backs to stabilise and increase our token floor price. Secondly, MechAid where MechaShiba aims to aid in donations to animal shelters, refugee charities and other good causes. And finally, our very own MechaShiba Flagship Application on both Playstore and Appstore with integrated NFT marketplace and in game purchases utilising MechaShiba Tokens to begin our gamification journey.\r\n\r\nMechaNomics: \r\nTotal Supply: 100,000,000,000,000 (100 Trillion)\r\nBurned : 37,000,000,000,000 (37 Trillion)\r\n\r\n10% Tax applies to every transaction : \r\n5 % redistributed amongst holders\r\n5% sent back to the Pancakeswap MechaPool for added liquidity"
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0xc2d56d2d136f16ed1c3e219339b272feddf2a376",
    "url": "https://www.mechashiba.net/",
    "explorers": [
        "https://bscscan.com/address/0xc2d56d2d136f16ed1c3e219339b272feddf2a376",
        "https://bscscan.com/token/0xc2d56d2d136f16ed1c3e219339b272feddf2a376"
    ],
    "twitter": "mechashiba_",
    "github_org": "MechaShibaa"
}