{
    "id": "medican-coin",
    "symbol": "mcan",
    "name": "Medican Coin",
    "platforms": {
        "ethereum": "0x72ba699f0f3c29d0f886c264ec7350533a32b3d5"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "MCAN Coin, trusted and popular European cryptocurrency.\r\nInvestors gained confidence in the MCAN currency, as the vast majority of the issue of this coin was purchased by Black Pearl S.A., a company listed on the Warsaw Stock Exchange. Black Pearl S.A. owns 88.25% of the total issue of 5 billion MCAN Coins. The issuer Medican Ltd. Currently owns 9,05% of the coins. Currently there is 4 547 400 196,5903 Coins in the circullating supply. This is BlackPearl S.A and all the decentralized investors.\r\n\r\nCurrently, the MCAN Coin is used as a value carrier, through which the company invests in the purchase of shares of other companies. Several such transactions using MCAN Coin have already been made. These are companies in pharmaceutical, renewable energy sources and space industry.\r\n\r\nBlack Pearl S.A., using MCAN Coin, invested in the following companies:\r\nRED PHARMA LABOLATORIES S.A., a company specializing in the production and distribution of medical supplements and anti-covid equipment.\r\n\r\nENERGA PLUS, a company specializing in the supply of microspheres for European industrial concerns. This product is used to make special metal alloys, which need to be very durable. They are used, for example, in the manufacture of space shuttles.\r\n\r\nMCAN Coin was also used as a contract collateral between ENERGA PLUS and POSCHELL GROUP, where the value of entire contract is 16 million Euro. In this case, a value of 1 MCAN Coin was incorporated at 0.5 Euro. In cooperation with MEDICANCOIN GREECE LTD., MCAN Coin is going to be used as settlement currency in future.\r\n\r\nInvestors purchasing the MCAN Coin also have the opportunity to invest it in projects with high potential, such as for example, photovoltaic farms with an installed capacity of 1 Megawatt. MCAN COIN is the only accepted currency for these investments.\r\n\r\n\r\n\r\n\""
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x72ba699f0f3c29d0f886c264ec7350533a32b3d5",
    "url": "https://medicancoin.com/",
    "explorers": [
        "https://etherscan.io/token/0x72ba699f0f3c29d0f886c264ec7350533a32b3d5",
        "https://ethplorer.io/address/0x72ba699f0f3c29d0f886c264ec7350533a32b3d5"
    ],
    "twitter": "MedicalCannab",
    "facebook": "mcancoin",
    "telegram": "MCAN_Coin"
}