{
    "id": "merculet",
    "symbol": "mvp",
    "name": "Merculet",
    "platforms": {
        "ethereum": "0x432a2c54de2dde941a36d2eb8c424ed666f74aef"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Merculet proposes a growth methodology based on user attention: Merculet constructed Attention Value Network. This Network connects both the supply and demand sides of  attention with an open protocol suite to promote a virtuous circulation of the Internet of Value. On the one hand, it provides diverse methods for user operation. On the other hand, it offers real users and business scenarios for various existing public chain projects, promoting the effective circulation of value. \r\n\r\nAttention Value Network realizes the value circulation in a distributed commercial society, brings a brand-new production relationship experience to users and entrepreneurs, and re-defines the structure of valuable user traffic.\r\n\r\nThe core components of the project include:\r\n1. User Attention Value (UAV) evaluation system:\r\nUAV System effectively evaluates user attention, completes digitalization and capitalization, and provides a proof of effective workload, that is, UAV. It established a long-lasting trust relationship between entrepreneur and user as well as a new mechanism for the community of interests; \r\n\r\n2. Attention Incentive system: UAT (User Attention Token), Application Market of Merculet UAT Alliance\r\nEntrepreneurs can issue UAT to users based on UAV value. The UAT will be anchoring the basic MVP (Merculet Value Protocol) token, enabling the synergy and the value exchange between entrepreneurs, thus creating an era of the token, which is a means of the welfare, equity, entry admission, and identity.\r\n\r\n3. To address the source of user attention, Merculet will provide a blockchain based Merculet Open Content Platform: \r\nBased on consensus and driven by token, it will provide a decentralized platform for the entire industry chain globally. It also dedicated to solving the problem of global content circulation brought by cultural differences."
    },
    "country_origin": "SG",
    "genesis_date": null,
    "contract_address": "0x432a2c54de2dde941a36d2eb8c424ed666f74aef",
    "url": "http://merculet.io/",
    "explorers": [
        "https://etherscan.io/token/0x432a2c54de2dde941a36d2eb8c424ed666f74aef",
        "https://ethplorer.io/address/0x432a2c54de2dde941a36d2eb8c424ed666f74aef"
    ],
    "twitter": "Merculet_io",
    "facebook": "merculet",
    "telegram": "merculet",
    "reddit": "Merculet",
    "github_org": "Merculet"
}