{
    "id": "minicake",
    "symbol": "minicake",
    "name": "MiniCake",
    "platforms": {
        "binance-smart-chain": "0xc184e85e9fa942b8ae553f5ef4d5b40fd0213bf9"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "MiniCake was founded upon a set of core principles and values which focus upon the value associated with a collective group of likeminded individuals and the unparalleled capacity and coordination that arises from this type of magical coalition. It is this pure harmonic synergy that fuels MiniCake to this moment, and it is this sentiment that will continue to bring MiniCake and its community to new and even greater heights. Relatedly, as a community-driven project, MiniCake proud to be the 1st Cake Yield Generation and Buyback Token. It is these elements, jointly combined with an experienced team of developers and influencers in the cryptocurrency space that set up MiniCake for long-term growth and progress. This is only the beginning for MiniCake, and we are so excited to have you as an important and valuable member of our tribe.\r\nMINI CAKE. INNOVATIVE FEATURES\r\n7.0% REDISTRIBUTION IN CAKE\r\n7.0% of every buy/sell is taken and redistributed to all holders. Hold $BabyCake tokens, earn CAKE.\r\nAUTO PAID\r\nFor the first time ever, you don’t need to claim your earned CAKE. It’s automatically sent to your wallet.\r\n1.0% AUTO LIQUIDITY POOL\r\n1.0% of every transaction is transformed into liquidity for Pancakeswap. It's automatic and helps create a price floor (stability).\r\nANTI-DUMP LOCK & 1% SELL FEE\r\nSells are restricted to less than 0.1% of the total supply + extra 1% fee is applied to all sells. This will allow us to reduce swing-trading and break whales' control.\r\n"
    },
    "country_origin": "SG",
    "genesis_date": null,
    "contract_address": "0xc184e85e9fa942b8ae553f5ef4d5b40fd0213bf9",
    "url": "https://minicake.io/",
    "explorers": [
        "https://bscscan.com/token/0xc184e85e9fa942b8ae553f5ef4d5b40fd0213bf9"
    ],
    "twitter": "minicake_bsc",
    "telegram": "MiniCakeBSC"
}