{
    "id": "mishka-token",
    "symbol": "mishka",
    "name": "Mishka Token",
    "platforms": {
        "ethereum": "0x976091738973b520a514ea206acdd008a09649de"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "What is MISHKA Token?\r\n\r\nMishka token is here to change the trend of alt-coins by providing real value and utility.  Even though branded as a cute meme coin, the project is meticulously developed to address issues and provide solutions to tackle the current risks and complexities of the decentralized economy.  The Mishka Token is an alt-coin on the Ethereum Network, which takes an innovative approach to the alt-coin environment by applying advanced metrics and holistic marketing.  The Mishka Team will revolutionize the way people perceive and interact with utility tokens, all the while donating some Teddy Bears to charity.  \r\n\r\nTOKENOMICS \r\n\r\n•\tFees ~ When a transaction is made with $MISHKA, a 5% fee is applied. This fee is used to fund the development, marketing, and charity wallets.\r\n    •\t2.0 % DEVELOPMENT  \r\n    •\t2.8 % MARKETING \r\n    •\t0.2 % CHARITY WALLET  \r\n\r\n•\tInitial Liquidity ~ A fixed supply of 1 Trillion (1,000,000,000) $MISHKA was minted on smart contract deployment. 100% of supply was added to the Uniswap Liquidity Pool along with 25 ETH.\r\n    •\t$1T MISHKA FIXED SUPPLY  \r\n    •\t25 ETH INITIAL LIQUIDITY\r\n\r\n•\tBuyback Strategy ~ A wise decision was made to protect against rogue whales buying up a large amount of the supply, so the Mishka Team immediately purchased 25 ETH worth of supply to be used for burns, airdrops, and marketing events.  This values each $MISHKA token at a significantly higher amount than most coin launches. A typical coin creates liquidity with less than 5 ETH.\r\n\r\nAlso, Mishka had its first ‘burn event’ occur within one month of launch date, which burned 5% of the total supply, equaling to approximately $211,000 USD of the founders’ buyback.\r\n\r\n•\tRug-Pull Proof ~ The cryptocurrency market is full of scams and rug pulls; Mishka wanted to make sure the Mishka contract does not allow for funny business, by rehearsing over 50 contract deployments on the Ethereum Test and Live networks to ensure a smooth and safe launch.  Every functionality for integrity and hardcoded limits on TxFees and MaxTxAmount were tested.  The liquidity pool tokens are locked for 1 year, and the leading audit firm for their highest tier of smart contract security audits was hired. \r\n\r\nHow is MISHKA Different?\r\n\r\nThe Mishka team is currently working on a state-of-the-art Decentralized App (DAPP) that will make crypto and blockchain technology not only accessible and safe to use for the average Joe, but also FUN.  The Mishka team stands out through its commitment to the advancement of DeFi, transparency, and charitable causes; & we have an AWESOME Utility lineup, with some of our technology already deployed, while the others are currently in the works or just about ready for deployment.\r\n\r\nUTILITY\r\n\r\n•\tHoneyBot [ deployed ] ~ Automated bot traders are often responsible for destroying crypto ecosystems.  Our HoneyBot technology allows bots to purchase Mishka Token, but does not allow them to sell or transfer.  This effectively burns the tokens that Bots have purchased, removing those tokens from supply forever, while additionally benefiting holders through the permanent addition of Ether into the liquidity pool, permanently raising the value of the Token.  Automated bot detection was pioneered by FTP Anti-Bot and monitors ‘buy and sell’ activity across the ERC-20 network to identify automated bot traders.\r\n\r\n•\tMishkaMail [ deployed ] ~ Have you ever wanted to send a message to another wallet? MishkaMail is a proprietary technology that allows you to notify anonymous wallets that they have a message waiting to be read. When you write a message, MishkaMail sends 777 $MISHKA from your wallet to the recipient, notifying them they have a message to read.  \r\n\r\n*** We currently have an upgrade queued that improves the user experience of MishkaMail.  For now, you can play with the feature in our contract. Just hit the “Write Message” function.\r\n\r\n•\tMishkaSWAP [ deploying August 2021 ] ~ Mishka’s vision is to make cryptocurrency safe and easy to use on a global scale.  99% of newcomers give up trying to set up a wallet, deposit ether, and perform a swap.  The MishkaSWAP platform is the foundation on which we will build the DeFi Ecosystem of Mishka.  It will feature effortless, user-friendly, and (dare we say it), a FUN decentralized trading experience. \r\n\r\n•\tDebit Card Purchases [ in queue ] ~ MetaMask and TrustWallet have a reported base of about 10 million users; with 7 billion humans on this planet, we have a long way to go for mass adoption.  We believe that debit card purchases of ERC-20 tokens are an under-looked opportunity in the crypto space.  Mishka is making it easy to plug into DeFi with the ability to buy $MISHKA tokens with your debit card.    \r\n\r\n**Purchases are secured with 3D Secure verified by Visa and MasterCard SecureCode.**\r\n\r\n•\tCharts [ in queue ] ~ Most chart tools out there contain loads of information unnecessary for the layman.  Stats are jumbled together, and users are distracted by trending scroll bars, advertisements, and the agenda of the chart platform.  \r\nWith Mishka’s Charts platform, you can very clearly see the most important information you need to know about your investment.\r\n\r\n•\tMy Wallet [ in queue ] ~ Clearly see your $MISHKA value, gains, and interest earned from staking and holding.\r\n\r\n•\tCross-Chain Transfer [ in queue ] ~ To further address the issue of accessibility and cost (and to cut down on the potential for scams on other blockchains), $MISHKA is working on integrating with other blockchains (such as Cardano, Binance Smart Chain, AVAX, Huobi, and KCC) using what are known as “Cross-Chain Bridges.”\r\nThis means that as Mishka is integrated into other blockchains, the current supply of coins will never increase. Instead, the current supply will seamlessly move back and forth between the respective blockchains.\r\n\r\n•\tStaking [ in queue ] ~ In order to reward holders of the $Mishka token, the founders are working on a system that will incentivize holders based on the length of time that they hold.  When you stake on our platform, you will gain our staking token $HUNNY. The $HUNNY token is pegged to the value of $MISHKA and will serve as a governance token to future utility.\r\n\r\n•\teCommerce Integration [ in queue ] ~ The ultimate value of any crypto currency is its utility and use-cases.  One of the most sought-after use-cases is having the ability to spend your coins on real-world items – the Mishka team is tackling this by bringing Decentralized Shopping to $MISHKA holders.  The Mishka Team has decades of experience in marketing and eCommerce, and have already established several contracts with various eCommerce websites to be able to spend your $MISHKA on real world swag.  In order to make sure that there are no issues, the team is working on integrating $MISHKA spending into a neat Shopify plugin and will be testing it on the ‘MishkaSwag’ store before opening the floodgates to partners.\r\n\r\n\r\nMISHKA VALUES & GIVING BACK \r\n\r\nMishka believes in paying it forward and philanthropy. A core tenant of the Mishka Token is to donate a percentage of every transaction to a cause of the community’s choosing.\r\nCurrently, the Mishka team is donating teddy bears to children in the Foster Care system and Hospitals, along with a $100 worth of $MISHKA which they can decide to HODL as an investment for the child, or cash out.\r\nFuture charity pursuits include:\r\n•\tAnimal Preserves\r\n•\tChildren’s Hospitals and Child Disease Research Centers\r\n•\tGreen Earth Initiatives\r\n•\tOther non-profit initiatives that the community nominates.\r\n\r\nThe Mishka Team (and community) understands the value of charity and the need for transparency, and so this process is not only decided on by the community, but the results are also shared with the community – so that users of the Mishka Token can also share in the warmth of their good deeds."
    },
    "country_origin": "US",
    "genesis_date": null,
    "contract_address": "0x976091738973b520a514ea206acdd008a09649de",
    "url": "https://mishkatoken.com/",
    "explorers": [
        "https://etherscan.io/token/0x976091738973b520a514ea206acdd008a09649de",
        "https://ethplorer.io/address/0x976091738973b520a514ea206acdd008a09649de"
    ],
    "twitter": "mishkatoken",
    "telegram": "mishkatoken",
    "github_org": "mishkatoken"
}