{
    "id": "mms-coin",
    "symbol": "mmsc",
    "name": "MMS Coin",
    "platforms": {
        "tron": "TKcVKREApseEtC6Jxcv9Dso8xtiJcdXU6d"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Our project is called “MMS Genius Platform”.  The project was found to assist people to earn extra revenue out of their monthly income as one of passive income.  MMSC and MCASH tokens were generated to bring up the system as the new asset in digital world, crypto currency.  With these tokens, the members can use it for daily consumption expenses in MMS Malls, Lucky Lotto MMS JACKPOT, or even getting distribution of MMSC tokens monthly from the system.  These tokens are able to be used for investment by possessing our tokens where are sold on the listed exchanges.  As the targeted protocol that the company has planned is to make these tokens to be demanded more and more in the future.  We have a large number of holders and user communities by excessing 107,000 internal members and these members hold our tokens for usage.  MMSC and MCASH are not only targeted for our internal members but to let external investors to invest our MMSC and MCASH per the percentage that the company has determined in the masterplan.  Our expected lifespan of mining our token MMSC is around 20 years existence.  \r\n\r\nWe are currently open franchise platform in other countries e.g. Malaysia, Indonesia, Singapore and Cambodia, for first group countries to be franchised under the company’s regulation.  The native owners will only own MMS MALL in their countries but the platform is still controlled by the company.  \r\n\r\nWe have 5 products for our productivities as following;\r\n1.\tMMSC  - 35,681 Token Holders\r\n2.\tMCASH -  2,053 Token Holders\r\n3.\tMMS FINANCE  - the company's service that MMS member can apply the deposit/loan of MCASH token from the company as a digital crypto bank that transactions are made on TRON Blockchain. The transactions are verifiable and checkable which our system is emphasized on the clear transaction's exercises. Deposit Interest is given for MCASH deposit; 1. 3 percent per year or;2. 0.25 percent per month. Loan Interest of MCASH Loan;1. 12 percent per year or; 2. 1 percent per month or;3. 0.033 per day. The objective of providing loan is to assist members who do not have enough money to top up in MMS GENIUS PLATFORM or loan for using in MMS MALLS.\r\n4.\tMMS MALLS - the online mall that the company has set up for MMS members. MCASH is to be used for products and services exchange.1. Products (as same as shopping online platforms)2. Accommodations.3. Second-hand Automobiles.4. Lands and houses.5. Others, the company shall possibly put on the MMS MALLS. Available products and services on MMS MALLS (use MCASH for exchange by 1 MCASH = 1 USD\r\n5.\tMMS JACKPOT – is a jackpot that MMS members can enjoy the prize as a reward pool of our tokens. "
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "TKcVKREApseEtC6Jxcv9Dso8xtiJcdXU6d",
    "url": "https://mmsplatform.io/",
    "explorers": [
        "https://tronscan.org/#/token20/TKcVKREApseEtC6Jxcv9Dso8xtiJcdXU6d"
    ],
    "twitter": "mmsplatform",
    "telegram": "mms_genius_platform",
    "github_org": "MMS-Platform"
}