{
    "id": "mobilego",
    "symbol": "mgo",
    "name": "MobileGo",
    "platforms": {
        "ethereum": "0x40395044ac3c0c57051906da938b54bd6557f212"
    },
    "hashing_algorithm": null,
    "categories": [
        "Business Platform"
    ],
    "description": {
        "en": "MobileGo (MGO) is a smart token set to herald a new era in the gaming industry. It is intended to gamify the Esport platform and incentivize gamers for loyalty and participation through rewards. Also, we are continuously working on expanding our geographical presence, forming new partnerships with world’s top gaming companies. Our ultimate goal is to make MGO a truly global token, traversing geographical borders and making games available to everyone.\r\n\r\nThe MGO token has an extremely broad scope of application, providing numerous benefits for different populations. For gamers, it will facilitate peer-to-peer matchplay and decentralized tournaments, serving both as a match reward and an entrance fee. Moreover, token holders will be able to earn additional discounts for purchasing in-game content.\r\n\r\nGame publishers can get paid in MGO, which has different advantages over fiat money, including the speed of processing payment requests. For crypto enthusiasts, it is an extremely valuable investment: With a $50 billion mobile market and around 1K games being registered on platforms like Google Play and Apple every day, acquiring just a fraction of market penetration results in large revenues."
    },
    "country_origin": "US",
    "genesis_date": null,
    "contract_address": "0x40395044ac3c0c57051906da938b54bd6557f212",
    "url": "https://mobilego.io/",
    "explorers": [
        "https://etherscan.io/token/0x40395044Ac3c0C57051906dA938B54BD6557F212",
        "https://ethplorer.io/address/0x40395044ac3c0c57051906da938b54bd6557f212"
    ],
    "twitter": "Mobilegooff",
    "facebook": "MobileGo-Community-1105566382915177",
    "telegram": "mobilegochat",
    "reddit": "MobileGo/"
}