{
    "id": "modihost",
    "symbol": "aim",
    "name": "ModiHost",
    "platforms": {
        "eos": ""
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "ModiHost is an innovative SaaS hotel management system facilitating easy access to AI technologies for hotels of any size or complexity.\r\n\r\nUsing blockchain for transparency, the system harnesses the power of AI to deliver the best possible customer experience – for hotels and their guests. ModiHost predicts customers' needs beyond their expectations.\r\n\r\nModihost creates an exceptional, personalised experience for the guest with several technologies like Watson Personal Assistant, chatbots, and direct interaction.\r\n\r\nThe platform's AI capabilities significantly increase Upsale Rate. ModiHosts' Direct Interaction with guests generates suggestions for the hotel staff members who can deliver relevant, on time and personalised attention to each guest, which converts to upsales.\r\n\r\nAI and robotics automate routine daily hotel operations, reducing costs and freeing staff to focus on maximising the quality of hotel services in other vital areas.\r\n\r\nAIM Token\r\n\r\nThe AIM token will be used to provide payment for services acquired through the ModiHost HMS, while giving token pool operators an incentive to lend tokens to hotels. Businesses will be able to earn a discount on fees due to ModiHost by using the platform while staking AIM tokens. Through a token generation event, ModiHost will create a distributed community of pool operators, who will provide work on the network, enabling the efficient provision of tokens to cover operational fees."
    },
    "country_origin": "SG",
    "genesis_date": null,
    "url": "https://modihost.io/",
    "explorers": [
        "https://www.bloks.io/account/aim",
        "https://www.bloks.io/tokens/AIM-eos-aim"
    ],
    "twitter": "ModiHost",
    "facebook": "ModiHost-110181610374825",
    "telegram": "ModiHost",
    "github_org": "ModiHost"
}