{
    "id": "myce",
    "symbol": "yce",
    "name": "MYCE",
    "platforms": {},
    "hashing_algorithm": "Scrypt",
    "categories": [
        "Masternodes"
    ],
    "description": {
        "en": "MYCE will behave as a colony, a united profit oriented group. We will act together by simplifying and empowering our users current investments. Our value proposition relies on making our network bigger and dynamic, communities working together.\r\n\r\nExpanding on this current space will need the integration of consensus systems based on masternode ownership and developed tools applied to simplify them. It allows us to grow in a descentralized and organic way.\r\n\r\nMYCE won’t only choose blockchain-based technology, but projects that will expand our reach of connections exponentially. We will choose and be chosen by communities. Once MYCE chooses a project we will empower our users to be part of those projects with real discounted benefits.\r\n\r\nOwning MYCE will grant discounts on transactions for other masternodes. The real value of a discount token is when it’s used, it makes investors either stake their rewards until reaching another masternode, or exchanging them for another project inside MYCE. That would be the exact investor we are looking to be part of MYCE. In current models the profit and power of the network is within a company or development team, we are setting our incentives on spreading profit and power into holders.\r\n\r\nIn summary MYCE will:\r\n\r\n- Create it’s own decentralized exchange\r\n- Simplify owning a masternode or staking them\r\n- Create it’s own pool to mine coins on our network\r\n- Implement a dashboard to track MYCE stats and networked coins\r\n- Profit by helping other coins to fulfill their use cases"
    },
    "country_origin": "",
    "genesis_date": null,
    "url": "https://www.myce.world",
    "explorers": [
        "http://explorer.myce.world"
    ],
    "twitter": "myceworld",
    "telegram": "myceworld",
    "reddit": "myceworld",
    "github_org": "myceworld"
}