{
    "id": "tacocat-token",
    "symbol": "tct",
    "name": "TacoCat Token",
    "platforms": {
        "binance-smart-chain": "0xb036f689bd98b4bd3bd648fa09a23e54d839a859"
    },
    "hashing_algorithm": null,
    "categories": [
        "Meme Tokens",
        "Binance Smart Chain Ecosystem"
    ],
    "description": {
        "en": "TacoCat Token (TCT) is the backbone of the TacoCat Ecosystem and is written using a BSC smart contract that was custom-bult from the ground up by the The Tacocat Co, and audited by employees at TechRate. \r\n\r\nTCT provides for a custom and dynamic transaction fee which offers developers flexibility for future upgrades and holders enhanced security among use-cases. \r\n\r\nBecause the transaction fee is dynamic, It is adjusted over time, and therefor the most updated transaction fee will always be displayed on our site. (www.tacocat.co)  \r\n\r\nDynamic Taxation System.\r\nAt TCT we have a dynamic Taxation system that can adapt to market and our project as the time goas on. \r\n\r\nOur Current Taxation are distributed as 9% on Buys and 9% on Sells.\r\n\r\n44% Of the Transaction fees go into Liquidity \r\nThis is used to provide Liquidity to promote stability in the token value.\r\n\r\n44.4% of the Transaction fees go into TacoShell\r\nThe flagship feature of the Tacocat Token Smart Contract.\r\nThis is our buyback feature that helps us reinvest in TCT or swap for marketing funds.\r\nThis pays out reflection in BNB.\r\n\r\n11.6% of Transaction fee go into Reflections.\r\nReflection is distributed among holders proportionally\r\n\r\nAs the development of the TacoCat Ecosystem progresses and gains functionality, the utility of TCT increases. With an increase in TCT utility, investor faith and TCT value increases as well, resulting in an increase of volume. These increases in volume and TCT value grow the marketing and development budget derived from the transaction fee, thus funding further development of the ecosystem and helps to secure larger and more exclusive brand deals - leading to the release of new consumer products, NFT's, games, and content to be exclusively accessed using TCT. \r\n\r\nWith our new WildCard: Play to earn NFT based blockchain game, profits from the game will be reinvested into Tacocat (TCT) to keep a steady growth between Tacocat Token and all its projects.  \r\n\r\nWhen holders conduct transactions within the ecosystem, they are provided further rewards and additional exclusive access to the products and content that are the fruits of these business partnerships and brand deals"
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0xb036f689bd98b4bd3bd648fa09a23e54d839a859",
    "url": "https://tacocat.co/",
    "explorers": [
        "https://bscscan.com/token/0xb036f689bd98b4bd3bd648fa09a23e54d839a859"
    ],
    "twitter": "TacoCatToken",
    "facebook": "tacocattoken",
    "telegram": "tacocattoken",
    "reddit": "TacoCatCo/"
}