{
    "id": "tether",
    "symbol": "usdt",
    "name": "Tether",
    "platforms": {
        "ethereum": "0xdac17f958d2ee523a2206206994597c13d831ec7",
        "binance-smart-chain": "0x55d398326f99059ff775485246999027b3197955",
        "solana": "Es9vMFrzaCERmJfrF4H2FYD4KCoNkY11McCe8BenwNYB",
        "huobi-token": "0xa71edc38d189767582c38a3145b5873052c3e47a",
        "avalanche": "0xc7198437980c041c805a1edcba50c1ce5db95118",
        "polygon-pos": "0xc2132d05d31c914a87c6611c10748aeb04b58e8f",
        "iotex": "0x3cdb7c48e70b854ed2fa392e21687501d84b3afc",
        "harmony-shard-0": "0x3c2b8be99c50593081eaa2a724f0b8285f5aba8f",
        "okex-chain": "0x382bb369d343125bfb2117af9c149795c6c65c50",
        "arbitrum-one": "0xfd086bc7cd5c481dcc9c85ebe478a1c0b69fcbb9",
        "moonriver": "0xb44a9b6905af7c801311e8f4e76932ee959c663c",
        "optimistic-ethereum": "0x94b008aa00579c1307b0ef2c499ad98a8ce58e58",
        "tomochain": "0x381b31409e4d220919b2cff012ed94d70135a59e"
    },
    "hashing_algorithm": null,
    "categories": [
        "USD Stablecoin",
        "Stablecoins"
    ],
    "description": {
        "en": "Tether (USDT) is a cryptocurrency with a value meant to mirror the value of the U.S. dollar. The idea was to create a stable cryptocurrency that can be used like digital dollars. Coins that serve this purpose of being a stable dollar substitute are called “stable coins.” Tether is the most popular stable coin and even acts as a dollar replacement on many popular exchanges! According to their site, Tether converts cash into digital currency, to anchor or “tether” the value of the coin to the price of national currencies like the US dollar, the Euro, and the Yen. Like other cryptos it uses blockchain. Unlike other cryptos, it is [according to the official Tether site] “100% backed by USD” (USD is held in reserve). The primary use of Tether is that it offers some stability to the otherwise volatile crypto space and offers liquidity to exchanges who can’t deal in dollars and with banks (for example to the sometimes controversial but leading exchange <a href=\"https://www.coingecko.com/en/exchanges/bitfinex\">Bitfinex</a>).\r\n\r\nThe digital coins are issued by a company called Tether Limited that is governed by the laws of the British Virgin Islands, according to the legal part of its website. It is incorporated in Hong Kong. It has emerged that Jan Ludovicus van der Velde is the CEO of cryptocurrency exchange Bitfinex, which has been accused of being involved in the price manipulation of bitcoin, as well as tether. Many people trading on exchanges, including Bitfinex, will use tether to buy other cryptocurrencies like bitcoin. Tether Limited argues that using this method to buy virtual currencies allows users to move fiat in and out of an exchange more quickly and cheaply. Also, exchanges typically have rocky relationships with banks, and using Tether is a way to circumvent that.\r\n\r\nUSDT is fairly simple to use. Once on exchanges like <a href=\"https://www.coingecko.com/en/exchanges/poloniex\">Poloniex</a> or Bittrex, it can be used to purchase Bitcoin and other cryptocurrencies. It can be easily transferred from an exchange to any Omni Layer enabled wallet. Tether has no transaction fees, although external wallets and exchanges may charge one. In order to convert USDT to USD and vise versa through the Tether.to Platform, users must pay a small fee. Buying and selling Tether for Bitcoin can be done through a variety of exchanges like the ones mentioned previously or through the Tether.to platform, which also allows the conversion between USD to and from your bank account."
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0xdac17f958d2ee523a2206206994597c13d831ec7",
    "url": "https://tether.to/",
    "explorers": [
        "https://blockchair.com/bitcoin/omni/property/31",
        "https://www.omniexplorer.info/asset/31",
        "https://etherscan.io/token/0xdac17f958d2ee523a2206206994597c13d831ec7",
        "https://ethplorer.io/address/0xdac17f958d2ee523a2206206994597c13d831ec7",
        "https://tronscan.org/#/token20/TR7NHqjeKQxGTCi8q8ZY4pL8otSzgjLj6t"
    ],
    "twitter": "Tether_to",
    "facebook": "tether.to"
}