{
    "id": "the-crypt-space",
    "symbol": "crypt",
    "name": "The Crypt Space",
    "platforms": {
        "binance-smart-chain": "0x9c0c8156b268a4432191a282bdf4287019526cce"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "The Crypt Space($CRYPT), a dedicated project with the goal of making crypto a safer space. They will be developing and launching products creating a safer place while filling market gaps. \r\nThe Crypt Space is your one stop shop for all your Crypto and NFT needs and comes with interchangeable rewards that you the community vote for. \r\n\r\nLead dev is fully doxxed and they have a massive experienced team that have worked on FEG, Gold, Richie and Farm. \r\n\r\nFirst product is THE NFT marketplace which in the future will include a fully integrated NFT exchange. \r\n\r\nSecond is the Crypt Tracker™, a portfolio tracker available for BSC and ERC20 Assets. We all know that there are many great trackers out there, but this team has found several gaps that they are bringing to Crypt Tracker - from Charts, Alerts and Data Analytics. \r\n\r\nThird product will be Crypt Launch™, a much safer place to launch tokens on the ERC and BSC networks. Investors will be able to use Crypt Launch™ to research the risk level of new tokens. Token creators will be able to launch on our platform after being thoroughly evaluated. Crypt Launch™ will connect selective investors with great projects. \r\n\r\nCrypt Launch™ is a fully automated launch pad for new projects, they will vet any projects wanting to list and provide a seal of approval so you know your funds are safu. "
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x9c0c8156b268a4432191a282bdf4287019526cce",
    "url": "https://www.thecryptspace.com/",
    "explorers": [
        "https://bscscan.com/token/0x9C0C8156b268A4432191A282BdF4287019526cCe"
    ],
    "twitter": "TheCryptSpace",
    "telegram": "TheCryptSpace_CommunityChat",
    "github_org": "TheCryptSpace"
}