{
    "id": "the-luxury",
    "symbol": "tlx",
    "name": "The Luxury",
    "platforms": {
        "binance-smart-chain": "0xea255909e46a54d54255219468991c69ca0e659d"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "The Luxury has created a blockchain payment ecosystem with the TLPoS, and the virtual wallet. The TLPoS is their blockchain-powered wireless point-of-sale (POS) for cryptocurrencies.\r\n\r\nUsing the TLPoS, retail merchants, as well as consumers, can easily buy, sell, and transact using digital assets in physical stores. The product is designed to accept every cryptocurrency. Popular digital assets like Bitcoin (BTC), Binance Smart Chain (BNB and The Luxury (TLX) are listed within the ecosystem.\r\n\r\nUsers can use The Luxury Bank to easily manage their digital assets, make transfers, check balances, and top-up the supported cryptos in the wallet. The virtual The Luxury card will be issued to every registered The Luxury user in Q1 2022.\r\n\r\nIn August 2021, The Luxury launched the Open Platform to support more blockchains. Since then, developers and projects can register and create their blockchain extension to the The Luxury ecosystem, increasing its use.\r\n\r\nThey want to have a complete ecosystem for the luxury industry. Through satellite projects such as: NFT Marketplace, Crypto-Bank which incorporates both a marketplace and PoS system for online/offline payment processing, a launchpad for projects targeting this industry, with a charity foundation attached, and Luxandia, which it wants to be a revolutionary metaverse platform for the luxury industry through the functions that are being developed, The Luxury’s team plan to revolutionize the luxury industry."
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0xea255909e46a54d54255219468991c69ca0e659d",
    "url": "https://theluxurybank.com",
    "explorers": [
        "https://bscscan.com/token/0xea255909e46a54d54255219468991c69ca0e659d"
    ],
    "twitter": "xtheluxury",
    "telegram": "tlxtrading"
}