{
    "id": "tokenstars-team",
    "symbol": "team",
    "name": "TEAM",
    "platforms": {
        "ethereum": "0x1c79ab32c66acaa1e9e81952b8aaa581b43e54e7"
    },
    "hashing_algorithm": null,
    "categories": [
        "Sports"
    ],
    "description": {
        "en": "TokenStars is the talent management platform (sports & showbiz), that connects stars, fans and advertisers.\r\n• Platform is launched: 6 modules are live on blockchain.\r\n• 10,000 registered users on the platform (additionally to the ICO participants) and 6,000 tokenholders.\r\n\r\nProject solves 4 major problems of the industry:\r\n1. Junior talents need funding for the career development: we provide financial support to young athletes and receive fees from their future income.\r\n2. Sports & showbiz stars require more attention from sponsors: we help them to grow fan audience and acquire more advertising contracts.\r\n3. Fans need more interaction with favorite stars: our platform allows them to communicate, endorse, promote and participate in exclusive activities.\r\n4. Advertisers need more engaging ways to reach an audience: TokenStars provides an access to involved fan audience and increases the ROI by implementing advertising smart contracts.\r\n\r\nWhy blockchain: TokenStars platform will provide incentives for fans-stars-advertisers cooperation and ensure transparency of advertising contracts and fans engagement. We record in the ledger the events of interaction between the participants, such as voting results, applications from the talent scouts, advertising clicks, earning or spending the tokens by platform participants."
    },
    "country_origin": "VG",
    "genesis_date": null,
    "contract_address": "0x1c79ab32c66acaa1e9e81952b8aaa581b43e54e7",
    "url": "https://tokenstars.com",
    "explorers": [
        "https://etherscan.io/token/0x1c79ab32C66aCAa1e9E81952B8AAa581B43e54E7",
        "https://ethplorer.io/address/0x1c79ab32c66acaa1e9e81952b8aaa581b43e54e7"
    ],
    "twitter": "tokenstars",
    "facebook": "TokenStars",
    "telegram": "TokenStars_en",
    "reddit": "TokenStars/",
    "github_org": "tokenstars"
}