{
    "id": "truebit-protocol",
    "symbol": "tru",
    "name": "Truebit Protocol",
    "platforms": {
        "ethereum": "0xf65b5c5104c4fafd4b709d9d60a185eae063276c"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "What Is Truebit (TRU)?\r\n \r\nTruebit allows software running outside a blockchain environment to provide trusted results to smart contracts and applications running within a blockchain. The platform allows practically unlimited external compute resources to be applied in a trusted way to extend the performance, throughput, and scalability of its host blockchain. Research began in 2015 on this verification solution which today connects blockchains to both on-chain and off-chain data while enabling smart contracts to securely perform complex computations in standard, easy-to-use programming languages at significantly reduced gas costs. \r\n\r\nUnlike sharding and other methods for distributing high transaction throughput, Truebit processes complex and large transactions via a consensus mechanism involving a minimal number of redundancies, making it a novel solution for Web 3.0 infrastructure. The bulk of computation occurs with off-chain resources.\r\n \r\nVerifier’s Dilemma - What Makes Truebit Unique?\r\n \r\nRather than relying on external, cryptographic proofs of correctness, Truebit brings scalable computation to blockchains by leveraging game theory principles and financial incentives to increase the on-chain computation power of existing networks and reduce marginal gas costs.\r\n \r\nWhile smart contracts can perform small computations correctly, large computation tasks pose security risks for blockchains due to the Verifier's Dilemma. Truebit counteracts this via a retrofitting oracle that achieves correct computational results. Truebit’s microeconomy ensures trustless verification through a financial incentive layer atop a dispute resolution layer.\r\n \r\nWho is the founder of Truebit (TRU)?\r\n \r\nTruebit was founded by mathematician and computer scientist Jason Teutsch who co-authored the whitepaper with Ethereum’s Solidity creator and team lead, Christian Reitwiessner. Jason holds a PhD in Mathematics, was a two-time US Fulbright Fellow, and co-discovered the Verifier’s Dilemma.\r\n \r\nApplications\r\n\r\nApplications include:\r\nLayer-2 settlements \r\nDeFi settlements and bookkeeping\r\nBatch verification of cryptographic signatures\r\nChecking proof-of-work\r\nPerforming operation(s) with high computational complexity\r\n \r\nAny smart contract can issue a computation task to Truebit in standard languages (C, C++, or Rust) without concern for Ethereum’s gas limit. Truebit’s WebAssembly-based architecture can read functions and data from Ethereum bytes, smart contract program code, or IPFS.\r\n \r\nWhat kind of token is Truebit (TRU)?\r\n \r\nThe supply of TRU tokens may fluctuate over time.  \r\n \r\nLearn more about Truebit:\r\n \r\nGetting started with Truebit on Ethereum  \r\nhttps://medium.com/truebit/getting-started-with-truebit-on-ethereum-ac1c7cdb0907\r\nAn Intro to TrueBit: A Scalable, Decentralized Computational Court   https://medium.com/@simondlr/an-intro-to-truebit-a-scalable-decentralized-computational-court-1475531400c3\r\n \r\nLearn more about Ethereum:\r\nEthereum\r\nhttps://ethereum.org/en/"
    },
    "country_origin": "GB",
    "genesis_date": null,
    "contract_address": "0xf65b5c5104c4fafd4b709d9d60a185eae063276c",
    "url": "https://truebit.io/#home",
    "explorers": [
        "https://etherscan.io/token/0xf65B5C5104c4faFD4b709d9D60a185eAE063276c",
        "https://ethplorer.io/address/0xf65b5c5104c4fafd4b709d9d60a185eae063276c"
    ],
    "twitter": "Truebitprotocol",
    "reddit": "truebit/",
    "github_org": "TruebitProtocol"
}