{
    "id": "tycoon-global",
    "symbol": "tct",
    "name": "Tycoon Global",
    "platforms": {},
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Tycoon Global Real Estate Investment Platform (hereafter referred to as Tycoon Global) is a decentralized real estate investment, trading, and management platform, which is based on Ethereum. Through a decentralized blockchain platform, Tycoon Global directly connects international investors with global real estate assets. With Australian residential development and commercial real estate management as its primary focus, Tycoon Global builds a new real estate ecosystem including investment, development, construction, project management, property management and transactions based on transparency, openness and trust.\r\n\r\nThe tycoon chain token (TCT) is the official token of Tycoon Global. It can be used to purchase real estate globally and it will also be used as requested for initiating orders, forming smart contracts, fulfilling contracts, and publishing comments on Tycoon Global. With the new real estate ecology created by Tycoon Global, traders and service providers are all able to use TCT as the payment method, including investment, trading, the supply of building materials, property management, architectural design services, construction, interior design services, decoration and renovation, commercial and residential property lease. Therefore, unlike the vast majority of tokens currently on the market, TCT tightly connects to the real estate assets and property industry, and will be used in a high frequency in residential, commercial and industrial scenarios, with greater potential for holding and appreciation. At the same time, Tycoon Global will buy back a certain amount of TCTs according to the profit per annum."
    },
    "country_origin": "",
    "genesis_date": null,
    "url": "http://www.tycoon.global/",
    "explorers": [],
    "twitter": "TCTCoin",
    "facebook": "TCTCoinAtoZ",
    "telegram": "TCTcoin_en"
}