{
    "id": "fesbnb",
    "symbol": "fesbnb",
    "name": "FesBNB",
    "platforms": {
        "binance-smart-chain": "0x8371a55dbee669f16bd9e6137e2ce39ee87ae8e2"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "What is FesBNB?\r\nFesBNB is the Safest and Fairest platform for everyone. FES stand for, \"\"For Every Sun\"\". Which means our main focus is to be a fair token with a lot of utility in the near future. \r\n\r\nHow Can FesBNB Be The Safest Platform?\r\nFesBNB has a professional team and an experienced Dev who wrote our contract & staking platform. Our Developer is one of the safest and well known in the BSC space and has handled over 70+ projects.\r\n\r\nTo gain trust, FesBNB has had our contract audited by Trynos before and after it was deployed to insure it’s safety. Trynos is known as one the safest and more experienced contract writers/individual auditors there is. He has fully audited our token contract, our staking contract and staking platform to ensure trust to all our investors.\r\n\r\nFair System\r\nOur contract doesn’t allow those who stake to receive reflections in BNB. Stakers will receive 7.5% (of tokens listed in the staking pool) for every transaction. Since not everyone will want to stake their tokens, FesBNB will reward those who choose to simply hold with 5% BNB for every transaction. This is what makes FesBNB the fairest token for everyone in the market!\r\n\r\nFesBNB does not just offer one single coin as a reward to those who stake. When staking, you are rewarded with 5 different blue-chip coins (ETH, ADA, XRP, CAKE, and DOT) with only the payment of a small gas fee to enter the pool. Whether you are holding or staking, FesBNB is the ultimate earning platform!"
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x8371a55dbee669f16bd9e6137e2ce39ee87ae8e2",
    "url": "https://fesbnb.io",
    "explorers": [
        "https://bscscan.com/token/0x8371a55dbee669f16bd9e6137e2ce39ee87ae8e2"
    ],
    "twitter": "FesBNB",
    "telegram": "fesbnb",
    "reddit": "FesBNB/"
}