{
    "id": "five-star-coin",
    "symbol": "fsc",
    "name": "Five Star Coin",
    "platforms": {},
    "hashing_algorithm": "Ethash",
    "categories": [
        "Business Services"
    ],
    "description": {
        "en": "Basic info about Five Star Coin\r\nMaking crypto a secure form of payment\r\nBy applying the technology to a series of real world use cases, With the goals of supporting the online platforms and technology available we have come up with the idea of five star coin. Five star coin is a first step to becoming part of a new movement of financially savvy and forward-thinking users.The motto is to provide a digital crypto platform for easy, safe and secure payments.\r\n\r\nFSC is a Decentralized Cryptocurrency Network having it's Own Blockchain Platform to Run Smart Contracts and Applications Exactly as per Programmed without any possibility of Censorship or Third Party Interference. FSC is A Hard Fork Of Ethereum. By applying the technology to a series of real world use cases, With the goals of supporting the online platforms and technology available we have come up with the idea of five star coin. Five star coin is a first step to becoming part of a new movement of financially savvy and forward-thinking users. The motto is to provide a digital crypto platform for easy, safe and secure payments.\r\n\r\nFive Star Coin provides user-friendly, efficient and secure crypto banking, payments and eCommerce solution utilizing blockchain technology, underpinned by Five Star Coin.\r\n\r\nFSC provide transparent environment, reliability and integrity to various industries like eCommerce, Online Education, eRecharge, Bill Payments and All Types of Tickets Booking (Movie, Bus, Train, Flight), Hotel Booking, Transportation, Matromonay, Austrology, Socisl Media, Banking, MLM and the Marketing and Advertisement Industry.\r\n\r\nFSC users can Buy any Available Product On eCommerce Platform Five Star Shop (https://fivestarshop.in) by using Five Star Coin. Five Star Shop Users can add FSC Wallet Balance at Five Star Shop Wallet, Convart FSC in INR as per Live Market Rate and after Shopping use payment option to pay by FSS Shopping Wallet.\r\n\r\nIn Near Future Five Star Education, Matromonay, Auto, Bike and CAB Services, Social Media and Many Projects Will Launch. Anybody from any Business Sector Can Join us as Partner, Contributor, Franchise, Token Ownere or user to Earn Maxmimum Benifits of FSC Blockchain Technology based Projects. FSC platform allows users to Generate Their Own Token Coins by Creating Smart Contracts which work as an agreement between all involved users. The platform has its own currency, FSC, which can be used to Generate Token Coins. Any User have FSC Wallet Balance Can Generate his Own FSC Based Token Coin without any Cost (Cost Equal to a FSC Transation Fee) and Start his Own Business Independantly. A FSC Token Owner can Make Transtions of that Token with other uaers using FSC Blockchain and Transion Fees Will Deducted in Form Of FSC.\""
    },
    "country_origin": "IN",
    "genesis_date": null,
    "url": "https://fivestarcoin.in/",
    "explorers": [
        "https://fivestarcoin.in/explorer"
    ],
    "twitter": "Five_Star_Coin",
    "facebook": "fivestarcoin.in",
    "telegram": "fivestarcoin_official",
    "github_org": "fsccoin"
}