{
    "id": "forint",
    "symbol": "forint",
    "name": "Forint",
    "platforms": {
        "binance-smart-chain": "0xae8d1d335364ae1d16677390750aeb4c1b2332cb"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Forint is a revolutionary token dedicated to the redistribution of values across the globe. Equity, sustainability, progress and charity are the main goals of Forint, that aims at creating a much more balanced environment. Leveraging the blockchain, taking advantage of NFTs technology and transforming the obsolete e-business trade flow into a pool of new opportunities for producers, sellers and customers. This is going to be the key for a safer, reliable and fair fund allocation.\r\nFirstly, we believe that the e-business world must innovate, leveraging the power of cryptos as a source of reliability and competitive advantage. Forint Platform will integrate our idea of B2B and B2C new e-Market that will multiply. The profitability of the whole trade and services chain. New opportunities for producers and sellers, based on  higher returns. Customers will have the possibility to pay with cryptos. The system will have a smarter, faster and cheaper approach. On this platform, users will have the chance to stake their coins and earn interests. It will also respect the billing system in accordance with the law.\r\nOn the Forint platform, users will take advantage of a simplified and integrated technology that is going to take care of the fiscal side between governative entities, firms and consumers. The platform will integrate an on demand fiscal consulting service based on the regulations of each country. It will serve as to fill the gap existing between investors and fiscality.\r\nIn addition, users will have the chance to leverage a convenient management of their digital assets."
    },
    "country_origin": "GB",
    "genesis_date": null,
    "contract_address": "0xae8d1d335364ae1d16677390750aeb4c1b2332cb",
    "url": "https://www.forint-token.net/",
    "explorers": [
        "https://bscscan.com/token/0xAe8D1d335364aE1d16677390750aEB4C1b2332cb"
    ],
    "twitter": "ForintToken",
    "reddit": "Forint/",
    "github_org": "Forint-token"
}