{
    "id": "fundin",
    "symbol": "fdn",
    "name": "FUNDIN",
    "platforms": {},
    "hashing_algorithm": "Quark",
    "categories": [],
    "description": {
        "en": "Many of the cryptocurrencies developed nowadays is just a fork of bitcoin and its other forks without trying to utilize the potentiality of blockchain for the upliftment of technology and revolutionizing existing infrastructures and systems.\r\n\r\nFundin is a Blockchain platform which will increase transparency ensuring creators get paid after delivering on promised milestones with simpler and easy to understand Smart contract in the source (Bitcoin) blockchain with implementation of BIP65. Fundin Blockchain integrates pre-activated Zerocoin protocol from PIVX  to ensures the privacy and identity security of both creators and backers.\r\n\r\nA cryptocurrency called FDN will be used to facilitate crowdfunding process in platform enabling the blockchain features. In addition, the technology will also allow users to contribute not only finances, but will act as a platform to showcase their skills and talents providing them with exposure and financial rewards. With this in view, Fundin will be able to revolutionize the way existing crowdfunding system operates.\r\n\r\nUse of Blockchain technology to eradicate transparency issues and control over financial irregularities.\r\nConsensus voting for selecting project.\r\nPlatform should be available for all the people living in any  corner of the earth.\r\nMechanism for security of Backer's investment.\r\nPlatform and payment fee should be minimal.\r\nIn addition, the technology will also allow users to contribute not only finances, but will act as a platform to showcase their skills and talents providing them with exposure and financial rewards. With this in view we will be able to revolutionize the way existing crowdfunding system.\r\n\r\nMany of the projects raising capital through crowdfunding takes away all the raised fund after paying certain fees to the platform leaving backers with nothing but a hope and excuses from the failing project putting their entire contribution at risk.\r\n\r\nOur platform on the other hand puts the amount in multisig wallet where certain amount as required for one milestone is released to creators and after successful completion of the said milestone it is shared and confirmed by the backers and the next fund for another milestone is then released with low to no fee to the platform connecting backers and creators without any mediators taking decision of others vision.\r\n\r\nMany creators and entrepreneurs in developing countries with groundbreaking projects are deprived from raising the required seed funds to start the projects because of lack of exposure. As blockchain itself is truly decentralize and make globalization a true thing.\r\n\r\nFundin blockchain is determined to take active role in providing investor protections, as current platform who adopt a more passive role with the apparent aim of avoiding liability. "
    },
    "country_origin": "",
    "genesis_date": null,
    "url": "https://fundin.xyz/",
    "explorers": [
        "http://explorer2.fundin.cf/"
    ],
    "twitter": "Fundin10",
    "github_org": "fundin"
}