{
    "id": "ilayer",
    "symbol": "ilayer",
    "name": "iLayer",
    "platforms": {
        "binance-smart-chain": "0xe540980f909873370bbe9c19db7c3b5ba4def701"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "iLayer is unlike any of its predecessors and is the first of its kind, next generation, mathematically structured ecosystem. The iLayer token itself uses the ‘buyback’ concept in which each buy and sell incurs a tax of 5% that is added to the ‘buyback wallet’ or what we are calling the ‘iVault’. The ‘iVault’ amount guarantees a rising floor price over time for investors to feel safe about. The ‘iVault’ will be used in times of market volatility to ensure a stable rising price floor. \r\n\r\nBut that is not all, the iLayer project is much more than that, iLayer will allow vetted projects to join in for a small tax fee (which is paid towards the ‘iVault’), regardless of which reward concept they utilize. This will allow them to benefit from the enormous taxes generated from the mathematically structured ecosystem. \r\n\r\nProjects that add themselves into the ecosystem will benefit from the mathematically layered structure massively, with several times more taxes generated for them then they have paid out, helping them overcome the initial pump and dump and have a more sustained, long term outlook while giving their holders more rewards. Whether projects use the hyper-deflationary model, autonomous yield model, liquidity generation model, the buy-back model, other reward models or a combination, they will be able to attach themselves within the ecosystem for a small fee which will be paid to the previous phase of projects. \r\nWhy join the ecosystem? Many projects fail after the ‘initial pump’ because they are unable to sustain the trading volume needed to keep yield and liquidity generation viable, forcing loyal holders to sell and move on to other projects. iLayer solves this by putting in place a layered ecosystem with phases and a mathematical formula which will allow long term sustainable volume, growth and rewards. "
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0xe540980f909873370bbe9c19db7c3b5ba4def701",
    "url": "https://www.ilayer.io/",
    "explorers": [
        "https://bscscan.com/token/0xe540980f909873370bbe9c19db7c3b5ba4def701"
    ],
    "twitter": "iLayerEcosystem",
    "telegram": "iLayerEcosystem"
}