{
    "id": "ionomy",
    "symbol": "ion",
    "name": "Ionomy",
    "platforms": {},
    "hashing_algorithm": null,
    "categories": [
        "Masternodes"
    ],
    "description": {
        "en": "Aiming to create monetary incentives for gamers and a way for game developers to provide monetary rewards in their games, ION is a decentralized blockchain cryptocurrency that rewards its users through a “proof-of-stake” consensus system. Alongside ION, Economy, a digital entertainment platform for gamers and game developers was also launched in April 2016. ION is based mostly on the idea of making it easier for game developers to incentivize participation in both their premium and free games. The motto of the ION cryptocurrency platform economy is “The Business of Fun”, and it mainly tries to add a social component to digital currency, making it fun and bringing in the possibility for networking.\r\n\r\nION is a digital currency which is primarily given as rewards and incentives to gamers playing on its platform, Economy. It aims to make cryptocurrency fun and social, while simultaneously rewarding gamers for participation. The ION cryptocurrency works on the “static proof-of-stake” consensus system, which ensures that inactive investors cannot take advantage of it. The “Connectivity” system it works on makes the rewards proportional to the number of active users, promoting the community and keeping things fair while encouraging more people to participate. ION has also implemented a master node network, which can be used to perform advanced functions and ensure smoother and much faster transactions for larger holders.\r\n\r\nThe best part of ION, perhaps, is that ION tokens are given as a reward to gamers playing on the economy platform, and they are free to trade the coins for other cryptocurrencies or fiat currencies, too. Rather than other popular cryptocurrencies that focus on buying and selling of goods and are investment-centric (like <a href=\"https://www.coingecko.com/en/coins/bitcoin\">Bitcoin</a>), ION is focused on the gaming sector. It aims to give active gamers an incentive for participation and game developers a chance to add monetary incentives to their freedom as well as premium games. It’s focused on “everything that’s fun”, according to the ionomy website, whose very motto is “The Business of Fun”.\r\n\r\nFor a cryptocurrency launched before the crypto boom in 2017, ION has its advantages, the main one being that it boasts of being “fun”, unlike any other currency. The reward of winning is adequate for a true gamer, but an incentive involving money doesn’t hurt. Games on the ION platform like “To The Moon (Beta)” and “Crypto Gravity” (available for both Android and iOS) are gaining ground among gamers, and ION can only go up from where it is currently. Another perk of the ION cryptocurrency is that if you invest in it, in-app purchases on the games in the ION platform come much cheaper. ION developers offer up to 50% off on the purchases, if ION tokens are used. The cryptocurrency has just about started gaining ground within the gaming community, and its motto of “fun” and accessible nature are its selling points, making it likely to give returns in the long term."
    },
    "country_origin": "",
    "genesis_date": "2015-05-16",
    "url": "https://ionomy.com/",
    "explorers": [
        "https://ionchain.com/",
        "https://chainz.cryptoid.info/ion/"
    ],
    "twitter": "ionomics",
    "facebook": "ionomy",
    "telegram": "ionomy",
    "reddit": "ionomy/",
    "github_org": "ionomy"
}