{
    "id": "refine-medium",
    "symbol": "xrm",
    "name": "Refine Medium",
    "platforms": {
        "ethereum": "0xe1329ebf8b719881549909d689987f746a8931d1"
    },
    "hashing_algorithm": null,
    "categories": [
        "Entertainment"
    ],
    "description": {
        "en": "\"Refine Medium is a decentralized media platform rendering authentic and high quality video content. It is built upon Ethereum technology designed to enable viewers, creators and innovators of the platform to connect via blockchain based smart contracts. A one-of-its-kind platform that will incentivize each and every stakeholder for their contribution to the platform.\r\n\r\nRefineMedium has come up with a social video platform which aims to bridge the gap between “human being” & “being human” as humanity thrives forever. There are 4 stages of building a quality creator in the RefineMedium ecosystem- Creators with a new idea and raw content, Creators collaborating with RefineMedium moderators to cause a positive impact on their creation with a touch of professionalism, Creators who have established their identity on the platform and intend to progress and prosper and at last, Creators who have achieved enough prosperity and stardom and intend to cause lasting changes in the society and inspire others to do the same. RefineMedium aims to provide an ecosystem which nurtures a naive creator into a self-actualized one. The goal is to reach the top of the “Refine Rhombus”\r\n\""
    },
    "country_origin": "HK",
    "genesis_date": null,
    "contract_address": "0xe1329ebf8b719881549909d689987f746a8931d1",
    "url": "https://www.refinemedium.com",
    "explorers": [
        "https://etherscan.io/token/0xe1329ebf8b719881549909d689987f746a8931d1",
        "https://ethplorer.io/address/0xe1329ebf8b719881549909d689987f746a8931d1"
    ],
    "twitter": "RefineMedium",
    "facebook": "refinemedium",
    "telegram": "refinemedium",
    "reddit": "RefineMedium"
}