{
    "id": "request-network",
    "symbol": "req",
    "name": "Request",
    "platforms": {
        "ethereum": "0x8f8221afbb33998d8584a2b05749ba73c37a938a"
    },
    "hashing_algorithm": null,
    "categories": [
        "xDAI Ecosystem",
        "Business Services"
    ],
    "description": {
        "en": "What Is Request (REQ)?\r\nThe Request (REQ) utility token, launched in 2017, ensures the performance and stability of the Request Network. The Request Network itself is an Ethereum-based decentralized payment system where anyone can request a payment and receive money through secure means. It removes the requirement for third parties in order to provide a cheaper, more secure payment solution that works with all global currencies.\r\n\r\nWhen a user creates a request for payment, they define to which address the payment needs to be allocated and what the amount is. The user can also define the terms and conditions of the payment, upgrading a simple request into an invoice. Once this is completed, the user can share their request to be paid by their counterparty.\r\n\r\nEvery step is documented and stored on the Request network, allowing everyone involved to easily keep track of all the invoices and payments for accounting purposes.\r\n\r\nRequest is also integrated with legislation across the world to remain compliant with the trade laws of each individual country.\r\n\r\nWho Are the Founders of Request?\r\nThe founders of Request are Christophe Lassuyt and Etienne Tatur.\r\n\r\nChristophe Lassuyt is currently the chief financial officer at Request. Before this position, he co-founded MONEYTIS.\r\n\r\nEtienne Tatur is the chief technical officer of Request. Prior to this, he also co-founded MONEYTIS and worked as a lead developer at QOBUZ, a music streaming service.\r\n\r\nWhat Makes Request Unique?\r\nThe payments on Request are performed by simply sending an invoice through the blockchain; the counterparty can then detect the request and pay it with one click in a peer-to-peer manner. The fact that the payments are push-generated instead of pull-generated is one of Request’s key advantages. There is no need for users to share their account information. The use of blockchain technology also eliminates the need for third-party processors, resulting in a reduction in transaction costs.\r\n\r\nThe Request Network leverages decentralized blockchains such as Ethereum and IPFS for an increased level of security, privacy and data ownership for the end-user. The platform does have transaction fees, which is a cost that is required to broadcast a change to the blockchain network. The transaction fees are used to incentivize miners to reach consensus on the state of the network.\r\n\r\nREQ can be stored on wallets such as Metamask, MyEtherWallet, Ledger, imToken, Trezor, Atomic Wallet, Jaxx Liberty and Trust Wallet.\r\n\r\nHow Many Request (REQ) Coins Are There in Circulation?\r\nREQ is an ERC-20 token that can be spent to use the Request Network.\r\n\r\nA portion of the REQ fee is burned at a rate that is determined by the current supply and the exchange rate with other currencies.\r\n\r\nRequest’s (REQ) circulating supply is at 999,912,165 REQ as of February 2021 and the maximum supply is 999,983,984 tokens.\r\n\r\nHow Is the Request Network Secured?\r\nREQ is an ERC-20 token based on the Ethereum platform. The requests made with REQ are stored on an immutable digital ledger. This ledger also serves as proof for all auditing purposes."
    },
    "country_origin": "DE",
    "genesis_date": "2017-10-07",
    "contract_address": "0x8f8221afbb33998d8584a2b05749ba73c37a938a",
    "url": "https://request.network",
    "explorers": [
        "https://etherscan.io/token/0x8f8221afbb33998d8584a2b05749ba73c37a938a",
        "https://ethplorer.io/address/0x8f8221afbb33998d8584a2b05749ba73c37a938a"
    ],
    "twitter": "requestnetwork",
    "reddit": "RequestNetwork",
    "github_org": "RequestNetwork"
}