{
    "id": "restart-energy",
    "symbol": "mwat",
    "name": "Restart Energy",
    "platforms": {
        "ethereum": "0x6425c6be902d692ae2db752b3c268afadb099d3b"
    },
    "hashing_algorithm": null,
    "categories": [
        "Cryptocurrency"
    ],
    "description": {
        "en": "As energy consumption is expected to double until 2030, the world is looking for new distributed energy development models to directly connect end users to producers, to allow consumers direct access to accountable, cheaper energy and to provide producers with increased ROI; enabling a faster renewable energy deployment around the world.\r\nOur solution is a new ecosystem - Restart Energy Democracy - one that exists inside the current legislation in deregulated energy markets and that provides incentives for consumers, producers. and local micro entrepreneurs, or even other private suppliers to participate.\r\n\r\nIt's a system built on blockchain technology, that virtually connects energy consumers to energy producers (prosumers) with smart contracts, so that they may trade directly under our supply license or under a different private suppliers license.\r\n\r\nAllowing consumers to virtually buy energy directly from producers reduces transaction risk and payment collection costs for the suppliers, creates higher revenues and a finance solution for producers, and reduces the cost of energy for consumers, while at the same time offering entrepreneurs the possibility to start their own power retail business with our franchise.\r\n\r\nAs we already have 30,000 customers, we will have first mover advantage compared to all the other energy ICO's."
    },
    "country_origin": "RO",
    "genesis_date": null,
    "contract_address": "0x6425c6be902d692ae2db752b3c268afadb099d3b",
    "url": "https://restartenergy.io",
    "explorers": [
        "https://etherscan.io/token/0x6425c6be902d692ae2db752b3c268afadb099d3b",
        "https://ethplorer.io/address/0x6425c6be902d692ae2db752b3c268afadb099d3b"
    ],
    "twitter": "restartenergyio",
    "facebook": "restartenergydemocracy",
    "telegram": "RestartEnergy",
    "reddit": "RestartEnergy/",
    "github_org": "TransylvaniaHighTech"
}