{
    "id": "revain",
    "symbol": "rev",
    "name": "Revain",
    "platforms": {
        "ethereum": "0x2ef52ed7de8c5ce03a4ef0efbe9b7450f2d7edc9"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Revain is one of the new alternative currencies to be introduced in the already hyper crypto market. Revain is an unbiased review platform built on blockchain technology, which allows users to stay highly motivated. With the platform being a new generation feedback platform build on the blockchain technology, the platform aims to reinvent the review industry. Obviously, it’s an industry that needs a change – this booming industry has been fraught with peril and fraud as malicious users relentlessly write fake reviews. Also, a five star review on TripAdvisor, Yelp, and similar ratings websites can change the course of a business.\r\n\r\nThe platform is led by Rinat Arslanov as the CEO. He is an entrepreneur with 10+ years in business, venture capital, and blockchain experience. Other key members of the team include Sergey Potekhin, who leads the development and blockchain design of Revain and holds the position of CEO of the Technology area; as well as developer Sergey Omilyanchuk, who is responsible for server and application architecture.\r\n\r\nIn 2018 the team plans to launch the RVN token in quarter 3 and release gaming reviews in quarter 4. Revain is a marketing platform in the form of a Yelp-like online review platform. Businesses incentivize users to leave public feedback that’s posted to Revain’s digital ledger on the <a href=\"https://www.coingecko.com/en/coins/ethereum\">Ethereum</a> blockchain."
    },
    "country_origin": "RU",
    "genesis_date": "2017-09-05",
    "contract_address": "0x2ef52ed7de8c5ce03a4ef0efbe9b7450f2d7edc9",
    "url": "https://revain.org/",
    "explorers": [
        "https://etherscan.io/token/0x2ef52Ed7De8c5ce03a4eF0efbe9B7450F2D7Edc9",
        "https://ethplorer.io/address/0x2ef52Ed7De8c5ce03a4eF0efbe9B7450F2D7Edc9"
    ],
    "twitter": "Revain_org",
    "telegram": "revainorg",
    "reddit": "revain_org/",
    "github_org": "Revain"
}