{
    "id": "risingsun",
    "symbol": "rsun",
    "name": "RisingSun",
    "platforms": {
        "binance-smart-chain": "0x917841c010b3d86ed886f36f2c9807e07a2e3093"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "RisingSun ($RSUN) powers the greatest play to earn NFT card game ecosystem on the Binance Smart Chain. Over 3 trillion collectable samurai battle cards make for one of the most unique gaming experiences on blockchain. The novel NFT card game is coming soon — SamuraiRising.\r\n\r\nA 6% buy tax and 12% sell tax are levied on all $RSUN transactions made on PancakeSwap. Half of all taxes are returned to holders in the form of $BUSD reflections, while the other half funds game development and marketing expenses.\r\n\r\nSamurai battle card NFTs drive RisingSun’s collect, trade and game-focused ecosystem. SamuraiRising, the upcoming trading card game, requires each player to hold a deck of 5 cards to play. Cards are purchased using $RSUN and the proceeds fund the game’s play to earn mechanics. Every battle card is unique and varies in both rarity and strength. This makes certain cards more desirable than others for players, traders and collectors alike.\r\n\r\nThere are two types of battle cards: shogun and samurai cards. In ancient Japan, a shogun was a prominent military figure and ruler. Shogun battle cards are the original generation of 5000 NFTs purchasable with $RSUN tokens on the SamuraiRising DApp. Each shogun samurai card is able to recruit new samurai cards, making them especially desirable. In addition, shogun samurai card holders receive an average of 1.5% of all $RSUN transactions reflected in $BUSD, providing further value.\r\n\r\nThe SamuraiRising DApp will allow users to connect their BSC wallets and purchase, view, trade and battle NFTs. Shogun and samurai battle cards are assigned stats and features that have direct in-game consequences. Each card has a unique name and visual representation. The value of a samurai card is determined by the scarcity of attributes that it possesses."
    },
    "country_origin": "US",
    "genesis_date": null,
    "contract_address": "0x917841c010b3d86ed886f36f2c9807e07a2e3093",
    "url": "https://risingsun.finance/",
    "explorers": [
        "https://bscscan.com/token/0x917841c010b3d86ED886F36F2C9807E07a2e3093"
    ],
    "twitter": "risingsuntoken",
    "telegram": "risingsun_token",
    "reddit": "RisingSunToken/",
    "github_org": "RisingSun-Token"
}