{
    "id": "robin-doge",
    "symbol": "rdoge",
    "name": "Robin Doge",
    "platforms": {
        "binance-smart-chain": "0xad4c080eacc8d083ea3285127b9b9a2494df5ab6"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "ROGE is the symbol of Crypto vs stocks. The debate that's been ongoing for the past few months. In short, while Robinhood manipulates the market at the expense of retail investors, our token focuses on helping all its believers. Through a universal tax and a revolutionary feature unique to cryptocurrencies, ROGE is the people's coin.\r\n\r\nWhile we are the RobinHood of Crypto, we are everything the RobinHood app is not to the Stock Market. Community-driven, transparent, and fair. Our BuyBack feature, inspired by MiniDoge, is the best tokenomic feature in the market. Having a constant buyback feature doesn’t really impact or change the chart in the long run, whereas targeted buybacks have much more of an impact. The feature we have in our contract, called AUTOBOOST, generates buy orders when the chart takes a serious dip, guaranteeing that new investors are always looking at a nice green chart.\r\n\r\nIn addition, a second primordial feature for any token project which wishes to survive the test of time is a tax that automatically converts BNB and sends it to a Marketing Wallet. As all investors in the Defi space are aware, Marketing is the most important factor in the growth and life of a coin. Having a marketing fee that is sent to a wallet is the difference between a short-term and long-term project. Running out of Marketing funds is synonymous with the end of a project, and having a “marketing wallet” is inefficient in that sense. Having a marketing fee, however, guarantees that as long as trading volume is reasonably high, some funds are being put at the service of marketing and growth. "
    },
    "country_origin": "US",
    "genesis_date": null,
    "contract_address": "0xad4c080eacc8d083ea3285127b9b9a2494df5ab6",
    "url": "https://www.robindoge.io/",
    "explorers": [
        "https://bscscan.com/token/0xad4c080eacc8d083ea3285127b9b9a2494df5ab6"
    ],
    "twitter": "robindogeio",
    "telegram": "robindogecommunity",
    "reddit": "RobinDoge/"
}