{
    "id": "roge",
    "symbol": "roge",
    "name": "Rogue Doge",
    "platforms": {
        "ethereum": "0x45734927fa2f616fbe19e65f42a0ef3d37d1c80a"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Roge is a fully decentralised ERC20 token on the Ethereum Network. It is community owned with a lead team heading up the day to day operations. This includes Communications, Marketing, Social Media and Project Usecase development and implementation, amongst many other general duties. We have a dynamic website with the embedded email rogetoken@gmail.com for external communications essential to our tokens growth. Roge's tokenomics include 1% reflection of any buy or sell of Roge. This means Roge is distributed to all existing holders. This adds value to an investors holdings generating a passive income. There is a 2% of the total supply maximum for any buy or sell of Roge. Additionally Roge has a sister token named Proge, which creates addition benefits to hold Roge in the form of a 5% tax on Proge buys and sells used to buy and burn Roge. This make Roge a deflationary token and provides addition value to investors as Roge becomes scarcer over time.\r\n\r\nRoge has an ethos to be accepting of all and promote and welcome others to join the growing community. Each member is valued and has appreciation from the others. The lead team will is instrumental with ensuring the community practices these principles and to administrate and police any interactions ongoing on all of our official channels so as to ensure the safety of our members. There is a huge emphasise on clarity and transparency of progress and community voting is a huge influence in house for making nearly all major decisions. \r\n\r\nRoge is ready to disrupt the memecoin market in a big way. Roge has three major projects to develop and install, which will ensure Roge is a market leading token with real life usecases. These are the Rogue’s Bazaar, which is an online marketplace where the Roge community will trade goods and digital services for Roge. The Rogue’s Exchange is a token exchange, which will have a number of unique features designed to offer either free or the lowest fees on trades and all without compromising on security. Finally the aptly named Project X. This innovation is a genuine disruptor to the memecoin market and indeed to the whole of Decentralised Finance. The lead team and community have already partnered up and developed an additional token with DeFi Guardianship tokenomics. These indirectly interact with Roge creating benefits to the two tokens and to the community. This unique combination has opened up a particular avenue that will provide both sustained long term growth and stability for Roge (and Proge) and go on to succeed in becoming main stead tokens within the future world of cryptocurrency."
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x45734927fa2f616fbe19e65f42a0ef3d37d1c80a",
    "url": "https://rogetoken.app/",
    "explorers": [
        "https://etherscan.io/token/0x45734927fa2f616fbe19e65f42a0ef3d37d1c80a",
        "https://ethplorer.io/address/0x45734927fa2f616fbe19e65f42a0ef3d37d1c80a"
    ],
    "twitter": "twintokenomics",
    "telegram": "RogeToken",
    "reddit": "RogeToken/",
    "github_org": "Roge-Token"
}