{
    "id": "rottschild",
    "symbol": "rotts",
    "name": "ROTTSCHILD",
    "platforms": {
        "ethereum": "0xfb40e79e56cc7d406707b66c4fd175e07eb2ae3c"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "The ROTTSCHILD project was born from an observation: despite the revolutionary technological advance that blockchain and cryptocurrencies have brought, there are still too few people in the world who have access to them. Either because they don't know how to do it, or because they were victims of fraud when they made the effort to join this world. So there are two major obstacles that prevent mass adoption of cryptocurrencies: lack of knowledge, and lack of security. The Rottschilds want to address both of these issues, by creating tools and services for everyone. \r\n\r\nFor those who are already in the crypto world, we will bring security, thanks to our ROTTS listing tool, which provides a contract audit, a project review, and a TrustScore. Our cartoon The Rottschilds will be fun, and educational: we'll learn the right way to manage an investment. For those who are new to cryptocurrency, we will create a whole learning curriculum, through ROTTS Academy. They will be able to learn what a blockchain is, how to create a wallet, how to buy their first coins, how to secure them. \r\n\r\nBut that's not all. We are convinced that cryptocurrencies are the future. The ROTTS token is at the heart of our project, and it has been designed to be the best currency in the world! It is deflationary (there are less and less) and allows every holder to have more. With our tools ROTTS Pay and ROTTS.me, everyone will be able to easily use our cryptocurrency to buy goods and services. \r\n"
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0xfb40e79e56cc7d406707b66c4fd175e07eb2ae3c",
    "url": "https://www.rottschild.com",
    "explorers": [
        "https://etherscan.io/token/0xfb40e79e56cc7d406707b66c4fd175e07eb2ae3c",
        "https://ethplorer.io/address/0xfb40e79e56cc7d406707b66c4fd175e07eb2ae3c"
    ],
    "twitter": "TheRottschilds",
    "telegram": "TheRottschilds"
}