{
    "id": "shed-coin",
    "symbol": "shed",
    "name": "Shed Coin",
    "platforms": {
        "ethereum": "0x9bedcd470351cbadfff3bd340085655bb260fdb2"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "The Strategic House of Entrepreneurs and Degens is a first of its kind influencer created cryptocurrency. Over time, it will become a multifaceted organization that will continually add a diverse range of functions and new utilities. SHED will rapidly transform into a digital asset holding and sales company that includes NFTs, minted token sets, digital real estate, and individual cryptocurrencies that have stability and positive growth projection.\r\n\r\nWe will also attempt to become a powerhouse in Blockchain charities. SHED will be highly selective of the charities it donates to, and they will be the ones we can see actively transforming the lives of people around the world. There will also be a department for Blockchain and project education called “Sheducation”.\r\n\r\nThe treasury wallet will be funded through SHED transactions. There will be a 2% tax on all buys and sells that is then distributed as Ethereum into the treasury wallet. The treasury wallet will be divided into two sections that are split 50/50. One half of the treasury wallet will be used for legal fees, digital-asset purchases, buybacks, etc. The other half will be used to fund charities that are combating the most severe problems imaginable. The publicity attributed to helping those in severe need creates volume that in turn, helps the treasury wallet grow, and then helps the charity again. The system is cyclical in nature."
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x9bedcd470351cbadfff3bd340085655bb260fdb2",
    "url": "https://www.dontbuyshed.com/#hero",
    "explorers": [
        "https://etherscan.io/token/0x9bedcd470351cbadfff3bd340085655bb260fdb2",
        "https://ethplorer.io/address/0x9bedcd470351cbadfff3bd340085655bb260fdb2"
    ],
    "twitter": "HouseDegens",
    "github_org": "moontography"
}