{
    "id": "simple-software-solutions",
    "symbol": "sss",
    "name": "Simple Software Solutions",
    "platforms": {},
    "hashing_algorithm": "Quark",
    "categories": [
        "Cryptocurrency",
        "Storage"
    ],
    "description": {
        "en": "Simple Software Solutions (SSS) is a crypto currency project in the Storage Space. The project was founded in late 2019 and launched in early 2020, along with a product called Simple Cloud which leverages SSS Nodes to act as a ‘Private Storage Cloud’\r\n\r\nSSS aims to develop a decentralized storage cloud which aims to bridge the gap for the average storage user, making End-User Experience a key factor. Being one of the few projects who operate multiple blockchains.\r\n\r\nWhat is sDrive?\r\n\r\nsDrive is a decentralized storage network built on Hyperledger Fabric Blockchain allowing SSS Nodes to leverage and participate in the incentivized storage network setting up a SSS Storage Node. It aims to revolutionize cloud storage technology.\r\n\r\nsDrive Introduction Demo:\r\n\r\nhttps://bit.ly/2Y4s2yI\r\n\r\nPhase 0 \"Nimbus\" Testnet:\r\n\r\nPhase 0 of “Nimbus” Testnet for sDrive has been launched and currently ongoing with a incentivized community participation.\r\n\r\nSSS the Coin:\r\n\r\nSSS the coin is a proprietary Blockchain forked from Pivx. It will be used as a utility coin for the SSS Ecosystem along with Governance (DAO). SSS will also be used as a means of payment for Storage. There will only ever will be 14,000,000 coins in total supply with feature of staking, cold staking and masternodes (2500 Coins Locked)\r\n\r\nsBridge Interoperability to Ethereum and DeFi:\r\n\r\nWe have recently announced that we shall be building a cross chain bridge to the Ethereum ecosystem which brings interoperability between blockchains. SSS will become a wrapped (Tokenized) asset on the Ethereum Network. WSSS would provide entry to the Ethereum and Defi ecosystem along with the ability to provide liquidity on Decentralized Exchanges. The cross chain bridge will allow holders of SSS/WSSS to lock there coins/tokens into the protocol and swap assets. "
    },
    "country_origin": "GB",
    "genesis_date": null,
    "url": "https://sssolutions.io/",
    "explorers": [
        "https://sss.explorerhub.io/"
    ],
    "twitter": "__SSSolutions",
    "telegram": "sssannouncement",
    "github_org": "Simple-Software-Solutions"
}