{
    "id": "skyhub",
    "symbol": "shb",
    "name": "SkyHub",
    "platforms": {},
    "hashing_algorithm": "Xevan",
    "categories": [
        "Tourism"
    ],
    "description": {
        "en": "\"This very day, the blossomed online booking ecosystem has shaken up the traditional professional itinerary. The need of Online Booking Platform, running on Blockchain technology is supreme.\r\n\r\nSkyHub is the world’s best blockchain-powered marketplace of services for online booking industry. SkyHub project’s unique business model will bridge the gap between online travel agency and a traditional travel agency by creating a trusted platform with a bustling ecosystem of active and satisfied users and by providing a convenient online booking capability, as well as a 24/7 support in multiple countries and in multiple languages. SkyHub platform will act as an intermediary and escrow agent by leveraging company owned and operated contact centers located worldwide, we are able to deliver one of the highest levels of customer service and support in the online booking industry. Travelers around the world can find and book their perfect trip on our website, mobile and tablet apps. SkyHub’s secure payment system takes the stress out of traveler by providing easy, instantaneous, secure, payment option.\r\n\r\nTo become Leading player in the market SkyHub is focused on offering online booking services through different platform such as mobile websites and applications to attract young and professional crowd. We seek to make the process of travel planning and bookings simple and easy for customers. The online booking market is majorly driven by factors such as quick and convenient flight and hotel bookings, safer online payment methods, availability of multiple choices and comparison options.\""
    },
    "country_origin": "GE",
    "genesis_date": null,
    "url": "https://skyhubcoin.com/",
    "explorers": [
        "http://explorer.skyhubcoin.com/"
    ],
    "twitter": "Skyhubcoin",
    "facebook": "skyhubnetworks",
    "telegram": "skyhubcoin",
    "github_org": "SkyHuBs"
}