{
    "id": "slam-token",
    "symbol": "slam",
    "name": "Slam Token",
    "platforms": {
        "binance-smart-chain": "0xcce7f9eb881248e04f2975a3fb3b62631ad9ee37"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "A revolutionary ecosystem powered by a DeFi Casino, Advanced Charts App, Swap Platform. Slam Token has delivered 4 working products in just one month. \r\n\r\n\r\n\r\nSlam Charts: The Only Charts App for BSC\r\n\r\nWith Slam Charts, you are able to see each token’s market cap data & Lp amount; both for v1 and for v2. Keep track of your favorite tokens and enjoy the simplicity. You can easily search & track BSC tokens, keep track of 4 wallets simultaneously, calculate tokens worth in USD & crypto currencies. Last but not least, you can add any token or whale wallet to your watchlist to receive push notifications for big buys/sells with the new “Whale Radar” feature!\r\n\r\nSlam Swap:  Most User Friendly Swap Platform of BSC\r\n\r\nSlam Swap will automatically detect the version you should use for a specific token to get the best price. In addition to that, Slam Swap adjusts the correct slippage for you! (There are currently +30 tokens that have this feature but more will be added in the future). SlamSwap has the potential to be the next big DEX.\r\n\r\nSlam Vegas: Future of Crypto Gambling\r\n\r\nA sophisticated crypto casino with live dealers and over 100 games. Slam Vegas will have blackjack, roulette and baccarat with live dealers, slot games and live games (such as Crazy Time etc.) in our lobby.\r\n\r\nSlam Crash\r\n\r\nOur OG crash game is now moved to a new domain and it’s separated from Slam Vegas completely. You will now be able to deposit and withdraw BNB or $SLAM to play the crash game. (New tokens will be added on a regular basis) In the new version of the game, there will be features only available for SLAM holders.\r\n\r\nSlam Token aims to stand apart from the crowd by building new utilities that benefits the BSC community."
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0xcce7f9eb881248e04f2975a3fb3b62631ad9ee37",
    "url": "https://slamtoken.com/",
    "explorers": [
        "https://bscscan.com/token/0xcCe7F9eB881248E04f2975a3Fb3B62631ad9eE37"
    ],
    "twitter": "slamtoken",
    "telegram": "SlamToken",
    "reddit": "slamtoken/",
    "github_org": "slamtoken"
}