{
    "id": "solrazr",
    "symbol": "solr",
    "name": "SolRazr",
    "platforms": {
        "solana": "7j7H7sgsnNDeCngAPjpaCN4aaaru4HS7NAFYSEUyzJ3k"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "SolRazr is designed to be the de-facto fund-raising and developer platform for projects build on Solana, aiming to support the growth of DeFi, NFTs and web3 applications that can scale.\r\n\r\nKey problems SolRazr is solving\r\nRetail investors today face a growing challenge when it comes to supporting and becoming a part of the early growth phase of the next-gen ideas and projects built on the fastest growing network - Solana. SolRazr solves this problem by providing access to projects through fair and decentralised allocations.\r\nFor the projects & developers, SolRazr provides the ability to raise capital at lightning speeds in a truly decentralised manner, helping them forge strong communities for long-term support\r\nIn addition to helping projects raise capital, SolRazr also provides access to a host of developer tools to help them build fast on Solana and go-to market early.\r\n\r\nKey Features\r\nTradable Allocations: Reimagining token sale whitelists and allocations by leveraging the power of NFTs on Solana.\r\nAccelerator: Under Accelerator program - we incubate projects, help with go-to market strategy and provide tools to build fast on Solana.\r\nDeveloper Tools: Helping project developers build fast and launch faster by automating token infrastructure deployment on Solana.\r\nCross-chain Pools: Built on Solana wormhole, cross-chain pools allow communities from other chains to invest directly into Solana projects."
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "7j7H7sgsnNDeCngAPjpaCN4aaaru4HS7NAFYSEUyzJ3k",
    "url": "https://solrazr.com/",
    "explorers": [
        "https://solscan.io/token/7j7H7sgsnNDeCngAPjpaCN4aaaru4HS7NAFYSEUyzJ3k"
    ],
    "twitter": "Solrazr_App",
    "telegram": "solrazr_community",
    "github_org": "solrazr-app"
}