{
    "id": "spacex-floki",
    "symbol": "xfloki",
    "name": "SpaceX Floki",
    "platforms": {
        "binance-smart-chain": "0x09756234f29bddc18ecb83db8398d0dda90071a1"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Summer is over, things are moving towards fall. Kids go back to school and Elon Musk gets himself a new dog but despite some glimmer and promise of hope, things have remained the same in the space of DeFi. Many of us look around with fomo, anger and confusion. If I had just held, this time it’s different. I am going to hold, this is a great project and then boom, rug, red eyes and sometimes tears. Why can’t other investors see that if you diamond hand and create a healthy chart and community everyone wins? The aforementioned cycles through the mind of investors in BSC daily. Almost obsessively. That’s why we’re here! Are you sick and tired of all the scammers and rugpullers who only care about pocket change money? YOU deserve a better token one that refuses to participate in any scams and is there for those who matter most! You! The investors. With a strong community and Development team committed to make this the next x1000 Moonbound!\r\n\r\nThis token is brought to you by CryptoKing the Dev of DOGEBREAD the OG 24/7 DOXXER. Dogebread hit 1.6m ATH this surely will surpass it massively. 210k volume only on day one and Dextools Trending today NO BRAINER\r\n\r\nCreating this meme token is all about joining the hype of Elons New dog Floki. However we want to do it keeping your funds Safe. A safe token because that is the new Rug.\r\nOne thing that separates XFloki is by putting a 2% max wallet in place we can assure investors that they are safe from whales, to top up the security there is a 0.5% max buy/Sell and a 30 sec cool off. The team has a plan in mind and with a tax this low no doubt we are in for a ride of a lifetime. Your question might be why rewards in Floki! Well it is the hottest token in the space right now."
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x09756234f29bddc18ecb83db8398d0dda90071a1",
    "url": "https://xfloki.io/public_html/",
    "explorers": [
        "https://bscscan.com/token/0x09756234F29BddC18Ecb83dB8398D0DDa90071A1"
    ],
    "twitter": "XFLOKI3",
    "telegram": "xflokiofficial"
}