{
    "id": "sureremit",
    "symbol": "rmt",
    "name": "SureRemit",
    "platforms": {
        "stellar": "RMT-GCVWTTPADC5YB5AYDKJCTUYSCJ7RKPGE4HT75NIZOUM4L7VRTS5EKLFN"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Who is SureRemit?\r\nSureRemit is part of SureGroup, which also includes SureGifts, the largest gifting platform in Africa.\r\n\r\nSureRemit is the global non-cash remittance service provider utilizing the blockchain to facilitate instant cross border transfers. With the SureRemit app, users can support loved ones globally by sending them shopping vouchers, mobile air time top-ups, and pay their (utility) bills.\r\n\r\nWhy SureRemit?\r\nFor recipients...\r\nUsing SureRemit, recipients don't have to travel and wait in long lines to receive an expensive wire transfer. All they need is a mobile phone or email address. Recipients use the SureRemit App to send in-app support requests (SureRequest) to senders and receive support instantly.\r\n\r\nSureRemit is great for senders too...\r\nNot only are the SureRemit services far cheaper compared to other remittance options, but our services also ensure that your loved ones receive exactly the amount you are sending—no excessive (hidden) fees or costs. And last but not least, you know that the value you send is utilized as intended.\r\n\r\n2. Token Info\r\n\r\nRMT TOKEN\r\nThe RemitToken (RMT) can be used to pay for transaction fees on the SureRemit/SureGifts platform. Additionally, RMT holders receive great deals and exclusive discounts.\r\nAll transaction fees received are paid/converted in/to RMT, and the RMT is then burned. The RMT total supply, therefore, continually decreases.\r\n\r\nIn the SureRemit app, you can also send, receive and store your RMT. Many more functions and utility for RMT are added soon."
    },
    "country_origin": "US",
    "genesis_date": null,
    "contract_address": "RMT-GCVWTTPADC5YB5AYDKJCTUYSCJ7RKPGE4HT75NIZOUM4L7VRTS5EKLFN",
    "url": "https://sureremit.co/",
    "explorers": [
        "https://stellar.expert/explorer/public/asset/RMT-GDEGOXPCHXWFYY234D2YZSPEJ24BX42ESJNVHY5H7TWWQSYRN5ZKZE3N"
    ],
    "twitter": "sureremit",
    "facebook": "sureremit",
    "telegram": "sureremit",
    "reddit": "sureremit/"
}