{
    "id": "sya-x-flooz",
    "symbol": "sya",
    "name": "SYA x Flooz",
    "platforms": {
        "binance-smart-chain": "0x83a86adf1a7c56e77d36d585b808052e0a2aad0e"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "What is SYA x Flooz ($SYA)\r\n\r\n$SYA is the underlying currency behind the Flooz ecosystem. The Flooz eco-system consists of Flooz.Trade, a decentralized exchange that enables you to trade any token (Flooz Trade also enables FIAT payments on every BSC token!) and Flooz.Link, our proprietary creator app that enables creators to issue their own social tokens & NFTs.\r\n\r\nThe protocol automatically applies a 10% tax to each transaction that is distributed gasless as follows:\r\n\r\n- 2% Instant Boost (automatically made available to token holders)\r\n- 2% Community Boost (made available to token holders once community goals have been achieved)\r\n- 1% Charity\r\n- 2% Burn\r\n- 2% Liquidity Pool\r\n- 1% Marketing Wallet\r\n\r\nWhat is the total supply of $SYA?\r\n\r\n$SYA Protocol launched on Binance Smart Chain on May 09, 2021. Our current circulating supply can be found using the SYA Radar: https://radar.sya.today/\r\n\r\nWho Are the Founders of SYA Protocol?\r\n\r\nSYA was founded by Lamine Cheloufi and other humans. The team behind $SYA have worked together since 2014 and were the leading designers, product managers, and engineers for start-ups which became multi-billion dollar companies such as N26 Bank and Cookies (a peer-to-peer payment system, that later became part of Klarna).\r\n\r\nLamine, the Founder of $SYA was also involved in Hong Kong's FinTech ecosystem and ended up supporting the team at WeLab (funded by Sequoia from Alibaba) to build and brand their product.\r\n\r\nFollowing extensive success in the banking sector, Lamine has decided to apply his product, brand, and marketing experience to the crypto space, founding SYA, Flooz.Trade and Flooz.Link, the future engine behind the creator economy."
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x83a86adf1a7c56e77d36d585b808052e0a2aad0e",
    "url": "https://www.sya.today/",
    "explorers": [
        "https://bscscan.com/token/0x83A86adf1a7c56e77d36d585B808052e0a2aAD0e"
    ],
    "twitter": "sya_flooz",
    "telegram": "SYA_HQ",
    "reddit": "SYA_Token/"
}