{
    "id": "zealium",
    "symbol": "nzl",
    "name": "Zealium",
    "platforms": {},
    "hashing_algorithm": "Proof of Stake",
    "categories": [
        "Masternodes"
    ],
    "description": {
        "en": "Zealium is a full-privacy, New Zealand-based Proof of Stake decentralised cryptocurrency which uses peer-to-peer technology to operate with no central authority or banks. Managing transactions and the issuing of Zealium is carried out collectively by the network. Zealium is open-source; its design is public, nobody owns or controls Zealium and, the good thing is, everyone can take part! \r\n\r\nAt Zealium, our goal is to vastly improve awareness, knowledge and understanding of cryptocurrencies within New Zealand with a view to the eventual mass adoption of decentralised finance and trade. Our ambitions are hefty - We want to make a decisive difference to the future of doing business in New Zealand. At the moment, for example, there are no products here to purchase via QR Code, plus New Zealand has only 2 BTC ATM machines nationwide. This must change. Our goal is to turn Zealium into a currency for one’s daily payments; a coin that is not only traded for speculative reasons, but a currency that enables people to buy products and services in a secure and quick way. \r\n\r\nWe believe our brand will resonate well not only with the whole of New Zealand - our indigenous Iwi, our European population, our Pacific cousins, indeed all of the plethora of cultures that now call New Zealand home - but also further ashore. Zealium was formed to put the benefits of cryptocurrency investing within the reach of everybody regardless of wealth and tech know-how. Our transaction times are low, our fees are slim, we’re an environmentally aware and responsible cryptocurrency, plus the rewards for stakeholders are many!"
    },
    "country_origin": "NZ",
    "genesis_date": "2018-03-12",
    "url": "https://zealium.co.nz/",
    "explorers": [
        "https://explorer.zealium.co.nz/"
    ],
    "twitter": "ZealiumCoin",
    "facebook": "zealiumcoin",
    "github_org": "zealiumcoin"
}