{
    "id": "quid-ika",
    "symbol": "QUID",
    "name": "Quid Ika",
    "platforms": {
        "ethereum": "0x9d38f670d15c14716be1f109a4f453e966a2b6d4"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Meet Quid Ika, the first ika token. A new community-owned token founded by experienced crypto enthusiasts, developers, and entrepreneurs. Inspired by the mighty squid who has risen up the chain with no competitors in sight. Our community has risen from a dying ecosystem into a flourishing Ikasystem.\r\n\r\nQuid Ika generates revenue with its insanely competitive Quidity.io App and the Ikasystem token launch pad— all of which is strategically used for buybacks and burns.  \r\n\r\nAPP: Liquidity + Quid = Quidity App\r\nOur app (quidity.io) is a one-stop for any crypto enthusiast. It features reflection tracking, portfolio tracking, whale wallet watching, live charts & dex trades, token news, and more.\r\n\r\nQuidity is one of our many sources of revenue. Revenue is strategically withheld for buyback and burns.\r\n\r\nThe Ikasystem (Launchpad):\r\nQuid offers aspiring developers the opportunity to launch their own ika token. For a % of transaction fees, Quid will provide all resources necessary to launch a project. Revenue is used for buybacks and burns.\r\n\r\nDeflationary (Burn):\r\nQuid Ika is en route to generate millions of dollars in revenue. A major chunk of revenue is used for buyback and burns to create an ultra-deflationary token and sustain longterm growth. We have already bought + burned 6% of supply.\r\n\r\nQuidomics:\r\nSimple contract. 2% reflections and 2% marketing reserve controlled by multi-signature wallet. 500M supply.\r\n\r\nLow Gas Fees:\r\nA simple contract means lower gas fees, even when GWEI is high.\r\n\r\nInfluencer Backed:\r\nQuid is run by the Quidverse community. All decisions go through the holder-voting system. Our top holders has a huge influencer base.\r\n\r\nIka – The Next Inu:\r\nWe know importance of community & the power of social media. So while our utility and mission are serious, we created the next big trend: ika meme (squids). Ika tokens are the next Inu. And Quid is the First Ika."
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x9d38f670d15c14716be1f109a4f453e966a2b6d4",
    "url": "https://www.quidika.com",
    "explorers": [
        "https://etherscan.io/token/0x9d38f670d15c14716be1f109a4f453e966a2b6d4",
        "https://ethplorer.io/address/0x9d38f670d15c14716be1f109a4f453e966a2b6d4"
    ],
    "twitter": "quidikatoken",
    "telegram": "quidika",
    "github_org": "quidika"
}