{
    "id": "valkyrio-token",
    "symbol": "valk",
    "name": "Valkyrio Token",
    "platforms": {
        "binance-smart-chain": "0x405cff4ce041d3235e8b1f7aaa4e458998a47363"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Valkyrio is a blockchain-based game inspired by a manga. At Valkyrio, players will immerse themselves in the role of a humanity representative by recruiting fighters, forging the weapons, killing monsters, and challenging Gods. At Valkyrio, we believe that having a unique fighter and/or weapon is one of the ways the game can be appealing and engaging, but also rewarding to the players.\r\n\r\nKey features: \r\n-Enjoy & Earn: The joy comes by enjoying the gameplay of a RPG game you might be familiar with. You will start by training your recruited fighters daily by combating the monsters, leveling & enhancing your fighter's power.\r\nThe game rewards players who join and invest time & funds to enjoy it. Fueled by the dual token system $VALK & $YRIO, its tokenomic stability will be the strong advantage of the game. $VALK will be the “entry” to join our world and $YRIO will be the reward currency for all in-game activities.\r\n-Marketplace: Fighters & the assets (weapons, outfit, valkyries blessing,…can be traded on the marketplace)\r\n-Game events:\r\nGODs challenge: Every week there will be a boss event. All players can participate and win the treasury in the event.\r\nPvP leaderboard: Every week there will be a PvP leaderboard ranking competition. All players who have PvP matches during the time of event will automatically signup & compete for the event’s reward.\r\nGames in-game: The big features of the game will come in the next phase of the project. Players will have the ability of owning land. By becoming a landlord, players will unlock a series of minigames inside their land (planting, fishing, mining,..). All those minigame activities will be rewarded. The land also gives fighter bonus powers for combating and can be traded on the marketplace."
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x405cff4ce041d3235e8b1f7aaa4e458998a47363",
    "url": "https://www.playvalkyr.io/",
    "explorers": [
        "https://bscscan.com/token/0x405cFf4cE041d3235E8b1f7AaA4E458998A47363"
    ],
    "twitter": "PlayValkyrio",
    "telegram": "ValkyrioGlobalChat",
    "github_org": "orgs"
}