{
    "id": "versess-coin",
    "symbol": "vers",
    "name": "VERSESS COIN",
    "platforms": {},
    "hashing_algorithm": "Quark",
    "categories": [],
    "description": {
        "en": "Stop playing solo and join a virtual world with thousands of other players and play one of our many online multiplayer games and earn money as you win!\r\n\r\nOur multiplayer games are aimed to connect you with other players around the world. We offer a wide selection of multiplayer challenges all of which are fun to play and based upon live action. Our platform API helps you finding a partner with whom to play with our API placing you in a virtual world with tons of opponents!\r\n\r\nWe have various popular games like Ludo, Chess, Backgammon, Ice hockey, Soccer, Chinese Checkers, etc. based entirely on virtual environments. Get started by registering, choosing your avatar, honing your skills and competing with others around the world.\r\n\r\nVERSESS Coin is providing you more than just a cryptocurrency.\r\nMay the winner take it all! Place your stakes before every game and when you WIN, all those belong to you. Use the winnings for further game play or simply trade in exchanges with the crypto of your choice.\r\n\r\nWe bring challenges for all you adults with a child in you! Enjoy engaging graphics and lighthearted style of the games of your childhood. Use your keyboard or mouse to control your character, making moves or simply taking action.\r\n\r\nVersess is more than a just a cryptocurrency\r\nVERSESS is the new kid in the blockchain industry in multi player digital games. We develop, publish and distribute highly engaging multi player games to an audience of thousands of active users, across mobile and online platform.\r\n\r\nWe have successfully growing a huge organic global players pool across six continents, so no matter where you are located, you can simply join in and compete with others. VERSESS has a unique understanding of the digital games space and offers a strong portfolio of over 25 high-quality popular games with a catalogue of hundreds of online games."
    },
    "country_origin": "",
    "genesis_date": null,
    "url": "https://versesscoin.com/",
    "explorers": [
        "http://explorer.versesscoin.com/",
        "http://explorer2.versesscoin.com/"
    ],
    "github_org": "VersessCTO"
}