{
    "id": "vidy",
    "symbol": "vidy",
    "name": "VIDY",
    "platforms": {
        "ethereum": "0xc77b230f31b517f1ef362e59c173c2be6540b5e8"
    },
    "hashing_algorithm": null,
    "categories": [
        "Media"
    ],
    "description": {
        "en": "Vidy is the world's first decentralized ad network, powered by the Ethereum blockchain. Vidy's ad platform allows advertisers to embed video ads directly into hyper-relevant website text, improving user experience, ad conversions and publisher payments.\r\n\r\nVidy is one of the few crypto companies in the world that is actually live in production and presently working with the largest and most prestigious companies of the world. Vidy is revenue positive with tier 1 advertisers buying the Vidy ad unit, and has over 3 billion monthly pageviews on major publishers around the globe. Vidy plans to harness this massive userbase to facilitate major adoption of VidyCoin as a means for ad rewards and purchases on every page.\r\n\r\nVidy has invented the world's first single-page invisible embed layer for video that is completely decentralized. With just a hold, users reveal tiny hyper-relevant videos embedded in the text of any page on the web that supplement their reading experience effortlessly. All video ads are placed with an NLP consensus protocol driven by miners. Each time a user unveils a video ad, he earns rewards in the form of VidyCoin that can then be used in the various forms:\r\n\r\n1) Redeem / Purchase goods and services on the Vidy Ecosystem\r\n2) Purchase advertising campaigns\r\n3) Staking VidyCoin to get access to premium advertising and/or publisher features\r\n\r\nWith a team of veteran engineers, industry-leading advisors and world-class brand partners, Vidy is on its way to reinventing digital advertisement, e-commerce, and video entertainment. For the first time, cryptocurrency application will be available to the masses without any switching cost.\r\n\r\nVidy has already integrated its technology and signed commercial agreements with more than 40 publishers globally. This gives Vidy an exposure of more than 3 billion page views a month or more than 150 million unique visitor exposures a month across Singapore, Indonesia, Taiwan, Philippines, China, Australia, Malaysia, Vietnam and America. At the current moment, Vidy is receiving datapoints from these integrations that are in the billions, and has seen click through / view-rates of more than 30% consistently across the various publishing platforms."
    },
    "country_origin": "SG",
    "genesis_date": null,
    "contract_address": "0xc77b230f31b517f1ef362e59c173c2be6540b5e8",
    "url": "https://vidy.com/",
    "explorers": [
        "https://etherscan.io/token/0xc77b230f31b517f1ef362e59c173c2be6540b5e8",
        "https://ethplorer.io/address/0xc77b230f31b517f1ef362e59c173c2be6540b5e8"
    ],
    "twitter": "VidyCoin",
    "facebook": "VidyCoin",
    "telegram": "vidycoin",
    "reddit": "Vidy/",
    "github_org": "VIDY"
}