{
    "id": "ccuniverse",
    "symbol": "uvu",
    "name": "CCUniverse",
    "platforms": {
        "stellar": "UVU-GAMV4COOMALXHQJ673E4ME2JIUNQ75YXYRWS4FCIJYLCRPRLSZFSPQFJ"
    },
    "hashing_algorithm": "SHA-256",
    "categories": [
        "Infrastructure"
    ],
    "description": {
        "en": "CCUniverse is a project founded by a Polish young team in which they have  combined blockchain technology with infrastructure programs.\r\n\r\nIn the first year of operation, the project will focus on the ATM crypto program.\r\nCCuniverse wants to set up its devices in Europe by providing its currency as well as BTC, ETH communities to facilitate buying and exchanging their assets as well.\r\n\r\nIn subsequent years, CCUniverse will set up charging station for electric cars, including the payment service via their own cryptocurrency, and will provide rental services of modern cars as well.\r\n\r\nCCUniverse vision is to have an open character - this means that subsequent programs will appear with the development of the currency.\r\nWe want to invest and create which will affect the development of civilization.\r\nWe believe that private investors and businessmen are able to manage resources more efficiently than governments do.\r\nThat is why many great ideas and concepts are don’t get a chance due to inadequate organization.\r\nOur project wants to implement such ideas in the future from scratch to the end.\r\n\r\nWe are already research and development to boast our successes in technologically and innovation.\r\nFor upcoming projects which are expected to last  in 2020-2025.\r\nWe are particularly examining the construction market, including prototypes of houses using, for example, transport containers or surveying domes, reducing the price and maximizing the surface area.\r\nIn addition, we are interested in scientific work in the field of robotics and projects focusing on solving energy problems related to environmental protection."
    },
    "country_origin": "PL",
    "genesis_date": null,
    "contract_address": "UVU-GAMV4COOMALXHQJ673E4ME2JIUNQ75YXYRWS4FCIJYLCRPRLSZFSPQFJ",
    "url": "https://ccuniverse.org",
    "explorers": [
        "https://stellar.expert/explorer/public/asset/UVU-GAMV4COOMALXHQJ673E4ME2JIUNQ75YXYRWS4FCIJYLCRPRLSZFSPQFJ"
    ],
    "twitter": "ccuniversefound",
    "facebook": "CCUniverseUVU",
    "telegram": "uvuccuniverse",
    "reddit": "CCUniverseUvu/"
}