{
    "id": "chimeras",
    "symbol": "chim",
    "name": "Chimeras",
    "platforms": {
        "binance-smart-chain": "0x3544a07e9f771ef0f6c80c6e79715869ed291086"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "\"The Chimeras project is a Play-to-Earn metaverse that takes the Free-to-Play approach of allowing players to earn on the content they generate in-game and the actions and feats they accomplish. The core concept of Chimeras is a thrilling mobile game with integrated DeFi farming and NFT tokenization that revolves around a fantasy world filled with cuddly creatures – Chimeras.\r\n\r\nChimeras includes a well-developed backstory that engulfs players with its lore. The vast fantasy world of Chimeras is populated with farmers, alchemists, merchants, killers, landowners, and socials. The islands and archipelagos of the metaverse stretch out in the middle of a boundless world ocean, with some islands having owners, while travelers and merchants surf the expanses of the universe in search of adventures and proﬁtable deals. The game also includes combat elements, as warriors are eager to ﬁght worthy rivals in arenas, while scientists compete for the breeding of the most amazing creatures in their laboratories.\r\n \r\nThe players are rewarded with NFT-based items or CHIM tokens that can be used to breed the creatures, trading, building the virtual land plots in the game, as well as in battles. The gamers can buy and sell everything, including trade reagents, resources, and creatures at auctions, while more peace-loving players can live on the rent they generate from the ownership of numerous islands.\r\n\r\nThe team behind Chimeras has immense experience in the industry. This includes professionals in BlockchainDev, GameDev, and Marketing, all focussed on creating a tier-1 entertainment crypto-game. More than 30 specialists implement cutting-edge practices to develop successful gaming solutions and focus on entertainment as the core throughout the entire gameplay.\""
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x3544a07e9f771ef0f6c80c6e79715869ed291086",
    "url": "https://chimeras.io/",
    "explorers": [
        "https://bscscan.com/token/0x3544a07e9f771ef0f6c80c6e79715869ed291086"
    ],
    "twitter": "ChimerasGame",
    "telegram": "ChimerasMetaverse",
    "github_org": "Red-Pill-Dev"
}