{
    "id": "chiva-token",
    "symbol": "chiv",
    "name": "Chiva Token",
    "platforms": {
        "binance-smart-chain": "0x9500e05ea02cc9cf3f904e83248b16e54e3e6e2e"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Chivatoken is the main token of our NFT Game Ecosystem Chivas Farming, that seeks to revolutionize and take the world of blockchain games to the next level. Chivas Farming is a metaverse of interconnected multiplatform games, which is supported by NFT technology, using the Binance Smart Chain Network (BSC). It is a world exploration game that is based on digital creatures (Chivas), where the players are their owners, take care of them, have various confrontations and can exchange them, becoming their true asset.\r\nThe game takes place in a world called CHIVAS FARMING, which was once a harmonious place. Unfortunately, pollution and radiation caused many deaths and illnesses. But over time, a group of Chivas became mutants, became special, and grew up unique. The new generation will inherit elements of nature and special traits that will allow them to adapt and protect themselves from different dangers arising from the various changes that have occurred in their world.\r\nMARKETPLACE: Chivas can be exchanged on our marketplace. In the different corrals, from the free to the most valuable, you will be able to play and earn types of rewards and even acquire various types of real assets.\r\nCUSTOM STYLE: Each player will be able to customize his Chivas NFT with armors and skins.\r\nSCHOLARSHIPS: We are aware of the global crisis that affects all of us. In the Chivas Farming ecosystem, we want to officially promote the creation of a scholarship program that allows training for many who do not have the necessary resources to be part of our platform, as well as a special program for those who want to grant them.\r\n\r\n"
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x9500e05ea02cc9cf3f904e83248b16e54e3e6e2e",
    "url": "https://chivatoken.io/",
    "explorers": [
        "https://bscscan.com/token/0x9500e05ea02cc9cf3f904e83248b16e54e3e6e2e"
    ],
    "twitter": "chivasfarming",
    "telegram": "chivatokencomunidadlatina"
}