{
    "id": "cnns",
    "symbol": "cnns",
    "name": "CNNS",
    "platforms": {
        "ethereum": "0x6c3be406174349cfa4501654313d97e6a31072e1"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Content Neutrality Network (CNN) is an innovative content ecosystem based on Blockchain technology. It solves various issues existing in current content system through blockchain’s advanced features such as consensus mechanism and smart contract, aiming to create a more open, efficient and trustworthy content era\r\n\r\nCNN platform proposes numerous innovative mechanisms based on blockchain technology such as Content Circulation Mechanism (CCM) based on the tamper-proof feature of blockchain, Contribution Based Revenue Share (CBRS) mechanism based on ZhangRank which is proposed by Professor Shoucheng Zhang as well as decentralized user acquisition and incentive plan. These mechanisms help break the barrier between content communities, facilitate the fairness of revenue share and improve the effectiveness of user acquisition and incentive program.\r\n\r\nCNN Platform has built strategic partnership with NewsDog, the NO.1 news app in India to create a new chapter in India and global content market. CNN Advisory board consists of world-renowned professors such as Prof. Jianqing Fan, successful investors such as Yahui Zhou, Kevin Wen as well as blockchain influencers such as Mickey Tian. Team members are top talents from Snapchat, Tencent, Alibaba, Baidu and Goldman Sachs"
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x6c3be406174349cfa4501654313d97e6a31072e1",
    "url": "https://cnns.io/",
    "explorers": [
        "https://etherscan.io/token/0x6c3be406174349cfa4501654313d97e6a31072e1",
        "https://ethplorer.io/address/0x6c3be406174349cfa4501654313d97e6a31072e1",
        "https://explorer.binance.org/asset/CNNS-E16"
    ],
    "twitter": "CNNSIO",
    "facebook": "CoinNessCom",
    "telegram": "coinnessofficial",
    "reddit": "CoinNessOfficial"
}