{
    "id": "coin98",
    "symbol": "c98",
    "name": "Coin98",
    "platforms": {
        "binance-smart-chain": "0xaec945e04baf28b135fa7c640f624f8d90f1c3a6",
        "solana": "C98A4nkJXhpVZNAZdHUA95RpTF3T4whtQubL3YobiUX9",
        "ethereum": "0xae12c5930881c53715b369cec7606b70d8eb229f"
    },
    "hashing_algorithm": null,
    "categories": [
        "Celo Ecosystem",
        "Wallets",
        "Decentralized Finance (DeFi)",
        "Solana Ecosystem",
        "xDAI Ecosystem",
        "Binance Smart Chain Ecosystem"
    ],
    "description": {
        "en": "Coin98 is an all-in-one DeFi Platform that aims to fulfill untapped demand in the industry and become a Gateway bridging TradFi users to any DeFi services on multiple blockchains. It accomplishes this mission through a full suite of products, including Coin98 Wallet, Coin98 Exchange, and Space Gate (cross-chain bridge).\r\n\r\nCoin98 Wallet: Allows users to store, send, receive, manage crypto assets and connect to numerous dApps on multiple blockchains. It supports over 20 blockchains such as Ethereum, Binance Smart Chain, Solana, Polygon, Avalanche, Terra, etc on both mobile (iOS & android) and Chrome extension versions.\r\n\r\nCoin98 Exchange: A multichain liquidity aggregator that allows users to swap, stake, lend, borrow, earn crypto with the best rates and low slippage.\r\n\r\nSpace Gate: A cross-chain bridge that enables swapping and transferring values across multiple networks. It supports token swaps between ERC20 tokens, BEP20 tokens, SPL tokens, and more.\r\n\r\nThe C98 token is the native utility token of the Coin98 platform and will be used to pay services fees, as staking incentives, for governance, and unique membership rights."
    },
    "country_origin": "VN",
    "genesis_date": null,
    "contract_address": "0xaec945e04baf28b135fa7c640f624f8d90f1c3a6",
    "url": "https://www.coin98.com",
    "explorers": [
        "https://bscscan.com/token/0xaec945e04baf28b135fa7c640f624f8d90f1c3a6",
        "https://etherscan.io/token/0xae12c5930881c53715b369cec7606b70d8eb229f",
        "https://explorer.solana.com/address/C98A4nkJXhpVZNAZdHUA95RpTF3T4whtQubL3YobiUX9"
    ],
    "twitter": "coin98_wallet",
    "telegram": "coin98_wallet",
    "github_org": "coin98"
}