{
    "id": "corionx",
    "symbol": "corx",
    "name": "CorionX",
    "platforms": {
        "ethereum": "0x26a604dffe3ddab3bee816097f81d3c4a2a4cf97",
        "binance-smart-chain": "0x141383cdb8158982fb3469c3e49cc82f8026d968"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "CorionX is a modern blockchain platform that acts as a hub for digital assets, and is built to promote the adoption of cryptocurrency stablecoins, Decentralized Finance (DeFi), CBDCs, and other technologies that empower users and reduce reliance on legacy infrastructure. The CorionX (CORX) token is “gas” for the rapidly developing stablecoin and crypto infrastructure and is designed to help incentivize stablecoin and DeFi. adoption\r\n\r\n♦️ CorionX is using partners bridges to  provide interoperability, fast, secure & cheap transactions and scalability\r\n\r\n♦️ CorionX will provide the next generation of mobile payments:  This will power cheap, fast, and highly scalable transactions within the community using CorionX, Stablecoins and other ERC 20 tokens.\r\n\r\n♦️ CorionX creates the one platform for education, rewards the collaboration of the community and leads the #MoneyInTheRightDirection Movement.\r\n\r\n♦️  Staking without lockup: Holders of the CorionX utility token earn 2.5% quarterly, (10.38% APY) staking rewards without needing to lock up their assets. This is paid on the average CorionX balance held in the user’s ETH wallet, leaving them free to transact and benefit from the token’s utility without missing out on rewards.\r\n\r\n♦️ Earning Yields in CeFi and DeFi: CorionX is looking to integrate Centralized Finance and Decentralized Finance solutions to provide easy to use access to mainstream users to earn yields and to extend CorionX utilites.\r\n\r\n♦️ CorionX token has a wide range of use cases. It can be used for bounties and reward plans, membership fees, earning rewards, and a whole lot more.\r\n\r\n♦️ CorionX token holders can earn discounts and benefits for holding and participating in the CorionX ecosystem."
    },
    "country_origin": "CH",
    "genesis_date": null,
    "contract_address": "0x26a604dffe3ddab3bee816097f81d3c4a2a4cf97",
    "url": "https://corion.io/corionx/",
    "explorers": [
        "https://etherscan.io/token/0x26a604DFFE3ddaB3BEE816097F81d3C4a2A4CF97",
        "https://ethplorer.io/address/0x26a604dffe3ddab3bee816097f81d3c4a2a4cf97",
        "https://bscscan.com/token/0x141383CDB8158982fB3469C3e49cC82F8026d968"
    ],
    "twitter": "CorionPlatform",
    "facebook": "CorionFoundation",
    "telegram": "corionx",
    "reddit": "Corionx/",
    "github_org": "CORIONplatform"
}