{
    "id": "cribnb",
    "symbol": "crb",
    "name": "Cribnb",
    "platforms": {
        "ethereum": "0x6767615a97a8204298bbac44c57ef1a615eed244"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Cribnb is a decentralized short-term rental ecosystem that will use blockchain technology to make the rental process less costly and more convenient and secure. The transparent ecosystem with verified information on hosts and guests will foster trust between the parties. Cribnb’s decentralized platform will reduce traditional frustrations, scam rates, time delays, and friction points in the rental process to benefit both hosts and guests. Thanks to smart contracts, it is now possible to build a truly decentralized and automated sharing economy platform. This will be done with no middlemen and thus 0% commission, meanwhile sharing the wealth with the users in a two-sided marketplace. Given the growing acceptance of the sharing economy and increased usage of digital currencies, Cribnb’s launch comes at a growth inflection point for our target market. \r\nCribnb will build a smart platform that serves a growing market segment. The platform will develop tools that will make the market grow in a more transparent, user-friendly manner. Cribnb will attempt to resolve the technological gaps in the current short-term rental platforms. The Cribnb platform will aim to significantly improve the user experience within the peer-to-peer rental market by aligning incentives."
    },
    "country_origin": "US",
    "genesis_date": null,
    "contract_address": "0x6767615a97a8204298bbac44c57ef1a615eed244",
    "url": "https://cribnb.org/",
    "explorers": [
        "https://etherscan.io/token/0x6767615a97a8204298bbac44c57ef1a615eed244",
        "https://ethplorer.io/address/0x6767615a97a8204298bbac44c57ef1a615eed244"
    ],
    "twitter": "cribnb",
    "facebook": "cribnbsharing",
    "telegram": "cribnb_discussion",
    "github_org": "cribnb"
}