{
    "id": "croat",
    "symbol": "croat",
    "name": "CROAT",
    "platforms": {},
    "hashing_algorithm": "Cryptonight",
    "categories": [
        "Cryptocurrency"
    ],
    "description": {
        "en": "Croat is a virtual coin or criptocurrency based on Cryptonote algorithm. Although technically not a great innovation in terms of major changes in the algorithm, this was not our main purpose. Our objective is to create a Catalan product, a tool destined to be used by the people, governed by the people, and that brings benefits directly to the people.\r\n\r\nThere have been other intents to launch a Catalan cryptocurrency. Some failed due to technical faults, others were not really a decentralized cryptocurrency, but more a centralized “token” system related to some local authority. We've studied them all. We learned from the mistakes some made and from the approach others had, to make Croat the best option for ordinary people, unrelated to any institution or organization.\r\n\r\nAlthough we strongly believe in Catalonia's future, we are not politically subscribed to any party or group. In our group of developers there are people with different political views, but as a group we only believe in the future of Croat as THE CATALAN ALTCOIN. People deserve the right to have access to Croat, no matter what their political views are. In the end, it's only money. And we strongly believe that PEOPLE should have the right to govern and control it, not institutions, not political parties, not central banks. \r\n\r\nThe Croat project started out of a need to offer a virtual coin to the Catalan people. Catalonia has a lot of economic potential and Croat will be a powerful tool to accelerate the economic development of our region We cannot stress enough the importance of THE PEOPLE. Croat was not created by any institution, government or official organization, but by a group of ordinary people, passionate developers, with Catalonia at heart. We want to empower our PEOPLE, give them a tool that works for them and, more importantly, one that represents them.\r\nWHY CROAT?\r\n\r\nCroat was one of the most used and longest lived of the Catalan coins. Croat is an important part of the historical Identity of the Catalan people. Croat as an altcoin brings the Catalan coin from the past into the future. A tool within everyone’s reach, justified not only by economical needs, but also by historical, cultural and personal ones.\r\n"
    },
    "country_origin": "ES",
    "genesis_date": "2017-08-15",
    "url": "https://croat.community/",
    "explorers": [
        "http://explorer.croat.community/"
    ],
    "twitter": "CROATcommunity",
    "facebook": "CROATcommunity",
    "telegram": "croatcoin",
    "reddit": "croatcoin/",
    "github_org": "CroatApps"
}