{
    "id": "crowny-token",
    "symbol": "crwny",
    "name": "Crowny Token",
    "platforms": {
        "ethereum": "0xdbddf072d7aae7b9288e31a4eebe6c54e3a143b1"
    },
    "hashing_algorithm": null,
    "categories": [
        "Solana Ecosystem"
    ],
    "description": {
        "en": "Crowny has created a new platform to help solve some of the current dilemmas within the world of advertising. Crowny is a platform that will allow brands to create effective campaigns and reach their target audiences with ease and simplicity. These users are enticed to listen to their message by being rewarded through the app. Users will be able to connect to their favourite brands through the Crowny Mobile App, without the risk of privacy breaches.\r\n\r\nWhat Crowny offers:\r\n- A smartphone app which enables users to specify their areas of interest and allows them to follow their favourite brands. This gives them control over the type of content and deals they wish to see, and when they want to see it.\r\n- A secure and private experience via the anonymization of user data.\r\n- The possibility to reach out to consumers in several ways, including push notifications, geofencing and QR codes. The supplied content also includes interactions and gamification elements. Consumers will be more engaged than ever, which in turn will improve the consumer-brand relationship.\r\n- Users will always be rewarded. Not only through the offers they receive, but also for consuming content; paid with $CRWNY tokens and brand loyalty points\r\nThe biggest challenges of the advertising world includes reduced exposure, increasing costs, and elusive audiences. They are solving these challenges with their platform.\r\n\r\nCrowny also offers a free loyalty system to small business owners. The most interesting part of this loyalty system is the $CRWNY token. These rewards play a key role in the Crowny platform. Tokens can eventually be converted to (fiat) currencies, used to purchase products, or set aside as can be held in a wallet."
    },
    "country_origin": "NL",
    "genesis_date": null,
    "contract_address": "0xdbddf072d7aae7b9288e31a4eebe6c54e3a143b1",
    "url": "https://crowny.io/",
    "explorers": [
        "https://etherscan.io/token/0xdbddf072d7aae7b9288e31a4eebe6c54e3a143b1",
        "https://ethplorer.io/address/0xdbddf072d7aae7b9288e31a4eebe6c54e3a143b1"
    ],
    "twitter": "crownyio",
    "telegram": "crownyio"
}