{
    "id": "cryptobulls-token",
    "symbol": "cbt",
    "name": "Cryptobulls Token",
    "platforms": {
        "binance-smart-chain": "0x9f42f1143784e2d34c618a3bfbda2099c1662e36"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "CryptoBulls Token is a community envisioned and driven project, backed by an LLC full of successful business men and women, supported by over 200 more crypto enthusiasts/investors. We are not a traditional marketing group. We provide the full package, start to finish, for defi projects. We build contracts, we counsel, we train, we offer our clientele a full spectrum approach to not only DeFi, but also business management within that space.\r\nWe will be onboarding real-world businesses into a one-of-a-kind cryptocurrency-enabled merchant payment system. Our business integration plans include sectors such as hospitality, restaurant, and retail. Our token itself will be accompanied by solid usecases from the get go. It will not only have utility, but will also be supported by all of the CryptoBull’s business ventures in the form of reinvesting profits directly into marketing, business development, and actually staking liquidity within the CryptoBulls token itself, thereby increasing buys on the chart organically (a one of a kind, non-artificial buyback mechanism!). \r\nInitially, our plan is to launch with the typical new investor/ICO deflationary tokenomics that people have come to know and love. There will be an 11% tax on all transactions, the tax being split into 7% liquidity and a 4%reflection to token holders for first month. This will ensure the initial growth we need to solidify our marketing/business plans as we move forward, as we grow together with our investors, without worrying about the initial fragility of most typical new ICO charts."
    },
    "country_origin": "US",
    "genesis_date": null,
    "contract_address": "0x9f42f1143784e2d34c618a3bfbda2099c1662e36",
    "url": "https://cryptobullstoken.io/",
    "explorers": [
        "https://bscscan.com/token/0x9f42f1143784e2d34c618a3bfbda2099c1662e36"
    ],
    "twitter": "RealCryptoBulls"
}