{
    "id": "ctc",
    "symbol": "c2c",
    "name": "C2C System",
    "platforms": {
        "ardor": ""
    },
    "hashing_algorithm": "Proof of Stake",
    "categories": [
        "Number"
    ],
    "description": {
        "en": "The C2C system makes it convenient to convert any paper currency and coins into many different cryptocurrencies, including the C2C currency itself.\r\n\r\nWith our strategically located ATMs, travelers no longer need to worry about leftover paper bills and coins from the remaining purchases after a business trip. In some locations, travelers who do not want to be exposed to market volatility can choose the AEUR coin, a coin that is pegged 1:1 with the Euro by ArdorGate in cooperation with MisterTango.\r\n\r\nC2C Technology\r\nThe technology of C2C consists of the use of our ATMs that accept both bills and coins, as well as portable C2C devices for merchants known as the C2C Pocket.\r\n\r\nWith our technology, you can better make online purchases by converting your cash to crypto-currencies, as well as use our printed cryptocurrency bills for use in retail chains worldwide.\r\n\r\n1. C2C Pocket\r\nThe C2C Pocket is an innovative payment solution device which prints out C2C notes which hold a set amount of a cryptocurrency, either as change to the customer or sold directly to them, as well as claims the coins on those bills with a built-in scanner or receives coins through the C2C Merchant App.\r\n\r\nFeatures and Specifications\r\nThe C2C Pocket is an ideal way for merchants and users to have a way to easily interact with the complete C2C ecosystem on-the-go.\r\n\r\nThis device is also complete for other forms of payment such as a credit card reader, an on-board camera with LED light, on top of having a mobile printer for receipts and both, WiFi, and 4G functionality in addition to cryptocurrency management functions.\r\n\r\nThe C2C mobile app also prints out C2C notes so it is an ideal solution for shops giving or selling cryptocurrencies such as C2C tokens to customers or giving them as coupons.\r\n\r\nThe C2C Pocket beta version will be expected to be released to selected merchants for testing for the remainder of Q2 2018.\r\n\r\n2. C2C ATM\r\nThe C2C ATM is a machine which accepts coins and notes from many countries and prints out C2C notes. These notes can contain most cryptocurrencies supported by C2C, including the C2C token itself.\r\n\r\nLocations of the C2C ATMs will be strategically located in selected shopping centers and ports of entry and exit such as airports and train stations where many people from around the world gather. These locations are also where travelers tend to need to dispose of their spare change as they may not be needing it in their home country or in the country they are about to travel to.\r\n\r\nThe ATM will be a 2-way machine, so users can also withdraw local currencies in exchange for cryptocurrencies as well as convert their CtC notes to local currencies, much like redeeming paper wallets.\r\n\r\nDevelopment is currently ongoing. The beta version is expected to be released in June 2018 for testing in several locations.\r\n\r\nC2C has chosen the <a href=\"https://www.coingecko.com/en/coins/ardor\">Ardor Platform</a>, the first scalable blockchain as a service platform for businesses, for its public blockchain use including the C2C token, as it features these four key characteristics:\r\n\r\nADVANCED ARCHITECTURE – The unique parent child chain architecture of the <a href=\"https://www.coingecko.com/en/coins/ardor\">Ardor Platform</a> allows the C2C token and other future utilizations to have cross-chain interoperability. This means that as <a href=\"https://www.coingecko.com/en/coins/ardor\">Ardor</a> grows and more child chains gets added, other tokens, whether assets, currencies, or child chain coins, will quickly and easily be able to be integrated into the C2C framework.\r\n\r\nEASE OF SETUP – Though our services allow users to easily acquire cryptocurrencies, we want to allow C2C token holders to easily and quickly set up a full wallet with the blockchain fully downloaded. With the Pruning feature on <a href=\"https://www.coingecko.com/en/coins/ardor\">Ardor</a>, this means that blockchain bloat is heavily reduced and getting a full wallet, which is better for decentralization and independence, is much more convenient for our users compared with using any other platform.\r\n\r\nENERGY EFFICIENT – The <a href=\"https://www.coingecko.com/en/coins/ardor\">Ardor Platform</a> uses the Proof-of-Stake consensus algorithm which eliminates mining competition based on computing resources, therefore the use of the C2C token leaves a lower carbon footprint as less energy is needed to be spent and more economical hardware can be used, such as a Raspberry Pi.\r\n\r\nRELIABLE & MAINTAINABLE – <a href=\"https://www.coingecko.com/en/coins/ardor\">Ardor</a> uses the technology of Nxt, which has been running smoothly since 2013 and thus has years of production experience, which further ensures the stability of our frameworks. It is also developed in Java, the most popular development language for commercial applications, which makes it easier for C2C to build further using the technology.\r\n\r\nThe C2C Token\r\nThe C2C token was distributed to the numerous business partners and selected interested parties such as potential merchants, who came together to start the project and contributed resources for its initial startup phase. The token does not indicate any form of profit sharing in the present or future.\r\n\r\nThe token itself can be used as a currency within the platform for the purchase of premium services to be introduced in the future, as well as outside the system, especially with the use of C2C notes. Any further features of the C2C framework will always use the C2C token.\r\n\r\nAdditionally, it is planned that in the future there will be a public sale of tokens that represent some profit sharing rights and only the C2C token will be accepted for this. However, there will not be a set ratio for this as the C2C token is only used as a form of currency for this purpose. Further details about this token sale for profit participation tokens are yet to be determined. However, it has been decided that the <a href=\"https://www.coingecko.com/en/coins/ardor\">Ardor Platform</a> will be used due to the Asset Control feature which makes it easy to comply with regulations around tokens that may be classified as a security."
    },
    "country_origin": "LU",
    "genesis_date": "2018-07-12",
    "url": "http://c2c.global",
    "explorers": [
        "https://ardor.tools/asset/10904853980055209979"
    ],
    "twitter": "c2catm",
    "facebook": "C2Cofficial",
    "reddit": "C2CSystem/"
}