{
    "id": "ecodollar",
    "symbol": "ecos",
    "name": "EcoDollar",
    "platforms": {},
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "EcoDollar is a state of the art technology cryptocurrency that allows for anonymous storage and global transfer of “digital money” quickly, securely and encrypted.\r\n\r\nOur commercial partners have made a great investment in providing a secure and stable environment for the complete operation of the blockchain and our crypto currency platform. The technology platform is distributed around the world, in multiple servers and locations that include:\r\nCreating a better planet\r\nWe believe that it is our obligation to provide a more stable planet for our future generation and, therefore, we invest 90% of the EcoDollar currency in the acquisition and maintenance of properties with biological biodiversity worldwide, as well as an additional 2% for donations to international ecological organizations that are willing to carry out activities over the next 30 years to improve our planet Earth.\r\nReal value of the currency\r\nEvery EcoDollar is supported by the underlying value of the biodiverse properties that are being acquired as part of our “Greener Planet Reserve”.\r\nEcoDollar as a mean of payment and exchange\r\nEcoDollar gives you the freedom to move your money anywhere, to anyone, instantly. Service providers and merchants all over the world are rapidly adopting the cryptocurrencies as a normal payment method for their business operations.\r\nEcoDollar as a company and its operation\r\nThe Blockchain is a public information storage system; EcoDollar as a company is operated by the owners of Master Nodes, and its operation is authorized or disallowed to each and every one of the locations worldwide that are operating under the permits and regulations of each nation, generated by the due cancellation of the currencies for the purchase of Master Nodes or the means of the purchase / sale of properties valued and duly documented for the \"Greener Planet Reserve\" and the opening of a headquarters, releasing more coins after the payment of the properties for forest reserve. The remaining release percentage to said commercial headquarters on the backed coins will be correspondingly rotated to each headquarters for its correct functionality and custody of green assets.\r\nFrom the offices that represent the company and its operation, that are not up to date with its regulations and permits in the respective nations, or that do not have financial strength, the authorization for the representation of EcoDollar will be canceled and the dissolution will proceed. Corresponding and the new opening of another headquarters or representation for the service of the users of this means of payment, guaranteeing in this way of public administration the continuity and stability of the Blockchain, its operation and endorsements."
    },
    "country_origin": "",
    "genesis_date": null,
    "url": "https://ecodollar.org/",
    "explorers": [
        "https://explorer01.ecodollar.org"
    ],
    "twitter": "eco_dollar",
    "facebook": "EcoDollar.org",
    "github_org": "EcoDollar"
}