{
    "id": "electroneum",
    "symbol": "etn",
    "name": "Electroneum",
    "platforms": {},
    "hashing_algorithm": "Cryptonight",
    "categories": [
        "Finance / Banking"
    ],
    "description": {
        "en": "Electroneum has coined the phrase 'enablement currency' as it is going to enable a new 3 trillion dollar market (Price Waterhouse Coopers predicts this market to be as large as USD 3 trillion in their 2017 Global Fintech Report) by allowing over 350m smartphone users in the developing world to enter the digital market for the first time. With immediate benefits to the mobile operators in those regions, including meaningful transactional cost savings, there are operators who could take us to well over 100 million users and many more operators in negotiation. Our unique mobile miner puts a small amount of ETN into the hands of users every day, providing market liquidity and driving viral growth. With 2,341,445 million registered users, we have a faster viral growth than both Facebook and Twitter over the same time period.\r\n\r\nThe Electroneum manage to raise 40 million dollars through <a href=\"https://www.coingecko.com/en/ico/electroneum\">ICO</a>. Their Github release was November 1st. However, before the launch of the mobile app, they were hit by a distributed denial of service (DDoS) attack. The team had to shut down their servers and work over 26 hours straight to deal with the attack. Eventually, after some delay, ICO investors were distributed their coins and Electroneum continued working towards their goal of spreading ETN to the masses. Over 690 million ETN were transferring during the first 24 hours, requiring only 430 ETN in fees. Electroneum calls itself the first British based cryptocurrency. The team of 12, based in Kent, is led by Richard Ells, the co-founder of SiteWizard and Retortal.com. James Atkinson is the head of the Electroneum Development Team with over 10 years of experience in development. He’s leading the charge on the Electroneum App. Great respect is given to Dean Cole, the “member of the team with the least sleep… consuming giant quantities of caffeine.” He maintains and develops the servers required for mining and transacting in Electroneum.\r\n\r\nThere are several gambling websites already accepting <a href=\"https://www.coingecko.com/en/coins/bitcoin\">Bitcoin</a>, but the problem is that it’s hard for most people to obtain it. The majority of online gambling takes place outside of America, where it’s especially hard to acquire Bitcoin. Most countries do not have access to <a href=\"https://www.coingecko.com/en/exchanges/coinbase_pro\">Coinbase</a> or <a href=\"https://www.coingecko.com/en/exchanges/gemini\">Gemini</a> and their local exchanges often have 7% fees or higher. Electroneum once again hopes to reduce friction and encouraging gambling sites to accept the currency. As mentioned previously, due to the ASIC resistant nature of the Electroneum mining algorithm, it’s still feasible to mine coins with just your CPU. You can complete a quick download and join a mining pool right away here. The average block reward is about 7000 ETN.\r\n\r\nElectroneum has also increased its palatability to the average consumer by capping the total number of coins at 21 billion, moving the decimal point two places to the right when compared to Bitcoin, which is capped at 21 million. Whereas a pizza in Bitcoin might cost 0.005 BTC, with Electroneum it would be a much more ‘real money’ figure. <a href=\"https://www.linkedin.com/in/richard-ells-8b0615b/\">Richard Ells</a>, founder of Electroneum and experienced tech entrepreneur, said: “I don’t know if you’ve ever tried buying any Bitcoin, but it’s really hard to do! I realized that what the world needs is a cryptocurrency that is genuinely easy to access and use. We’ve developed Electroneum with the ordinary mobile user in mind.”"
    },
    "country_origin": "GB",
    "genesis_date": "2017-10-30",
    "url": "http://electroneum.com/",
    "explorers": [
        "https://blockexplorer.electroneum.com/"
    ],
    "twitter": "electroneum",
    "facebook": "electroneum",
    "reddit": "Electroneum",
    "github_org": "electroneum"
}