{
    "id": "peculium",
    "symbol": "pcl",
    "name": "Peculium",
    "platforms": {
        "ethereum": "0x0f02e27745e3b6e9e1310d19469e2b5d7b5ec99a"
    },
    "hashing_algorithm": "Ethash",
    "categories": [
        "Artificial Intelligence"
    ],
    "description": {
        "en": "Since 2017, PECULIUM has strived to bring advanced investment and wealth management services to the world of Digital Assets. In 4 years, we have been taking steps into the unbeaten paths to realize our mission: give customers the best chance of investment success and bring many people's imaginations of blockchain to life.\r\n\r\nPCL is an ERC-20 multi-utility token granting access to PECULIUM services and rewards to users and stakeholders. It is more than just a tradable asset, it is an investment in our community’s future.\r\n\r\nPECULIUM is a team of Early adopters of blockchain, data science experts, and tech fans. We work together to balance experience and intelligence, opportunity and innovation to achieve something significant, be positive disruptors, and change how people can harness data to invest and save.\r\n\r\nPECULIUM has developed the SAIΞVE app, a wealth management platform for Digital Assets. SAIΞVE App combines Artificial intelligence and Smart contracts, implementing elements from traditional savings and investments with all-data-driven decision investments making. The technology underlying our SAIΞVE App is based on decades of knowledge and experience gained from academia and tier 1 investment banking software development. Our analytics engine has been extensively tested in different sectors and economic cycles and has shown consistent performance and superior insights.\r\n\r\nOur High-Yield Savings Account BELIΞVE, the first earning program, relies on a long-only based investment strategy that creates return in the upward momentum at spots markets. Composed of various models, while it lowers volatility for more stable investment, it generates robust high returns."
    },
    "country_origin": "FR",
    "genesis_date": null,
    "contract_address": "0x0f02e27745e3b6e9e1310d19469e2b5d7b5ec99a",
    "url": "https://peculium.io/",
    "explorers": [
        "https://etherscan.io/token/0x0f02e27745e3b6e9e1310d19469e2b5d7b5ec99a",
        "https://ethplorer.io/address/0x0f02e27745e3b6e9e1310d19469e2b5d7b5ec99a"
    ],
    "twitter": "_Peculium",
    "facebook": "PeculiumICO",
    "telegram": "ico_peculium",
    "reddit": "Peculium/",
    "github_org": "PeculiumPCL"
}