{
    "id": "philscurrency",
    "symbol": "wage",
    "name": "Digiwage",
    "platforms": {},
    "hashing_algorithm": "Quark",
    "categories": [
        "Masternodes"
    ],
    "description": {
        "en": "Philscurrency has been rebranded to Digiwage and total supply out from Philscurrency us being swapped to Digiwage in 1:1 ration. Last date of swap is April 9, 2018.\r\n\r\nDigiwage is a decentralized workplace hub for developers, entrepreneurs, block-chain enthusiasts, startups and resources where each of them find solutions corresponding to their current projects or\r\nkick start new projects. Our token ‘Digiwage’ is used in exchange for different services.\r\n\r\nIn our world, the gap between a steadily increasing population and a shortage of natural resources to cater to this inevitable demand is rising. This had led to, and is now at a rapid pace, still creating new jobs with the requirement of skillsets of the 21 st Century, such as global citizenship, collaboration, problem-solving, design thinking, unlearning & relearning, an entrepreneurial bent of mind, and so many other qualities.\r\n\r\nIn order to rise above our current challenges and go beyond, we realised that it is imperative for platforms to exist that can connect people globally and encourage collaboration through exchange of knowledge and skills for currency. Only if people from across the world connected at a level where they are helping each other solve their problems, could they truly come together as one big community, which could eventually be an enabler for bigger things, like world peace. So, we created Digiwage.\r\n\r\nOur vision is grounded in the conviction that this workplace acts as an umbrella for multiple projects across diverse categories. Every project holder has full-pledged authority on the project along with every user on the Digiwage platform and community.\r\n\r\nA connected world, a large global community of people sharing their knowledge, skills and resources for a shared collective growth story and economy, to create a strong link between virtual connections and tangible physical results and outcomes. In the face of challenges, we are convinced that Digiwage will navigate turbulent waters and sail away to the shores of enabling a more liberating, yet connected workplace for and of, the future."
    },
    "country_origin": "",
    "genesis_date": null,
    "url": "https://www.digiwage.org/",
    "explorers": [
        "https://explorer.digiwage.org/"
    ],
    "twitter": "digiwage",
    "facebook": "PhilsCurrency",
    "reddit": "philscurrency/",
    "github_org": "digiwage"
}