{
    "id": "pluracoin",
    "symbol": "plura",
    "name": "PluraCoin",
    "platforms": {},
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "What is PluraCoin?\r\nPluraCoin [PLURA] is a digital cryptocurrency based on CryptoNote technology with a vision to bring cryptocurrencies to people's daily life. The name \"PluraCoin\" is derived from latin word \"plura\", that comes for english term \"many\".\r\n\r\nThat perfectly describes our mission to bring digital cryptocurrencies closer to the common people, not only IT professionals or computer enthusiasts. We'd like to interest as many people as possible and let them earn/mine as many PluraCoins as needed in as many real world applications as possible.\r\n\r\nWith PluraCoin, you can send instant, private, near-zero cost payments to anyone in the world. You can spend safely - nobody can see your balances or activity.\r\n\r\nWhy PluraCoin?\r\nQuick Payment Method\r\nEnables the transfer of value across an accessible network ecosystem that is secure, flexible and scalable.\r\n\r\nHighly Private\r\nComplete anonymity and privacy using cryptographic technology ring signatures.\r\n\r\nUntraceable\r\nTransactions on the PluraCoin blockchain cannot be linked to a particular user or real-world identity.\r\n\r\nDecentralized\r\nPluraCoin follows vision of a secure digital cash operated by a network of users.\r\n\r\nRoadmap\r\nQ1 2018 - The story of PLURA begins\r\nPluraCoin has been launched as stable platform for future development along with a complex set of support tools like GUI / CLI / offline wallets, block explorer, official mining pool and web miner. A public campaign has been started on major channels like Twitter, Facebook, Discord, Reddit and Bitcointalk. PluraCoin has been sucessfully listed on crypto exchanges Stocks.Exchange and TradeOgre.\r\n\r\nQ2 2018 - Core and business development\r\nImprovements to the existing system to strenghten system stability. Windows / OS X miner easy web configurator (Click & mine). White paper. Light wallet. Masternodes\r\n\r\nQ3 2018 - MyPLURA and other exchanges\r\nA Web wallet project MyPLURA. New markets for PLURA.\r\n\r\nQ4 2018 - eCommerce Integration\r\nCart payment plugins for popular open source ecommerce solutions. Partnership on real world products / services with selected partners"
    },
    "country_origin": "",
    "genesis_date": null,
    "url": "https://pluracoin.org/",
    "explorers": [
        "https://explorer.pluracoin.org/"
    ],
    "twitter": "PluraCoin",
    "facebook": "PluraCoin",
    "telegram": "pluracoinofficial",
    "reddit": "PluraCoin/",
    "github_org": "pluracoin"
}