{
    "id": "pogcoin",
    "symbol": "pog",
    "name": "PogCoin",
    "platforms": {
        "binance-smart-chain": "0xbe6257f6562036e33ae03e21467d6afe9b7aa66c"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "POGCOIN\r\n\r\nPOGCOIN is a gaming cryptocurrency native to the POGFI (Player Of The Game Finance) ecosystem created to provide 2.7 billion-plus gamers from across the globe a unique opportunity to become a part of a next-gen Blockchain gaming platform. \r\n\r\nUsing $POG (POGCOIN) anyone can; acquire the hottest trending Gameplay and Kill Cam NFTs on the market with frequent discounts on fees for $POG holders, gain exclusive access to our Olympic-styled tournaments (POGMANIA), get access to the most exciting podcasts (POGCASTS) featuring top influencers and celebrities from within the gaming industry and many more!\r\n\r\nThe core idea that inspired the creation of the POGFI ecosystem is to create a disruptive gamer-centric platform that hosts a range of products and services for gamers - all under one umbrella. \r\n\r\nWith the global gaming industry taking quantum leaps in terms of popularity and growth, POGFI aims to connect gamers from across the spectrum through deep tech ventures, such as, an advanced platform featuring a Gameplay NFT marketplace, custom tournament matchmaking app, Virtual Reality Arcade.\r\n\r\n\r\nThe platform allows gamers to connect and win the most exciting rewards by showcasing their gaming skills. POGFI’s daily/weekly community gaming sessions and tournaments are where participating members can win; gaming systems, instore points, cash giveaways and $POG/NFT airdrops. \r\n\r\n\r\nHow can I use my $POG tokens?\r\n\r\nPOGCOIN’s are gaming tokens that have multiple different utilities within the POG ecosystem. It serves as:\r\n\r\n●\tAn incentive for discounted fees on the POG NFT’s platform\r\n●\tThe preferred payment method for the upcoming POG tournament app\r\n●\tA reward for all winners; participants also receive incentives for being a part of POGCLAN tournaments and eSports competitions\r\n●\tA ticket to the POG ecosystem's most exciting features and events designed exclusively for gamers, by gamers.\r\n\r\n\r\nHow $POG Tokenomics work, and what are the rewards for token owners?\r\n\r\nPOGCOIN’s smart contract applies an 8% tax on all transactions of which:\r\n●\t4% is automatically redistributed to POG token holders.\r\n●\t4% is locked and gets transferred to the liquidity pool. \r\n\r\nPOGCOIN ’s auto-redistribution is a hard-coded staking method, which is an incentive for long-term holders. Auto-liquidity allows for a constant source of liquidity to support trades eliminating the need to provide additional liquidity.\r\n\r\nAllocated wallets for marketing have been set before launch to ensure enough capital to apply for exchanges, promote the brand and provide optimum liquidity to fund the growth of POGCOIN and the associated POGFI ecosystem.\r\n\r\nPOGFI will also reinvest a percentage of profits to buy-back $POG and burn them, limiting the supply and creating scarcity. \r\n\r\n50% of the POG supply has also been burned and will continue to be burned as milestones/goals are achieved on the POGCOIN roadmap.\r\n\r\nHow much $POG is there in circulation? \r\n\r\nPOGCOIN was launched on the Binance Smart Chain on May 12, 2021, with 100 billion POG tokens initially created. The Initial presale was then followed on May 18, 2021. 50 billion $POG tokens (50%) were burned shortly after the contract deployment and currently, there are 47 billion $POG in circulation.\r\n\r\nWho are the team members and creators of POGFI? \r\n\r\nThe POGFI gaming ecosystem is the brainchild of Idiris Yunis, a passionate gamer and a strong proponent of blockchain-driven decentralised protocols. Idiris, an avid gamer, who became interested in blockchain technology and paired his curiosity and passion for gaming to create POGFI. It not only caters to a range of requirements of all modern gamers but also provides innovative solutions. Idiris is committed to eliminating the pertinent problems facing the global gaming industry. Co-founder Mohamed Omar takes care of the marketing and branding of the ecosystem, as well as the operation of projects and events. Community manager, Ilyas Yunis, has been instrumental in developing and expanding the POGFI communities across various channels. POGFI also has a strong team of advisors and mentors, consistently supporting the team through their thought leadership and networking programs.\r\n\r\nA month after launching, the team has set up their first POGFI headquarters in London. \r\n\r\nWhere Can I Buy $POG?\r\n\r\nUsers can buy POGFI directly from the PancakeSwap exchange. PancakeSwap is currently used as the main trading platform because most exchanges do not support automated tax functions. "
    },
    "country_origin": "GB",
    "genesis_date": null,
    "contract_address": "0xbe6257f6562036e33ae03e21467d6afe9b7aa66c",
    "url": "https://pogfi.com/",
    "explorers": [
        "https://bscscan.com/token/0xbe6257f6562036e33ae03e21467d6afe9b7aa66c"
    ],
    "twitter": "pogfi_",
    "telegram": "pogcoinchat",
    "reddit": "PogCoinBSC/"
}