{
    "id": "pokerain",
    "symbol": "mmda",
    "name": "Pokerain",
    "platforms": {},
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "MMDA is a new cryptocurrency project issued by Pokerain Technology Co., Ltd. The amount of MMDA tokens in circulation is 1,000,000,000 in total, in which 500,000,000 MMDA tokens are issued based on BUMO public chain, and the remaining 500,000,000 MMDA tokens are issued based on ERC 20 public chain. No extra MMDA tokens will be issued in the future. Pokerain, with its headquarters based in Köln, Germany, is known as a technology company that focuses on its core business of the research, development and operation of blockchain technology. Based on the prospect of fairness and justice in internet-based board and card games, Pokerain strives to conduct the research, development and operation in blockchain-based board and card games with the integration of its core distributive card-dealing technology. Since its establishment in 2017, Pokerain has provided technical support for various internet-based gaming platforms such as Taogame (www.taogame.cc, based in China), TaTe Game (based in India) and Winnermax (based in Germany) regarding their blockchain-based technical upgrades and reconstructions. Known as the partners of Pokerain, all abovementioned internet-based gaming platforms has also become part of Pokerain’s worldwide ecosystem. Through the uploads of all assets and data of Pokerain’s partners on the blockchain, Pokerain will then guarantee the fairness, justice and safety of all players of the blockchain-based board and card games.\r\n\r\nAs one of Pokerain’s super partners, Taogame (www.taogame.cc) has already been running successfully for over 1 year in China. Taogame has so far accumulated 210,000 registered users, 3,000 daily active users and 50,000 monthly active users. As the first product of Pokerain in China, Taogame has adopted DDS distributive card-dealing technology and has designed the blockchain mining model of “Feeding Clams into Mermaids”. More importantly, by collaborating with BUMO public chain, Taogame has also introduced and integrated “Mermaid Wallet” in the game, which allows the game players to actually obtain the MMDA tokens generated from their mining activities and gaming rewards.\r\n\r\nWith the integration of its core distributive card-dealing technology, Pokerain strives to conduct the research, development and operation in blockchain-based board and card games and aims at creating a fair, just and safe gaming platform for blockchain-based board and card gaming industry."
    },
    "country_origin": "",
    "genesis_date": null,
    "url": "http://www.pokerain.com/",
    "explorers": []
}