{
    "id": "polkarare",
    "symbol": "prare",
    "name": "Polkarare",
    "platforms": {
        "ethereum": "0x2c2f7e7c5604d162d75641256b80f1bf6f4dc796"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "What is PolkaRare?\r\nPolkaRare is a web3 economy to create, trade, and discover NFTs. Powered by Polkadot, Polygon, Ethereum, and Binance Smart Chain, PolkaRare offers artists a seamless onboarding experience without the need to use Metamask or make contract transactions on their own. PolkaRare provides a range of tools to users to unlock the maximum potential of NFTs. $PRARE is the native token of PolkaRare used for governance, staking rewards, medium of exchange, NFT farming, etc.\r\n\r\nWho is the Founder of PolkaRare?\r\nPolkaRare is founded by Pramod Mahadik, a professional software developer. Pramod has over eight years of experience in building projects and has previously served at Rediff and Halalbox. Pramod has over four years of experience in the Blockchain space. He is a successful influencer and venture capitalist who has been advising multiple portfolio projects for development and team building.\r\n\r\nWhat is The USP of PolkaRare?\r\nPolkaRare offers NFT creation, NFT trading, multi-token support, community rewards, support licensed content drops, price discoverability, and charges low network fees. Currently, most of the NFT platforms are based on Ethereum. However, the high traffic of the Ethereum network creates various issues in creating and trading NFTs. PolkaRare aims to become a multi-chain NFT platform, where creators and users can optimize the blockchains and seamlessly transfer them across different networks. PolkaRare NFT creation will start on Ethereum and Polygon chains. In the next phase, the NFT will be added to the BSC and will be extended to other blockchain networks gradually.\r\n\r\nHow many $PRARE are there in Circulation?\r\nPRARE is PolkaRare's utility and governance token.\r\nTotal Supply : 100,000,000 PRARE\r\nHardcap: $2,200,000\r\nTotal Tokens be Sold: 36,375,000\r\nPercentage be Sold (Seed + Private + IDO): 36.375%\r\n\r\nToken utilities:\r\nGovernance: $PRARE holders will be able to propose and vote on key proposals; a portion of platform transaction fees will be used for the governance rewards.\r\nMedium of exchange: PRARE is used as a primary mode of payment on PolkaRare\r\nStaking Rewards: Stakers will be rewarded with platform fees. Stake PRARE to earn PRARE.\r\nNFT Farming: Stake PRARE to farm rare NFTs\r\nExclusive NFT drops: PRARE holders will get exclusive drops from the collectibles product.\r\n\r\nToken Distribution and Lock-Up Process:\r\nSeed Round: 12.50%\r\nPrivate Round 1: 12.50%\r\nPrivate Round 2: 9.375%\r\n(Initial Dex Offering)IDO: 2.00%\r\nEcosystem Fund: 9.625%\r\nMarketing/Grants/Partnerships: 10.00%\r\nAdvisors: 3.00%\r\nTeam: 12.00%\r\nCompany Reserve: 10.00%\r\nOperations: 4.00%\r\nMarketplace Mining & Staking: 12.00%\r\nExchanges & Liquidity: 3.00%\r\n\r\nWhat are the Features of PolkaRare’s Products?\r\nPolkaRare’s products are designed to attract the average user to its platform. Its main features are\r\n\r\nMultichain NFT marketplace\r\nNFT Wallet\r\nCollections\r\nNFT Collateralized Loans\r\nRoyalties\r\nUnlockable content:\r\nNFT price discoverability protocol\r\nSocial features\r\nMulti content support"
    },
    "country_origin": "IN",
    "genesis_date": null,
    "contract_address": "0x2c2f7e7c5604d162d75641256b80f1bf6f4dc796",
    "url": "https://www.polkarare.com/",
    "explorers": [
        "https://etherscan.io/token/0x2C2f7e7C5604D162d75641256b80F1Bf6f4dC796",
        "https://ethplorer.io/address/0x2c2f7e7c5604d162d75641256b80f1bf6f4dc796"
    ],
    "twitter": "PolkaRare",
    "telegram": "PolkaRARE"
}