{
    "id": "project-pai",
    "symbol": "pai",
    "name": "Project Pai",
    "platforms": {},
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Project PAI is an open-source blockchain project developing the world's first blockchain-based platform for intelligent 3D AI avatars. Personal AI (PAI) looks, talks and behaves like the individual user and, when secured and authenticated on the blockchain, allows for unprecedented customization, utility and personal data control. With communities worldwide and adopters including leading U.S. AI company ObEN Inc., Project PAI is rapidly advancing its vision of allowing everyone in the world to participate in the new global humanistic AI economy.\r\n\r\nProject PAI's independent blockchain platform is intended to allow users to create, own and manage their digital identity and the associated data, letting users participate in a new global humanistic AI economy where they are the owners of their own digital identity and data. The listing on HBUS marks another step in Project PAI's growth throughout the U.S. and global market.\r\n\r\nProject PAI's vision is to create a platform where everyone can create their own Personal AI, intelligent digital avatars that look, sound and behave like them. With PAI, users can have more personalized digital experiences, including using their PAI for social media content or interacting with the PAI of their doctors, teachers or even their favorite celebrities across a number of applications in retail, entertainment, travel and more. The core technology for the avatars is powered by Project PAI early-adopter ObEN, a leading artificial intelligence company based in Los Angeles, California.\r\n\r\nPAIs are secured and authenticated on the Project PAI blockchain. The intention is to always allow the user to be the owner of their own data and if they choose to contribute that data to improve applications or AI algorithms on the PAI blockchain, they can be compensated for their efforts in PAI Coin. In addition, as an open-source public blockchain, companies and developers can create their own apps and tokens on the PAI blockchain to build more interactions for the Project PAI community.\r\n\r\nAlready this year, Project PAI has launched both its mainnet and github. A third-party-developed digital wallet for PAI Coin, called PAI Up, is also available globally on both iOS and Android. The project has recently expanded into the Southeast Asia, U.K. and European markets, following solid presence in China, Japan, Korea and the U.S."
    },
    "country_origin": "",
    "genesis_date": null,
    "url": "https://projectpai.com/",
    "explorers": [
        "https://paichain.info/"
    ],
    "twitter": "projectpai",
    "telegram": "projectpai",
    "reddit": "ProjectPAI/",
    "github_org": "projectpai"
}