{
    "id": "prophecy",
    "symbol": "pry",
    "name": "Prophecy",
    "platforms": {
        "ethereum": "0x3c81d482172cc273c3b91dd9d8eb212023d00521"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "What Is Prophecy (PRY)?\r\nProphecy is a project that says its focus is “Community Driven - Future Focused” with its central products “Built to Win”, built on a proof-of-committed-decay engine.\r\n\r\nProphecy aims to “provide a framework of continually increasing scarcity and value proposition with a communal, societal approach at the centre of services” — aiding it’s supporters to engage in core crypto services in an increasingly communal, incentivized manner.\r\n\r\nProphecy was founded in late 2020, and the PRY token is designed to ensure that holders can participate in the operation of the ecosystem’s products and services. Because of this, those who hold the $PRY token participate in a multitude of current and upcoming use-cases, from core crypto services like staking and yield generation, to eventual Governance, flagship products like Prophet Pools, and more outlined in the projects roadmap.\r\n\r\nWho Are the Founders of Prophecy?\r\nProphecy was founded by a core team of four experienced in cryptocurrency projects, choosing to remain anonymous.\r\n\r\nExplaining the choice for anonymity prominently on the Prophecy website:\r\n\r\n“The pinnacle and epitome of ‘decentralization’ is anonymity for the user and anonymity for the team. As a cryptocurrency project delivering real and significant impact to the financial market, we wholeheartedly believe and follow the principle that this project should remain solely about the project and the incredible community behind that.\r\n\r\nOur team comprises of extremely senior and experienced professionals within the crypto-sphere, with combined decades of experience between us. We have worked within Top 100 projects and continue to push to innovate cryptocurrencies and DeFi.\r\n\r\nWe don’t want to be the focus ourselves, we don’t want to be idolized or looked up to or treated any differently, we just want to be in the background helping push this project and community as far forwards as humanly possible. Remaining anonymous is the epitome of decentralization, as it’s the project and you - the community - that truly matters.”\r\n\r\nWhat Makes Prophecy Unique?\r\nProphecy is one of the first projects to successfully utilize a proof-of-committed-decay consensus mechanism, which it says is designed to “continually raise the value of the project ecosystem through activity-based token burns” (the higher the collective activity within the project ecosystem, the more token burning occurs).\r\n\r\nThe project is based on the Ethereum blockchain and utilizes Smart Contracts for the implementation of many of its services, including staking, Prophet Pools, and more. Prophecy is blockchain-agnostic and is continually expanding its cross-chain presence.\r\n\r\nProphecy is a decentralized project and is classified as a Decentralized Finance project - with a completely decentralized ecosystem, structure, and approach to development. The Prophecy ecosystem, as a result of being decentralized in nature, allows for flexibility for the integration and development of a wide range of future use cases and products.\r\n\r\nHow Many Prophecy (PRY) Tokens Are There in Circulation?\r\nThere is a maximum supply of 197 million PRY — at the time of writing, there is a circulating supply of about 74.6 million. Two rounds of public sales of Prophecy tokens were held in December 2020.\r\n\r\nOverall, 10% of PRY’s total supply went to the project’s founders (at the time of writing, locked over the duration of a year), 15% of the total is reserved for audits, marketing, and partnership allocations, 25% of the total was distributed through the public sale rounds, and 50% of the total is reserved for liquidity and reward allocations for products.\r\n\r\nWhere Can You Buy Prophecy (PRY)?\r\nProphecy is available to purchase on Uniswap - the largest decentralized exchange on the planet - here: https://info.uniswap.org/token/0x3c81d482172cc273c3b91dd9d8eb212023d00521\r\n\r\nIt is also available to purchase on PancakeSwap for Binance Smart Chain users (BSC): https://exchange.pancakeswap.finance/#/swap?outputCurrency=0x3c81d482172cc273c3b91dd9d8eb212023d00521"
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x3c81d482172cc273c3b91dd9d8eb212023d00521",
    "url": "https://prophecyproject.io/",
    "explorers": [
        "https://etherscan.io/token/0x3c81d482172cc273c3b91dd9d8eb212023d00521",
        "https://ethplorer.io/address/0x3c81d482172cc273c3b91dd9d8eb212023d00521"
    ],
    "twitter": "Prophecy_PRY",
    "telegram": "ProphecyPRY",
    "reddit": "Prophet_DeFi/",
    "github_org": "prophetproject1"
}