{
    "id": "pylon-eco-token",
    "symbol": "petn",
    "name": "Pylon Eco Token",
    "platforms": {
        "binance-smart-chain": "0x57457b5d725d85a70a3625d6a71818304e773618"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "It is a Decentralised Finance (DeFi) based Governance Token, with the benefit of Utility Token, Security Token & CryptoCurrency. It is Deflationary, also provides Staking Reward & Guarantee Portfolio backs it. ICO token comes with a buyback guarantee. It is used in plenty of our Open-source ecosystem projects in Daily life. Through the different ecosystem projects, we can bring the mass adoption of crypto globally.\r\n\r\nWith the increase of crypto usage, which ends the country's borders and government control over our finances, we would like to offer you our token that can be used for the daily purchase of products or services worldwide.\r\n\r\nWe have plenty of ecosystems that can bring together products and services which we are using in our daily life globally.\r\n\r\nFrom Mobile Topup & Gift Cards, Travel (Hotels/Flights) booking, E-commerce, Auction, Gaming, Crypto wallet & Exchange and Payments & Cards solution. Once the projects are operational, we plan to bring this to the Open-source developer community, while we remain as maintainers of the project.\r\n\r\nThese diverse online businesses and open source ecosystems provide significant leverage to use our tokens and make a profit at the same time.\r\n\r\nWe will distribute 9 million tokens as referral incentives, airdrop and for marketing of the projects.\r\n\r\nThe company will reserve 10 million tokens as a liquidity reserve. In the stakeholder ICO phase, we released 40 million tokens to invest in the idea of the project. Later, we managed to distribute 10 million tokens during the Private ICO phase concerning our whitepaper. In the Pre ICO phase, we envisage distributing the next 10 million tokens referencing the partial development of the projects. It is planned to sell the remaining 20 million tokens via the Crypto Exchange upon completing some of our ecosystem projects. Until we distribute our 99 million tokens (that is equal to the total supply of the tokens for the project), we will already be down to 98 million total supply due to the burning of tokens.\r\n\r\nPer transaction fee, open-source developer community funds, staking incentive rewards funds, burning of tokens and many more to be determined by token holders through the voting.\r\n\r\nThe token Release mechanism is 25% linear every year (leaving almost no space for pump and dump). The release starts after the first exchange listing.\r\n"
    },
    "country_origin": "GE",
    "genesis_date": null,
    "contract_address": "0x57457b5d725d85a70a3625d6a71818304e773618",
    "url": "https://www.pylontoken.com/",
    "explorers": [
        "https://bscscan.com/token/0x57457b5d725d85a70a3625d6a71818304e773618"
    ],
    "twitter": "pylonecosystem",
    "telegram": "pylonecosystem"
}