{
    "id": "babybanana",
    "symbol": "bbnana",
    "name": "BabyBanana",
    "platforms": {
        "binance-smart-chain": "0xa3be3b30fa5302dad5c9874cdb50e220eaadf092"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Project BabyBanana is a next generation reflect token on Binance Smart Chain, designed to be a valuable asset to the Apeswap/Koala DeFi jungle ecosystem and also designed to be an easy stepping stone for beginning crypto investors to learn how to generate a passive income. \r\n\r\nIt is an all in one crypto currency tool for building up a diverse portfolio by buying BabyBanana tokens, holding them and staking the Banana/Gnana rewards on Apeswap. \r\nThe tokenomics are effective, easy to understand and profitable. By buying and holding BabyBanana tokens a holder will earn either Banana, Gnana or any other BSC token that team BabyBanana creates a NFT for. On the native platform Apeswap it is possible to stake those tokens in a staking pool of free choice to earn tokens of other Apeswap related projects for free. There are many different pools/tokens to choose from. Some of them are tokens from crypto gaming platforms so the holders are free to use them for this purpose if they would like to. On the website they offer games like \"\"the BabyBanana chess game\"\", that will be available in single- and multiplayer mode. \r\n\r\nThere is a fictional island called Libbyria that serves as the UI on our website and is used as the interface to all BabyBanana utilities/community activities. There are numerous different NFT designs that have unique utilities, have highly collectible and exclusive elements and will also be able to generate passive income through staking. \r\n\r\nTo add an unique factor to the project the NFT designs impersonate fictional characters that live on the earlier mentioned island of Libbyria. Seventeen of those NFTs will be limited edition and 9 will be unlimited. When they are sold out they will be tradable on the aftermarket. There will be 5 tiers of rarity. Some NFTs will be available in unlimited amounts. To prevent holders from stacking NFTs and creating bonusses that will disturb the reward system's balance NFTs are limited to 1 NFT per wallet. If holders want to display their NFT instead of keeping it in their wallet they can put it in our NFT museum. These holders will be rewarded Gnana tokens that are bought from a portion of the NFT revenue and from the reflection rewards that the NFT museum reward wallet generates from owning 1.5% of the BabyBanana token supply. \r\n\r\nApart from the possibilities that BabyBanana gives its holders, the project ensured a transparent and trustable security standard. This was done by an audit from Paladin blockchain security and by locking liquidity for 365 days to provide holders with a peace of mind that the token can always be traded."
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0xa3be3b30fa5302dad5c9874cdb50e220eaadf092",
    "url": "https://babybanana.finance/",
    "explorers": [
        "https://bscscan.com/token/0xa3be3b30fa5302dad5c9874cdb50e220eaadf092"
    ],
    "twitter": "BabyBananaToken",
    "telegram": "BabyBananaOfficial"
}