{
    "id": "baby-shiba",
    "symbol": "bhiba",
    "name": "Baby Shiba",
    "platforms": {
        "ethereum": "0x4a6be56a211a4c4e0dd4474d524138933c17f3e3"
    },
    "hashing_algorithm": null,
    "categories": [
        "Meme Tokens"
    ],
    "description": {
        "en": "BHIBA is developed to follow the footsteps of one of the best performing experimental coins SHIB. BHIBA is a fair and deflationary token built on the ERC-20 network ensuring a wide community to experience the cuteness and loving ways of our Baby Shiba.  Like SHIB, the token has plans to develop a swap and even a wallet revolving around the token BHIBA, allowing consumers and the community to experience a fast and well updated exchange. With wide awareness of the original SHIB token, BHIBA is planning to not only follow but exceed the current path of SHIB, for eg, to be listed in major exchanges and to be exposed to majority of crypto followers, whilst having future plans to connect with other tokens.\r\n\r\nWith active developers, BHIBA plans to ensure validity and fairness of the token, this has already been taken into action through our initial launch.\r\n\r\n-Removal of bots: Trading was paused upon launch, with the maximum transaction percentage lifted slowly to ensure fair distribution of the token.\r\n\r\n-Ownership of the token renounced\r\n\r\n-Liquidity Locked and future locks in plan.\r\n\r\n-Token allocation was clearly demonstrated, (50% burnt to Vitalik Buterin, 30% Liquidity, 7.5% Presale, 5% Giveaways, ~7.5% Marketing/Development.\r\n\r\nBHIBA is not a pump and dump or a token of any illicit, or looked down activity. We are here to be fair and ensure the rise of our experimental yet exciting token."
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x4a6be56a211a4c4e0dd4474d524138933c17f3e3",
    "url": "https://www.realbabyshiba.com/",
    "explorers": [
        "https://etherscan.io/token/0x4a6be56a211a4c4e0dd4474d524138933c17f3e3",
        "https://ethplorer.io/address/0x4a6be56a211a4c4e0dd4474d524138933c17f3e3"
    ],
    "twitter": "realbabyshiba",
    "telegram": "realbabyshiba"
}