{
    "id": "baby-token",
    "symbol": "baby",
    "name": "Baby Token",
    "platforms": {
        "ethereum": "0xdb13fb60d3fddabc41743d9d603ce3f42c17d057"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "BabyToken is a digital money for modern families. Currently, Baby Token is used to reward several million active users of Pregnancy Tracker mobile app. Our ultimate goal is to provide online employment for expectant mothers all over the world by creating micro tasks such as making product reviews and creating marketing content. We also encourage parents to build a diversified crypto portfolio for their babies and use Baby Tokens for extra rewards. Finally, with Baby Tokens users can purchase real goods from Pregnancy Tracker mobile app.\r\n\r\nBaby Token project will use cryptocurrencies and blockchain technology to process millions of small international payments in Pregnancy Tracker and other mobile applications. Expectant mothers and young parents will use digital currencies to earn daily income, pay for healthcare and telemedicine services, and get access to innovative financial services such as crypto savings accounts, investment plans and even blockchain-based insurance.\r\n\r\nOur business cycle thrives on the highest possible customer satisfaction at all sides of the ecosystem. The more users we have, the more advertisers and partners want to join and use our product. At the same time the more partners are listed on our system with their offers, the more users find what they want to use in offered services, bonuses, discounts and promotions."
    },
    "country_origin": "HK",
    "genesis_date": null,
    "contract_address": "0xdb13fb60d3fddabc41743d9d603ce3f42c17d057",
    "url": "https://babytoken.org/",
    "explorers": [
        "https://etherscan.io/token/0xDB13fB60D3fDdaBc41743D9d603CE3F42C17D057",
        "https://ethplorer.io/address/0xDB13fB60D3fDdaBc41743D9d603CE3F42C17D057"
    ],
    "twitter": "babytokenorg",
    "facebook": "babytokenorg",
    "telegram": "babytokenorg"
}