{
    "id": "baby-moon-wolf",
    "symbol": "babywolf",
    "name": "Baby Moon Wolf",
    "platforms": {
        "binance-smart-chain": "0x5b5a3a45002736413613b8a4c46cc0d9d1d6f4ae"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Baby Moon Wolf is a community driven, fair launched DeFi Token. 5% of all transactions will be redistributed to the community, rewarding long-term holders. To ensure constant liquidity Baby Wolf has been designed to add 2% of all transactions towards the liquidity pool.\r\n\r\nWe have seen coins with weak development that are unable to keep up. One's with weak leadership that are unable to handle criticism. And others with weak communities that were able to be taken advantage of. Baby Moon Wolf was made to be the Dogecoin & Shiba killer. Moon Wolves are known for their intelligence & sharpness. They are strong, swift, and stealthy. Baby Moon Wolf was designed to be the coin that stands on its feet and is able to strike in the blink of an eye. he coin that is able to catch its opponents off guard. The coin that is able to outsmart & outperform.\r\n\r\nThis is the real coin that you absolutely CANNOT afford to miss out on. $BABYWOLF was launched as a fair sale by well known devs in the community. The current marketing is run by a team of professionals who own a digital agency and have gained years of experience in the marketing field. They have worked with some of the biggest names across all industries. Because of this, they have contacts and relationships with some of the biggest influencers, celebrities, and icons. In the next few days & even weeks, we will be seeing some the most effective & intense promotional campaigns ever. They are known as one of the strongest forces in digital marketing. They are the real deal."
    },
    "country_origin": "US",
    "genesis_date": null,
    "contract_address": "0x5b5a3a45002736413613b8a4c46cc0d9d1d6f4ae",
    "url": "https://www.babywolftoken.com",
    "explorers": [
        "https://bscscan.com/token/0x5b5a3a45002736413613b8a4c46cc0d9d1d6f4ae"
    ],
    "twitter": "babywolf_token",
    "telegram": "BabyWolfBsc",
    "reddit": "babywolf"
}