{
    "id": "baby-bonfire",
    "symbol": "FIRE",
    "name": "Baby Bonfire",
    "platforms": {
        "binance-smart-chain": "0x24b66a58d505ff7651c31358b3a2d697644a8de7"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Baby Bonfire, a unique token that will provide its users with double reflection rewards, the ratio of 80% rewards will be distributed via BNB, which will provide immediate benefits to the user short term, and 20% provided in Ethereum. These two tokens have been carefully chosen to greatly benefit the community for holding, to provide both immediate and long term financial applications. After careful consideration we have selected both BNB and Ethereum to be the two tokens most likely to provide our users with instant funds, both in the form of passive income, and also give them the best opportunity to profit long term, in the form of an increase in value of these reflection tokens. \r\n\r\nBaby Bonfire is a hyper-deflationary token that benefits you with tangible rewards. Tokenomics that simply reward itself within its self-same reflections become useless in scenarios where volume and market-cap are less than desirable: inherently damaging the project. Simply hold Baby Bonfire, and every 60 minutes you will receive reflections in both BNB and Ethereum. The BNB will increase in value and can be staked for passive income. The Ethereum will solidify this concept with an additional pool of revenue for users. Passive income or even Bonfire can be staked in the future to receive passive Ethereum and a THIRD token, depending on the pool. We hope that this satisfies your needs as a holder. We have catered to each requirement by providing great reflections, hourly auto compounding, passive income in stable platforms, and a gateway into two great projects, one which has the potential to 3x-5x and the other which the potential to 100x.\r\n\r\nBaby Bonfire ($FIRE) is a limited supply token with many inherent utilities, with a total supply hard-capped at 1 quadrillion. 80% (800 trillion) of the tokens have been initially burned"
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x24b66a58d505ff7651c31358b3a2d697644a8de7",
    "url": "https://babybonfire.io",
    "explorers": [
        "https://bscscan.com/token/0x24b66a58d505Ff7651C31358b3A2d697644a8dE7"
    ],
    "twitter": "BABYB0NFIRE",
    "telegram": "BabyBonfireBSC"
}