{
    "id": "babybnb",
    "symbol": "babybnb",
    "name": "BabyBNB",
    "platforms": {
        "binance-smart-chain": "0xc1168b7b85b2bbc8a5c73c007b74e7523b2da209"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Baby BNB is a deflationary token created in the Binance smart chain ecosystem, the project aims to solve two of the world's biggest problems today. \r\n\r\nThe first one is of an ethical origin, becoming our social responsibility objective; \r\n\r\nWe believe that the biggest challenge of humanity to date is the continuous endangerment, manipulation, harm and death of millions of children in every continent of this world. If this society cannot take care of its children, then it is set to continuously fail, over and over.\r\n\r\nThe second one is our business implementation; \r\n\r\nThere is a plague of non ethical projects and bad actors who seek no business implementation, never the less bring value to humanity.  Popular tokens that are devised as a pyramid scheme by these non ethical developers, not only endanger the image of our revolutionary technology, but retrace its mass adoption, leaving many users destroyed when they pay the imminent bill. It is not “if”, it’s “when”.  \r\n\r\nIn this era of revolutionary block chain technology, a one-of-a-kind opportunity arises for regular humans to interact in new economic dynamics, cooperating in new financial models that are more democratic, fast, cooperative and accessible.\r\n\r\nThe key element of our proposal is to encourage a whole new generation of ethical and socially responsible projects like ours to solve in a definite way the most overwhelming problems we face as a society. Baby BNB provides an accessible and fast framework helping them achieve these goals in the immediate time horizon. \r\n\r\nBaby BNB plans to be the HERO of a “popular” but serious wave of groups and individuals that seek to change the crypto ecosystem, forever! \r\n\r\nAn innovative Ecosystem \r\n\r\nBaby BNB is an ecosystem supported between holders, while they hold, they partake in the benefits and profits from several use cases that aim to revolutionize mass adoption in the space providing secure and smart projects for the masses that have partnered with the BABYBNB platform. \r\n\r\n\r\nSwap \r\n\r\nWe will bring all the best projects of the ecosystem to be swapped with our Baby BNB in an attractive, user-friendly interface. \r\n\r\nStaking\r\n\r\nEarn BNB by holding Baby BNB, your participation fuels the ecosystem that is constantly launching products and creating value for the token holders. \r\n\r\nThe Phygital Marketplace\r\n\r\nOur holders and visitors can trade physical goods around the world as well as digital goods. Payments accepted will be in BABYBNB. The users can swap the crypto-currencies on our website and convert them to BABYBNB prior to acquiring any goods on our platform. The profits in our platform will be redistributed to our ecosystem.  \r\n\r\nThe Launch pad \r\n\r\nThe launch pad is our star product. We believe that the crypto space can be so much better and solve real-life issues. We know there are incredible developers with fantastic ideas that want to make a contribution in this manner but simply don’t have the resources, experience or connections to achieve their goals.\r\n\r\nOur ambitious Launch pad will have social responsibility, sharp business implementation and ethics as the core of every project to be launched, while being the most inclusive launch platform ever created. \r\n\r\nWe provide the Baby BNB innovative framework to any brilliant idea, individual or group in the world on a partnership basis to the selected solicitudes. \r\n\r\nThe Charity Bridge \r\n\r\nWe are constantly curating and adding to our platform the world’s most efficient charities in their respective areas, no matter the size they can all access our framework. Our proprietary technology interface will allow any crypto project in the world to integrate a socially responsible cause to their business. What is so unique about this interface is that it is curated and monitored by our team and public ambassadors. With our interface we will connect these distant worlds in a matter of seconds and our holders will benefit from the usage of this interface. \r\n\r\nThis is how the world is changed and positively impacted, in a matter of seconds! "
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0xc1168b7b85b2bbc8a5c73c007b74e7523b2da209",
    "url": "https://babybnb.org",
    "explorers": [
        "https://bscscan.com/token/0xc1168b7b85b2bbc8a5c73c007b74e7523b2da209"
    ],
    "twitter": "babybnb_bsc",
    "telegram": "babybinance",
    "github_org": "babybnb"
}