{
    "id": "beefy-finance",
    "symbol": "bifi",
    "name": "Beefy.Finance",
    "platforms": {
        "binance-smart-chain": "0xca3f508b8e4dd382ee878a314789373d80a5190a",
        "huobi-token": "0x765277eebeca2e31912c9946eae1021199b39c61",
        "avalanche": "0xd6070ae98b8069de6b494332d1a1a81b6179d960",
        "polygon-pos": "0xfbdd194376de19a88118e84e279b977f165d01b8",
        "fantom": "0xd6070ae98b8069de6b494332d1a1a81b6179d960",
        "harmony-shard-0": "0x6ab6d61428fde76768d7b45d8bfeec19c6ef91a8",
        "arbitrum-one": "0x99c409e5f62e4bd2ac142f17cafb6810b8f0baae"
    },
    "hashing_algorithm": null,
    "categories": [
        "Fantom Ecosystem",
        "Polygon Ecosystem",
        "Avalanche Ecosystem",
        "HECO Chain Ecosystem",
        "Decentralized Finance (DeFi)",
        "Yield Aggregator",
        "Binance Smart Chain Ecosystem"
    ],
    "description": {
        "en": "$BIFI tokens are ‘dividend-eligible’ revenue shares in Beefy Finance, through which holders earn profits generated by Beefy Finance and are entitled to vote on important platform decisions. \r\n\r\nBeefy Finance is a Decentralized Finance (DeFi) Yield Optimizer platform that allows its users to earn compound interest on their holdings.\r\n\r\nDeFi applications are unique in the sense that they are permissionless and trustless, meaning that anyone with a supported wallet can interact with them without the need for a trusted middleman.\r\n\r\nThrough a set of investment strategies secured and enforced by smart contracts, Beefy Finance automatically maximizes the user rewards from various liquidity pools (LPs),‌ ‌automated market making (AMM) projects,‌ ‌and‌ ‌other yield‌ farming ‌opportunities in the DeFi ecosystem. \r\n\r\nFor all the vaults deployed on every blockchain, Beefy Finance has its native governance token $BIFI at its core. Platform revenue is generated from a small percentage of all the vault profits and distributed back to those who stake $BIFI. \r\n\r\nBeefy Finance is a supported partner of Binance’s official decentralized wallet, Trust Wallet, and audited by Certik to guarantee the robustness of deployed smart contracts. Certik has already provided audits for such projects as Ocean Protocol, NEO, Ontology, and Waves.\r\n\r\nThe supply of $BIFI is limited at 80,000 tokens and available on the top decentralized exchanges such as Binance, 1inchexchange and PancakeSwap. \r\n\r\nWhat is $BIFI?\r\n\r\n$BIFI is the native governance token of Beefy Finance. $BIFI Tokens can be staked on the Beefy platform to gain rewards and interest. A portion of the fees paid by anyone using Beefy’s yield optimization vaults are distributed to holders of $BIFI staked on the platform. Token holders also have a right to create and vote on proposals to the platform as part of its governance system. They can vote without un-staking their tokens. \r\n\r\nWhat makes Beefy Finance unique?\r\n\r\nThere are lots of farms to choose from across several blockchains. Beefy automates and optimizes different investment strategies, allowing token holders to benefit from the upside of complex farming protocols. Users can request new vaults directly from Beefy’s developers and the time it takes to answer these requests is very low.\r\n\r\nWhat are yield farming and yield optimization?\r\n\r\nYield farming is simply a way to make some interest with crypto holdings. A yield optimizer is an automated service that seeks to gain the maximum possible return on crypto-investments made through DeFi platforms. They work much more efficiently than attempting to maximize yield through manual means. Each yield optimization method on Beefy Finance has its own unique strategy for farming, which normally involves the reinvestment of crypto assets staked in liquidity pools. At the most simple level, it farms the rewards given from staked assets and reinvests them back into the liquidity pool for the user.\r\n\r\nWhat are Beefy vaults?\r\n\r\nVaults are investment instruments that employ an optimized set of strategies for yield farming. They make use of automation to continually invest and reinvest deposited funds, which help to achieve high levels of compounded interest. Vaults are the core of the Beefy Finance ecosystem. In a Beefy vault, you earn more of the asset you stake, regardless of whether it’s a liquidity pool (LP) token or a single asset.\r\n\r\nDespite what the name 'vault' suggests, user funds are never locked on Beefy.Finance. Users can withdraw from a vault at any moment in time and Beefy does not own the funds staked in its vaults.\r\n\r\nWhat fees are incurred from using Beefy Finance?\r\n\r\nThe performance fees are already built into the displayed APY of each vault and daily rate. Most vaults available on Beefy Finance take 4.5% of harvest rewards. \r\nThe performance fee on users vault profits is largely distributed back to $BIFI stakers and is the main source of Beefy Finance's platform revenue: 3% is distributed back to $BIFI stakers, 0.5% is allocated to treasury, 0.5% to the strategist that developed the vault and 0.5% for the one calling the harvest function. \r\n\r\nEach vault has either a deposit or withdrawal fee of 0.1% or less, which is there to protect bad actors from abusing the vaults. This is shared with all other stakers in that specific vault. Users should also consider network transaction fees when adding or removing funds. These fees do not go to Beefy, but to the operators keeping the blockchain network up and running.\r\n"
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0xca3f508b8e4dd382ee878a314789373d80a5190a",
    "url": "https://beefy.finance/",
    "explorers": [
        "https://bscscan.com/token/0xCa3F508B8e4Dd382eE878A314789373D80A5190A",
        "https://cchain.explorer.avax.network/tokens/0xd6070ae98b8069de6B494332d1A1a81B6179D960/token-transfers",
        "https://polygonscan.com/token/0xfbdd194376de19a88118e84e279b977f165d01b8"
    ],
    "twitter": "beefyfinance",
    "telegram": "beefyfinance",
    "github_org": "beefyfinance"
}