{
    "id": "bingus-network",
    "symbol": "bingus",
    "name": "Bingus Network",
    "platforms": {
        "binance-smart-chain": "0x12adadddc8d86081561a3ff107a2cb347779e717"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Bingus Network is a cryptocurrency project promoting animal welfare. \r\nA percentage of every $BINGUS token transaction on the Binance Smart Chain (BSC) goes towards animal charity donations; Bingus has already donated over $100k in cryptocurrencies to animal shelters, rescues and causes around the world.\r\n\r\nBingus Network has ambitious goals to make holding Bingus Network tokens a valuable investment that offers engaging staking, earning and, ultimately, opportunities to benefit animals worldwide.\r\nThe project is developing Bingus Platform in collaboration with numerous animal shelters to provide a long-lasting, free-of-charge software to manage their animal shelter animal registries, from documenting the animal in the field right the way through to adoption. \r\n\r\nBingus has talented developers working on innovative and engaging staking opportunities, such as locked vaults, solo staking to support your favorite charity, and LP token rewards systems.\r\nBingus has a diverse and eclectic myriad of community members who harbour a wide range of skills. As such, our community driven projects include creative deliverables such as Bingus Run, the play-to-earn game, and Neural Bingus, the artificial intelligence generated NFT artist. \r\n\r\nAll at Bingus Network are all united by two things: our love of animals, and our love of crypto."
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x12adadddc8d86081561a3ff107a2cb347779e717",
    "url": "https://bingus.io",
    "explorers": [
        "https://bscscan.com/token/0x12adadddc8d86081561a3ff107a2cb347779e717"
    ],
    "twitter": "bingus_network",
    "telegram": "BingusNetworkOfficial",
    "reddit": "BingusFinance/"
}