{
    "id": "bitshares",
    "symbol": "bts",
    "name": "BitShares",
    "platforms": {},
    "hashing_algorithm": "Delegated Proof-of-Stake",
    "categories": [
        "Exchange-based Tokens"
    ],
    "description": {
        "en": "BitShares (symbol BTS), formerly known as ProtoShares (PTS), is an industrial grade “crypto-equity”, peer to peer distributed ledger and network based on a <a href=\"https://www.coingecko.com/en?hashing_algorithm=Delegated+Proof-of-Stake&view=market\">Delegated Proof of Stake (DPoS)</a> algorithm. It was created in 2014 by visionary Dan Larimer (“Bytemaster”), co-founder of <a href=\"https://www.coingecko.com/en/coins/steem\">Steemit</a>, <a href=\"https://www.coingecko.com/en/coins/eos\">EOS</a> and Cryptonomex. BitShares is based on Graphene, an open source C++ blockchain implementation, which acts as a consensus mechanism. Graphene is used by several other projects like Steemit.com (decentralized Reddit, blog platform), and <a href=\"https://www.coingecko.com/en/coins/peerplays\">PeerPlays.com</a> (gaming site and token PPY) indicating real-world usage.\r\n\r\nBitShares competes with banks by issuing collateralizing market-pegged and stable bitAssets (also called smart coins). This means crypto-based assets track real-world market assets like the US dollar denominated “bitAsset” known as bitUSD. This tracks the movements of the dollar by aggregating a variety of data sources that are maintained by the BitShares community. This Smart Coin token always has at least 200% (or more) of its value backed by the BitShares core currency (BTS), to which it can be converted at any time, as collateral in a smart-contract based loan managed by the blockchain.\r\n\r\nA SmartCoin is a cryptocurrency whose value is pegged to that of another asset, such as the US Dollar or gold. SmartCoins always have 100% or more of their value backed by the BitShares core currency, BTS, to which they can be converted at any time at an exchange rate set by a trustworthy price feed. BitShares provides a high-performance decentralized exchange, with all the features you would expect in a trading platform. It can handle the trading volume of the NASDAQ, while settling orders the second you submit them. High performance blockchain technology is necessary for cryptocurrencies and smart contract platforms to provide a viable alternative to existing financial platforms.\r\n\r\nBitShares BTS is considered a legacy coin as it predates most exchanges (and publications) and is responsible for the crypto trading pair concept. It’s also the first delegated Proof of Stake blockchain and uses community-elected delegates for governance."
    },
    "country_origin": "",
    "genesis_date": "2014-07-19",
    "url": "http://bitshares.org/",
    "explorers": [
        "http://cryptofresh.com/",
        "http://open-explorer.io/#/dashboard",
        "http://bts.ai/",
        "https://bitsharescan.com/"
    ],
    "twitter": "bitsharesorg",
    "facebook": "officialbitshares",
    "reddit": "BitShares",
    "github_org": "bitshares"
}