{
    "id": "blue-whale",
    "symbol": "bwx",
    "name": "Blue Whale",
    "platforms": {
        "ethereum": "0xce5114d7fa8361f0c088ee26fa3a5446c4a1f50b"
    },
    "hashing_algorithm": null,
    "categories": [
        "Business Platform"
    ],
    "description": {
        "en": "Blue Whale Foundation, The Decentralized Ecosystem for the Self-Employed Blue Whale is set to rock the gig economy’s boat by building a decentralized ecosystem to allow freelancers and the self-employed to reap rewards and employment benefits from their contributions\r\n\r\nAgainst the backdrop of technological disruption and offshoring, the “gig/sharing  economy” is burgeoning globally. Freelancers will make up a whopping 58% of the US workforce by 2027. Consequently, peer-to-peer booking platforms like AirBnB and Uber have seen a meteoric rise in demand accompanying these shifts in the job market. As the definition of work changes and evolves, the difficulties encountered by freelancers and part-time workers such as the lack of protection, and the insecurity of self-employment will only worsen. This not only affects the growing mass of freelancers, but also ruptures the social contract between workers and governments. \r\n\r\nConsumer protections have also weakened because of the murky legal relationship between freelancers and their host platforms. This simmering dissatisfaction has created popular backlash, as concerned governments in several countries such as France have begun to crack down on platforms like Uber and AirBnB. Despite these worrying trends, no workable remedy has been proposed - until now. The Blue Whale Foundation’s ICO is set to rock the boat of the gig/sharing economy by leveraging on blockchain as a service to provide freelancers with employment benefits such as paid-time-off, and retirement pensions traditionally available only to salaried employees."
    },
    "country_origin": "SG",
    "genesis_date": null,
    "contract_address": "0xce5114d7fa8361f0c088ee26fa3a5446c4a1f50b",
    "url": "https://www.bluewhale.foundation/",
    "explorers": [
        "https://etherscan.io/token/0xce5114d7fa8361f0c088ee26fa3a5446c4a1f50b",
        "https://ethplorer.io/address/0xce5114d7fa8361f0c088ee26fa3a5446c4a1f50b"
    ],
    "twitter": "BlueWhaleFdn",
    "facebook": "bluewhalefoundation",
    "telegram": "bluewhalefdn",
    "reddit": "BlueWhaleFdn/",
    "github_org": "BlueWhaleFoundation"
}