{
    "id": "bnktothefuture",
    "symbol": "bft",
    "name": "BnkToTheFuture",
    "platforms": {
        "ethereum": "0x01ff50f8b7f74e4f00580d9596cd3d0d6d6e326f"
    },
    "hashing_algorithm": null,
    "categories": [
        "Finance / Banking"
    ],
    "description": {
        "en": "At Bnk To The Future, we started our mission in 2010 to build the largest and most reputable Online Investment Platform in order to co-invest with other professional investors in the future of finance and technology. Today we have the largest community of over 47,500 global professional investors all investing online in FinTech, Bitcoin and Blockchain companies. \r\n\r\nWhat is BnkToTheFuture.com?\r\nWe started our mission in 2010 to build the largest and most reputable Online Investment Platform to allow our qualifying investors to co-invest in the future of finance and technology - globally.\r\n\r\nWhat is the BF Token (BFT)?\r\nThe BF Token (BFT) can be used by all as a reward and membership token to help us create\r\n- A less centralised process for listing on BnkToTheFuture.com.\r\n- A community enhanced due diligence process for deals we list.\r\n- Incentivised, fast and real time Investor relations with more transparency of information.\r\nAs well as a token to be used by our investors on our existing online investment platform or our trading market the we plan to launch in 2018.\r\n\r\nBnk To The Future is a platform that provides the environment for future financial and technology investments with professional investors. Having more than 10,000 BFTs on the platform allows access to future investment opportunities, allowing users to invest in innovative pin tech start-ups, vote on publicly traded shares. It is a system that allows professional investors investing in more than 60,000 PINTech, cryptography, and block chain companies on the BFT platform and has a preferred access to future transactions with 10,000 BFT deposits. In 2018, we aim to establish a legitimate token market securities market. In particular, Simon Dixon, a block chain master, is a key member of the project team. In particular, the portfolio includes <a href=\"https://www.coingecko.com/en/exchanges/bitstamp\">BitStamp</a>, <a href=\"https://www.coingecko.com/en/exchanges/kraken\">Kraken</a>, <a href=\"https://www.coingecko.com/en/exchanges/bitfinex\">Bitfinex</a>, ShapeShift, Bitpay, Kim, BitPesa, Unocoin, <a href=\"https://www.coingecko.com/en/coins/maidsafecoin\">MaidSafe</a>, Coinsecure, <a href=\"https://www.coingecko.com/en/coins/factom\">Factom</a> and Uphold."
    },
    "country_origin": "HK",
    "genesis_date": "2018-02-06",
    "contract_address": "0x01ff50f8b7f74e4f00580d9596cd3d0d6d6e326f",
    "url": "https://bf-token.bnktothefuture.com/#!/",
    "explorers": [
        "https://etherscan.io/token/0x01ff50f8b7f74e4f00580d9596cd3d0d6d6e326f",
        "https://ethplorer.io/address/0x01ff50f8b7f74e4f00580d9596cd3d0d6d6e326f"
    ],
    "twitter": "BankToTheFuture",
    "facebook": "banktothefuture",
    "telegram": "bf_token",
    "github_org": "BankToTheFuture"
}