{
    "id": "ocean-protocol",
    "symbol": "ocean",
    "name": "Ocean Protocol",
    "platforms": {
        "ethereum": "0x967da4048cd07ab37855c090aaf366e4ce1b9f48",
        "sora": "0x002ca40397c794e25dba18cf807910eeb69eb8e81b3f07bb54f7c5d1d8ab76b9"
    },
    "hashing_algorithm": null,
    "categories": [
        "Polygon Ecosystem",
        "Protocol",
        "Storage",
        "Polkadot Ecosystem"
    ],
    "description": {
        "en": "Ocean Protocol is an ecosystem for sharing data and associated services. It provides a tokenized service layer that exposes data, storage, compute and algorithms for consumption with a set of deterministic proofs on availability and integrity that serve as verifiable service agreements. There is staking on services to signal quality, reputation and ward against Sybil Attacks.\r\n\r\nOcean helps to unlock data, particularly for AI. It is designed for scale and uses blockchain technology that allows data to be shared and sold in a safe, secure and transparent manner.\r\n\r\nThe Ocean Protocol is an ecosystem composed of data assets and services, where assets are represented by data and algorithms, and services are represented by integration, processing and persistence mechanisms. Ocean Protocol facilitates discovery by storing and promoting metadata, linking assets and services, and provides a licensing framework that has toolsets for pricing.\r\n\r\nA multitude of data marketplaces can hook into Ocean Protocol to provide “last mile” services to connect data providers and consumers. Ocean Protocol is designed so that data owners cannot be locked-in to any single marketplace. The data owner controls each dataset."
    },
    "country_origin": "SG",
    "genesis_date": null,
    "contract_address": "0x967da4048cd07ab37855c090aaf366e4ce1b9f48",
    "url": "https://oceanprotocol.com/",
    "explorers": [
        "https://etherscan.io/token/0x967da4048cd07ab37855c090aaf366e4ce1b9f48",
        "https://blockchair.com/ethereum/erc-20/token/0x967da4048cd07ab37855c090aaf366e4ce1b9f48",
        "https://ethplorer.io/address/0x967da4048cd07ab37855c090aaf366e4ce1b9f48"
    ],
    "twitter": "oceanprotocol",
    "telegram": "oceanprotocol",
    "reddit": "oceanprotocol/",
    "github_org": "oceanprotocol"
}