{
    "id": "orion-initiative",
    "symbol": "orion",
    "name": "Orion Initiative",
    "platforms": {
        "binance-smart-chain": "0x2821989877c0189bf63837f18a2856e30297af70"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Orion is not a project, it’s an initiative built with multiple applications and purposes. We are in no way a meme coin, but something much more valuable.\r\n\r\nIn Greek mythology Orion was a giant huntsman whom Zeus (or perhaps Artemis) placed among the stars as the constellation of Orion. Orion served several roles in ancient culture; he was venerated as a hero, in the region of Boeotia; and there is one etiological passage which says that Orion was responsible for the present shape of the strait of Sicily. The constellation also lines up perfectly with the Egyptian Pyramids in the night sky.\r\n\r\nThe purpose for naming our initiative after this ancient hunter, is that we feel the constellation is a path for the world to follow. You can always find your way if you are lost by following the 3 massive stars on Orion’s belt, Mintaka, Alnilam and Alnitak. Orion itself is among the brightest and most prominent in the winter sky. Orion was a brave hunter, and although he faced obstacles throughout his lifetime, he managed to fight through them and become victorious, claiming his spot amongst the stars for eternity.\r\n\r\nChildhood cancer is not fair, the suffering of these young fighters is unimaginable. Yet they show bravery and courage through perseverance. Most of these children do not understand what or why this is happening to them. As they are poked and prodded with experimental chemicals that break their bodies down, they stand strong. These children are the future. Childhood cancer is personal to us, and we will not stop until we find a cure. That’s why 3% of our liquidity will be donated to vetted children’s hospitals around the world, to find a cure to this merciless plague.\r\n\r\nThe Orion initiative is also building the first exchange with un-rugable liquidity pools as well as token lockers. If a new coin creates a pool at Orion Finance the liquidity will be auto locked for 90 days. We feel if you are serious, and your project is legitimate, you would have found initial resources that are able to fund your creation. The Binance Smart Chain is a great platform with lots of opportunities for the future of finance. However it is being destroyed by scammers coming in droves to take advantage of unknowing investors trying to secure a future for themselves and their families. With our platform your investment is safe and secure.\r\n\r\nThe Orion finance team has built their business from the ground up with hard work and determination, expecting others to do the same. Through honesty and integrity, we shall thrive. Orion Finance will also feature real-time analytics as well as live graphs of all currencies listed on the Binance Smart Chain as well as the Ethereum Mainnet. We will also feature a lending platform where investors can access and be instantly approved to thousands of lenders worldwide. Last but not least, investors will be able to farm and stake the Orion Finance Shilling Token (Ticker: SHILL). We will continue to grow with the latest technology, and innovations securing the future for all investors worldwide."
    },
    "country_origin": "US",
    "genesis_date": null,
    "contract_address": "0x2821989877c0189bf63837f18a2856e30297af70",
    "url": "https://orioninitiative.com/",
    "explorers": [
        "https://bscscan.com/token/0x2821989877c0189bf63837f18a2856e30297af70"
    ],
    "twitter": "Orion_defi",
    "telegram": "orionfinancial",
    "reddit": "The_Orion_Initiatve/"
}