{
    "id": "unirealchain",
    "symbol": "unr",
    "name": "Unirealchain",
    "platforms": {
        "binance-smart-chain": "0x2f5825c4c409c3baac9cac019c9c1e9dcf2cc557"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Unirealchain is a digitalization and investment real estate project based on the Blockchain platform, pioneering in the application of real estate investment on decentralized NFT exchanges. Thereby, Unirealchain helps investors from all over the world to have access to valuable projects with just a small amount of capital. By applying blockchain technology, digital signatures, and asset fractionalization, Unirealchain helps shorten transaction time between buyers and sellers, and also helps investors call for crowdfunding easier.\r\n\r\nWith a diversified ecosystem, Unirealchain aims to bring the best convenient experience to users not just in real estate investment:\r\nUnirealEx - investment and transaction platform: All projects before being listed on UnirealEx must be appraised carefully by Unirealchain's experienced team of professionals. Therefore, investors can be assured about projects legitimacy. All trading transactions are implemented through smart contracts and saved to the blockchain.\r\n\r\nUnirealSwap: Users can swap token pairs or staking to receive interest up to 100% annually. \r\n\r\nUnirealPortal: Real estate information portal is developed by Unirealchain. Investors can easily search real estate properties information such as owner, location, price history, etc. In addition, Unirealchain team of experts also analyzes and evaluates projects on UnirealEx exchange in order to give investors an objective and precise view about the projects before making an investment decision.\r\nUnirealWallet: With UnirealWallet, users can manage Private key directly and store various cryptocurrencies including UNR. UnirealWallet can also be used to make a payment at restaurant, hotel systems that are connected with Unirealchain. \r\n\r\nUnirealchain and Hamubay have signed a digital contract that allows holders of UNR tokens issued by Unirealchain to buy and sell Hamubay real estate assets. With Hamubay as a backer, Unirealchain can operate for at least 5 years without the need of finding other projects."
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x2f5825c4c409c3baac9cac019c9c1e9dcf2cc557",
    "url": "https://unirealchain.com/",
    "explorers": [
        "https://bscscan.com/token/0x2f5825c4c409c3baac9cac019c9c1e9dcf2cc557"
    ],
    "twitter": "unirealchain",
    "telegram": "unirealchaingroup",
    "github_org": "Unirealchaindev"
}