{
    "id": "united-doge-finance",
    "symbol": "udog",
    "name": "United Doge Finance",
    "platforms": {
        "ethereum": "0x4a9d8b8fce0b6ec033932b13c4e24d24dc4113cd"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Launched in August 2021, United Doge Finance is a decentralized cryptocurrency token built on both the Ethereum and Binance Smart Chain network. It was created with the community and investor in mind.\r\n\r\nOur goal is to provide generational wealth to all of our loyal holders with a hyper-deflationary functionality and automatic staking to reward $UDOG holders, all the while, providing multiple real world use cases to make $UDOG a leader in the transition from fiat to crypto. We redistribute 3% of every buy and sell transaction fee to $UDOG holders, 3% of every buy and sell transaction fee is stored away to help support $UDOG’s project and donations to charities of our communities choice, and lastly, 2% of every buy and sell transaction fee is automatically and instantly burned forever.\r\n\r\nWe have created an NFT line for United Doge Finance, called United Doge NFT. The NFT line will be a multi-collection card series, that features UDOG traveling the world. The NFT line will help support additional NFT collections, an NFT marketplace, NFT marketing, a fund to help build the debit/credit card project, the purchase of $UDOG token, partnerships/collaborations and charity.\r\n\r\nOur mission is to partner with several payment processing leaders to allow the token to be used for everyday purchases, both online and offline. Next, we plan to individually partner with companies in the travel and credit industries to take $UDOG abroad. And lastly, we plan to allow individuals to build personal credit, by having a credit card, with built-in rewards, powered by $UDOG.\r\n\r\nTogether, we will make a successful decentralized cryptocurrency!"
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x4a9d8b8fce0b6ec033932b13c4e24d24dc4113cd",
    "url": "https://www.uniteddogefinance.com/",
    "explorers": [
        "https://etherscan.io/token/0x4a9d8b8fce0b6ec033932b13c4e24d24dc4113cd",
        "https://ethplorer.io/address/0x4a9d8b8fce0b6ec033932b13c4e24d24dc4113cd"
    ],
    "twitter": "UDogeFinance",
    "telegram": "UnitedDogeFinanceChat",
    "reddit": "OfficialUDOGFinance/"
}