{
    "id": "unity-network",
    "symbol": "unt",
    "name": "Unity Network",
    "platforms": {
        "ethereum": "0x8d610e20481f4c4f3acb87bba9c46bef7795fdfe"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Unity Network was born out of one of the oldest problems in finance: the lack of power held by individuals over their own financial lives. Centralized banks develop and shelve products, freeze accounts, and seize assets with little or no input from their users. It’s time for a change.\r\n\r\nUnity Network gives you that power back.\r\nJoining our decentralized autonomous network (DAO) gives UNT holders the power to vote on major decisions such as decentralized application (dApp) development, upgrades, marketing efforts, and more. If you’ve ever had an idea concerning the DeFi space that you’d like to see come to fruition, you can propose it here. If it’s feasible and the community agrees, you’ll soon watch your idea become reality in a way that’s far quicker and more agile than bigger, more centralized projects.\r\n\r\nThis isn’t the only reward for UNT holders. Because each dApp developed by Unity Network is powered by UNT, each added use case drives up the value of the token. This is a powerful incentive for those simply looking to invest.\r\n\r\nUnity Network offers you the power to create a new generation of dApps focused on your unique needs. Head to our Homepage to learn how to purchase the UNT token and join the DAO so you can get started."
    },
    "country_origin": "NO",
    "genesis_date": null,
    "contract_address": "0x8d610e20481f4c4f3acb87bba9c46bef7795fdfe",
    "url": "https://unitynetwork.app/",
    "explorers": [
        "https://etherscan.io/token/0x8d610e20481f4c4f3acb87bba9c46bef7795fdfe",
        "https://ethplorer.io/address/0x8d610e20481f4c4f3acb87bba9c46bef7795fdfe"
    ],
    "twitter": "unitynetworkapp",
    "telegram": "UnityNetworkapp",
    "reddit": "UnityNetwork/",
    "github_org": "unity-network"
}