{
    "id": "urus-token",
    "symbol": "urus",
    "name": "Aurox Token",
    "platforms": {
        "ethereum": "0x6c5fbc90e4d78f70cc5025db005b39b03914fc0c",
        "binance-smart-chain": "0x33a46b5b71f4689ff290da93e08972917a5e6634"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "What is Urus?\r\n\r\nUrus is a De-Fi token powering Aurox, a unique crypto trading terminal used by thousands of traders worldwide. \r\n\r\nAurox's goal is to massively simplify crypto trading and help all crypto traders make trading decisions with more confidence. \r\n\r\nTo achieve this mission, Aurox team created proprietary alerts and indicators (including  accurate buy and sell signals) and innovative lending and trading protocols.\r\n\r\nUrus token helps Aurox users in multiple ways:\r\n\r\nTokens can be staked in order to access Aurox’s proprietary alerts and indicators, which help both new and experienced crypto traders in their trading decisions; \r\n\r\nTokens will also power Autox lend and Aurox trade protocols, two easy-to-use lending and trading Aurox features.\r\n\r\n\r\nWhat is Aurox Lend/Trade?\r\n\r\nAurox Lend is a DeFi protocol that allows a lender to earn one of the highest annual percentage yields on the market, while keeping their ability to withdraw at any time.\r\n\r\nAurox trade allows you to borrow directly from Aurox lend and trade without having to transfer funds to an outside exchange. \r\n\r\nAlso, Aurox Trade aggregates order books from multiple exchanges and places orders on the lowest price one.  This allows Aurox Trade to deliver the deepest order book and highest liquidity.\r\n\r\nWith virtually no marketing, influencer partnership or funding, URUS' price soared days after its launch, after the community tested the potential of Aurox.  \r\n\r\n\r\n\r\nAbout the team:\r\nAurox founders are experienced entrepreneurs who generated 7-figures in revenue in their previous online businesses.\r\nThey saw the potential of crypto trading and self-funded Aurox to welcome everybody to profitable crypto trading.\r\nWhen building Aurox, they used no venture capital, no loans, and in the case of the Urus token, no pre-sales. \r\nWith Aurox, the token holders will feel safe, knowing the token has not been manipulated. \r\nIf anything, the token economic structure was designed to make sure that not even the team can dump the tokens on the general public. \r\n\r\nHow can you buy Urus?\r\nYou can get Urus from Uniswap, Pancake Swap, Bilaxy and Aurox.\r\n\r\nHow much URUS is in circulation?\r\n\r\nThere are 1 million tokens in circulation.\r\n\r\nWhat makes URUS different?\r\n\r\nURUS has some distinct advantages that will appeal to investors as soon as the word spreads out:\r\n\r\nIt powers a unique and useful product that makes crypto trading easier and more accessible for more people; \r\nHelps new investors join the crypto ecosystem that’s still in its infancy, which means that more and more people will join Aurox and Urus as the crypto space matures;\r\nFounded and ran by solid team of entrepreneurs with impressive track-records in digital businesses;\r\nWith only 1m tokens in circulation, URUS is bound to have less fluctuation that most coins;\r\nHas an active community of holders, retail investors and Aurox users.\r\n\r\n\r\n\r\nThousands of users currently utilize the Aurox platform and its innovative features. With the help of its token, the team’s goal is to both simplify and improve the crypto trading world.\r\n"
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x6c5fbc90e4d78f70cc5025db005b39b03914fc0c",
    "url": "https://getaurox.com/",
    "explorers": [
        "https://etherscan.io/token/0x6c5fbc90e4d78f70cc5025db005b39b03914fc0c",
        "https://ethplorer.io/address/0x6c5fbc90e4d78f70cc5025db005b39b03914fc0c",
        "https://bscscan.com/token/0x33a46b5b71f4689ff290da93e08972917a5e6634"
    ],
    "twitter": "getaurox",
    "telegram": "getaurox"
}