{
    "id": "kintaman",
    "symbol": "kinta",
    "name": "Kintaman",
    "platforms": {
        "binance-smart-chain": "0x0c16eb01908aa99c78a62f9e1732c1927c2dfb25"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "\"One of the problems that need to be solved around the world is the support for children.\r\nThis project was created to help solve this problem.\r\nThrough the KINTA Project, we aim to create a platform where anyone can quickly and safely support those in need around the world.\r\n\r\nThe KINTA project will be developed through fairy tales, DEX, wallets, NFT platforms, and blockchain games.\r\nThe world will be filled with excitement and many people will agree.\r\nInformation will be updated as it becomes available.\r\n\r\nKINTA tokens will be generated by Binance Smart Chain.\r\n\r\nWhy introduce BSC to KINTA?\r\nBinance Smart Chain's impressive growth and the activity of its huge user base are fertile ground for KINTA's interest.\r\nKINTA is keen to make the most of this network and the key features of BSC are as follows\r\nThe main factors that make BSC a natural port of call for KINTA are as follows\r\n\r\nSpeed and fare\r\nThe main reason for BSC's rapid growth is its relatively low fees and fast transaction speed compared to Ethereum.\r\nCompared to Ethereum, KINTA wants to know how metrics such as transaction fees, speed, and network security affect users' decisions.\r\n KINTA wants to know how metrics such as transaction fees, speed, and network security affect the decisions of users around the world. Our goal is to help teams build better products and serve their customers, while ensuring that the users who provide the data needed to build those products are not left out of the benefits that come from user behavior markets.\r\n\r\nRoadmap\r\n\r\n1. go public October 1, 2021 Ape Swap & Pancake Swap complete. 2.\r\n2. original DEX \"\"ONIGASHIMA Swap\"\" to be launched in February 2022. 3. original wallet \"\"KINTEX\"\" to be launched in February 2022.\r\n3. original wallet \"\"KINTAMASK\"\" scheduled to launch in April 2022. 4.\r\n4. monthly donation. 5.\r\n5. launch NFT marketplace \"\"KAGU ○○\"\".\r\n6. listing on the world's central exchange, scheduled for June 2022."
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x0c16eb01908aa99c78a62f9e1732c1927c2dfb25",
    "url": "https://kinta.world",
    "explorers": [
        "https://bscscan.com/token/0x0c16eb01908aa99c78a62f9e1732c1927c2dfb25"
    ],
    "twitter": "KINTAMANTOKEN",
    "reddit": "kintaman/"
}