{
    "id": "kishu-inu",
    "symbol": "kishu",
    "name": "Kishu Inu",
    "platforms": {
        "ethereum": "0xa2b4c0af19cc16a6cfacce81f192b024d625817d",
        "fantom": "0x97513e975a7fa9072c72c92d8000b0db90b163c5",
        "harmony-shard-0": "0x147e4bc895dc5995be2c8523a3ed6ff708beaec3"
    },
    "hashing_algorithm": null,
    "categories": [
        "Meme Tokens"
    ],
    "description": {
        "en": "KISHU INU was created in April 2021 with the goal of being a decentralized meme project with true purpose.\r\nKISHU’s mission is to bring popular cryptocurrency concepts to the mainstream. Unlike older, comparable projects, KISHU introduces holders to next-gen concepts such as frictionless yield, NFTs, decentralized exchanges, and more.\r\nWithin the first month of its launch, KISHU made history by surpassing a $2 billion market cap and over 100,000 holders. This was an unprecedented milestone for a project of its kind, and proved the world’s belief in the project.\r\n\r\nKISHU’s list of products includes...\r\n\r\n$KISHU TOKEN\r\nERC20 token that features a 2% redistribution fee to holders, so every time a transaction occurs, existing holders earn more $KISHU automagically.\r\n\r\nKISHU SWAP\r\nDecentralized exchange that features custom functionality and allows holders to trade any\r\nERC20 token for another. \r\n\r\nKISHU CRATE\r\nNFT Marketplace where users can stake Kishu to earn NFTs, we feature artists from community contests and those artists earn a portion of staking fees\r\n\r\nKISHU PAW PRINT\r\nWallet tracker where users can track their passive income earned through $KISHU, token\r\nprices, wallet balance, and more. \r\n\r\nKISHU sWAG\r\nMerchandise store to allow KISHU holders to proudly promote KISHU in the real world, with all proceeds supporting KISHU’s growth."
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0xa2b4c0af19cc16a6cfacce81f192b024d625817d",
    "url": "https://kishu.com/",
    "explorers": [
        "https://etherscan.io/token/0xA2b4C0Af19cC16a6CfAcCe81F192B024d625817D",
        "https://ethplorer.io/address/0xA2b4C0Af19cC16a6CfAcCe81F192B024d625817D"
    ],
    "twitter": "InuKishu",
    "telegram": "KishuInuCommunity",
    "reddit": "KishuInu/"
}