{
    "id": "kodi",
    "symbol": "kodi",
    "name": "KODI",
    "platforms": {
        "binance-smart-chain": "0x7f4f3bc4a5634454398580b9112b7e493e2129fa"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "KODI is bringing the entertainment industry to crypto, featuring live podcasts, 24/7 hour voice chat and their marketing agency Pitch\r\n\r\nThe fundamentals behind KODI are simple: By holding your tokens, you will earn BNB which will be deposited directly into your crypto wallet. Kodi holders will also benefit from reflections in $KODI off the Pitch agency revenue.\r\nA great indicator of longevity and growth goes beyond a cryptocurrency’s tokenomics. While the reflections earned by holding a currency is appealing to investors, there needs to exist some form of utility to avoid stagnancy. Kodi answers this in the form of bringing the first ever Advertisement Agency to the BSC Network. On top of this, they will be launching their BETA version Entertainment Network which will operate as an outlet to promote their marketing clients through.\r\n\r\nThe Advertisement Agency will be a subsidiary company of Kodi, operating under the brand name ‘Pitch’. In its infancy, the focus will be on catering to crypto projects both inside and outside the BSC space. The Pitch Agency is a one-stop-shop for all of your project’s marketing needs. With a tailored campaign designed around your key message, their team will help to deliver a unique marketing plan. They create both voice and video commercials, as well advertisements and banners, entirely in-house. Through their vast connections in the crypto space, they will also function as a middle-man to a variety of influencers and promotional services."
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x7f4f3bc4a5634454398580b9112b7e493e2129fa",
    "url": "https://kodicoin.com/",
    "explorers": [
        "https://bscscan.com/token/0x7f4f3bc4a5634454398580b9112b7e493e2129fa"
    ],
    "twitter": "Kodi_coin",
    "telegram": "kodicoinofficial",
    "github_org": "MaverickHP"
}