{
    "id": "kuende",
    "symbol": "kue",
    "name": "Kuende",
    "platforms": {
        "ethereum": "0xdf1338fbafe7af1789151627b886781ba556ef9a"
    },
    "hashing_algorithm": null,
    "categories": [
        "Non-Fungible Tokens (NFT)"
    ],
    "description": {
        "en": "What Is Kuende (KUE)?\r\n\r\nKuende - The Global Home For Creative Communities - is a Modern Content & Entertainment Company (MCEC) that is disrupting, challenging and transforming the social media status-quo. Kuende is a Swiss-Singaporean company, focused on developing D2C and B2C products, empowered by blockchain technology.\r\n\r\nThrough the products they have already built and those currently under development, Kuende acts like a launchpad for nano/micro-influencers and creative minds, nurturing them from zero-to-hero, and guiding them to grow and monetize throughout all of their journey.\r\n\r\nKuende's business model and product design are wrapped around the unique use cases of their digital assets, the Kuende Tokens (KUE) and NFTs.\r\n\r\nIn a nutshell, Kuende challenges their community - influencers, consumers, and brands - to create quality content together, generate new revenue streams in the process, while progressively integrating blockchain solutions into their products.\r\n\r\nCurrently the Kuende Token (KUE) is an ERC-20 token, but the company is exploring other chains or layer-2 solutions that serve as best fit for their use cases.\r\n\r\nWho Are the Founders of Kuende?\r\n\r\nKuende’s journey started in 2013 with Pavel Antohe, a former professional gamer, an experienced Entrepreneur and an Alumnus of Blackbox.org (a Google-backed Startup Incubator). He is best known as the founder of Kuende and for kick-starting innovation and leading teams of talented people. Blockchain technology became his main focus in 2017, as he fully dedicated his time to transition the company from the traditional business methodologies and beliefs, towards the tokenized, decentralized and digital era. \r\nKuende has a well-glued and experienced co-founding team, with former Google software engineers with extensive experience in designing backend infrastructures, blockchain developers and NFT creators, working together and creating products for several years.\r\n\r\nWhat Makes Kuende Unique?\r\n\r\nKuende’s story goes a long way. What stands out is their unique approach to place the content creator’s needs at the forefront and design all of their products as means of empowering and supporting the creative minds in their community.\r\n\r\nGamification plays a major role in the company’s philosophy, therefore the creators’ journey and experience is highly tied up to it. A new system needs new levels: the challenge with today's social media system is that there are no defined levels to ascend to, so everyone wants infinitely more. Kuende’s products have levels. Users have to ascend by doing and through their creative powers. They stand to make more when they do and they get to be in a smaller inner circle of their interests. Their path is from the outer to the inner circle of the community. Kuende can set actions content creators need to complete to move to the next level.\r\n\r\nBranded digital goods, influencer’s tokens, unique use cases for NFTs or content ownership, are just some of the benefits and features that the Kuende products bring to the table.\r\n"
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0xdf1338fbafe7af1789151627b886781ba556ef9a",
    "url": "https://ico.kuende.com/",
    "explorers": [
        "https://etherscan.io/token/0xdf1338fbafe7af1789151627b886781ba556ef9a",
        "https://ethplorer.io/address/0xdf1338fbafe7af1789151627b886781ba556ef9a"
    ],
    "twitter": "KuendeOfficial",
    "facebook": "Kuende.world",
    "telegram": "kuende",
    "reddit": "kuende/",
    "github_org": "kuende"
}