{
    "id": "hacash",
    "symbol": "hac",
    "name": "Hacash",
    "platforms": {},
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "A fully designed, completely fair, open and shared standard system for the issuance and circulation of cryptocurrency for modern financial transaction settlement, business and personal payment will jointly promote mankind to enter the era of open finance in this century, and help complete the transformation of human currency to cryptocurrency.\r\n\r\nHacash believes that although Bitcoin is revolutionary, it is not perfect, especially its \"Monetary Nature\" aspect has a very large shortcomings. Hacash’s mission is not to subvert and replace Bitcoin technically, but to learn from Bitcoin’s \"blockchain\" and \"computing power issuance currency\" technology, using the \"Austrian Monetary Economics Theory\" as the guiding ideology, focusing on expansion , Improve and complete the system's \"Monetary Nature\" indicators, including BTC to form a complete currency system, and combined with the channel chain settlement network, to promote the large-scale circulation and real-time settlement of encrypted currencies in real personal and commercial payments.\r\n\r\nHacash's \"Monetary Nature\" is reflected in: 1. The most fair and market-oriented currency issuance mechanism; 2. Three different energy levels and heterogeneous commodity currencies: Diamond, BTC(transferred), HAC; 3. Channel chain settlement Real-time settlement of large-scale payments through the network; 4. Rich and risk-free conditional payment agreements and multi-party signing contracts to adapt to modern commercial payment circulation; 5. Optional features such as privacy protection, anti-calculation power attacks, and flexible third-party financial services.\r\n\r\nIf Bitcoin is compared to the original and revolutionary C language in the field of programming languages, then Hacash's mission is to become C++."
    },
    "country_origin": "CN",
    "genesis_date": null,
    "url": "https://hacash.org/",
    "explorers": [
        "http://explorer.hacash.org"
    ],
    "twitter": "HacashWorld",
    "telegram": "hacash",
    "reddit": "hacash",
    "github_org": "hacash"
}