{
    "id": "haven",
    "symbol": "xhv",
    "name": "Haven",
    "platforms": {},
    "hashing_algorithm": "Cryptonight",
    "categories": [
        "Privacy Coins"
    ],
    "description": {
        "en": "Haven is an untraceable cryptocurrency with a mix of standard market pricing and stable fiat value storage without an unsustainable peg or asset backing. It achieves this with a built in on-chain smart contract that controls the minting and burning of coins in a network of cryptographically unknown supply to facilitate value for users that choose to send their coins to offshore storage contracts while allowing everyone else to be exposed to the natural price movements of the currency.\r\n\r\nOffshore Storage\r\n\r\nOffshore Storage is Haven's built in smart contract/protocol that powers the stable value storage. In short, sending Haven to offshore storage (burning) records a reference on the blockchain to the current fiat value which can be restored later back into Haven by minting new coins to the tune of the current fiat value.\r\n\r\nThe key use cases for offshore contracts are:\r\n\r\nPoint of sales/payment gateway systems where goods can be bought with Haven and stores can immediately lock the fiat value in to protect from price fluctuations. This has the added benefit of keeping the stores business and income completely hidden on the blockchain as neither their wallet address or amounts are revealed.\r\n\r\nStoring large amount of money outside of the traditional banking system. Privacy focused cryptos are perfect for this but without a reliable way to maintain value through fluctuations the process of holding could be costly. Sending Haven offshore quite literally, makes money disappear until you want it back at which point the value remains intact.\r\n\r\nUntraceable | Hidden | Decentralized\r\n\r\nHaven uses ring signatures, ring confidential transactions and stealth addresses meaning payments cannot be tracked or linked back to any user.\r\nWallet addresses and transaction amounts are completely obfuscated on the Haven blockchain making all activity invisible.\r\nThe Haven Protocol is decentralized and open source meaning no central control over the network. Nothing is censored."
    },
    "country_origin": "",
    "genesis_date": null,
    "url": "https://havenprotocol.org/",
    "explorers": [
        "https://explorer.havenprotocol.org/"
    ],
    "twitter": "HavenXHV",
    "reddit": "havenprotocol/",
    "github_org": "haven-protocol-org"
}