{
    "id": "hbtc-token",
    "symbol": "hbc",
    "name": "HBTC Captain Token",
    "platforms": {},
    "hashing_algorithm": null,
    "categories": [
        "Centralized Exchange Token (CEX)",
        "Exchange-based Tokens"
    ],
    "description": {
        "en": "HBC token is the native token of HBTC Chain and is a full tokenized innovative platform token introduced by HBTC Exchange. HBC token carries the key interests of the three core businesses of Bluehelix Group, which include HBTC Exchange, HBTC Chain, and Bluehelix Cloud SaaS and white label solutions. With new HBTC Captain scheme and 100% quaterly profits buyback-to-burn mechanism, HBC 2.0 has made a difference and now entering a brand new stage.\r\n\r\n\r\n\"Token name: HBTC Captain Token\r\n\r\nToken Symbol: HBC\r\n\r\nHBC token is the native token of BHEX Chain and is a full tokenized innovative platform token introduced by BHEX Exchange. HBC token carries the key interests of the three core businesses of Bluehelix Group, which include BHEX Exchange, BHEX Chain, and Bluehelix Cloud SaaS and white label solutions.\r\n\r\nBHEX will use 100% of its quarterly business income for quarterly buyback of HBC, which 80% will be burnt while the rest 20% will be locked and distributed to the Captain’s reward account, which will be unlocked according to Captain’s daily performance.\r\n\r\nUsers who hold more than 500 HBC will automatically qualify to become a BHEX Captain. BHEX Captain is a partner, contributor and community leader to BHEX Exchange.\r\n\r\nA BHEX Captain is an indispensable and important member of the BHEX Exchange. A BHEX Captain helps to spread information and know-how to new users to help them understand the mechanism supporting the performance of BHEX and the impact this has on the value of the trading on BHEX Exchange.\r\n\r\nA BHEX Captain also acts as a mentor to help users solve any problems they may encounter when using BHEX Exchange for various types of trading needs.\r\n\r\nA BHEX Captain is ever ready to convey the vision and the mission of BHEX Exchange in the spirit of an evangelist hoping ultimately to increase the value and benefits of HBC tokens.\""
    },
    "country_origin": "",
    "genesis_date": null,
    "url": "https://www.bhex.com/en-us/",
    "explorers": [
        "https://hbtcchain.io/"
    ],
    "twitter": "BHEXOfficial",
    "telegram": "BHEXOfficial"
}