{
    "id": "hellfire",
    "symbol": "hfire",
    "name": "HellFire",
    "platforms": {
        "binance-smart-chain": "0x438fe2d54937bc2af6811f3b310ab5d9f1be8c63"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "What makes HellFire a different beast is its novel tokenomic structure.\r\nFew alchemists have darted procure such flawless chemistry, and even fewer have succeeded.HellFire is hyper-deflationary by nature, thanks to the 12% Barter Fee applied to every transaction. Buyback and burns rage right across Binance Smart Chain as of now, but the likes of The HellFire Function has never been witnessed in all its glory. Because of HellFire's tokenomics, 5.5% of EVERY transaction will be burned, while also allowing for perma upward pressure from our HellFire Buybacks to annihilate dips. HellFire's unique mechanics allow for manual buybacks at any time and any amount - this means it is impossible for Bots to force buybacks and artificially cause extreme price wicks to form.\r\nThrough The HellFire Function, the buybacks will create a meaningful price floor and paint the chart ablaze with green. These buybacks, combined with a constantly shrinking token supply will reward holders for holding, as the percentage of total supply you hold will grow relative to the burns.\r\nUnlike other protocols that burn tokens from outside of the liquidity pool, the buyback and burn feature of HellFire pulls tokens directly from the liquidity pool, increasing price through purchasing power, and increasing price through scarcity from burning.\r\nThis isn't just a Binance Smart Chain project.This is HELLFIRE!"
    },
    "country_origin": "TR",
    "genesis_date": null,
    "contract_address": "0x438fe2d54937bc2af6811f3b310ab5d9f1be8c63",
    "url": "https://hellfire.global/",
    "explorers": [
        "https://bscscan.com/token/0x438fe2D54937bC2Af6811f3b310Ab5D9F1BE8c63"
    ],
    "twitter": "h3llf1re666",
    "telegram": "HELLFIREBSC",
    "github_org": "balrogsbeastmaster"
}