{
    "id": "homihelp",
    "symbol": "homi",
    "name": "HOMIHELP",
    "platforms": {
        "ethereum": "0xca208bfd69ae6d2667f1fcbe681bae12767c0078"
    },
    "hashing_algorithm": null,
    "categories": [
        "Technology & Science"
    ],
    "description": {
        "en": "What is HOMIHELP?\r\nHomihelp is an ecosystem of softwares, desktop apps, dapps and other daily utility online services in which HOMI Token is used as a payment method.  Homihelp aims to make cryptocurrency more accessible through Homihelp marketplace which will connect every software and other service with users who wants to pay in cryptocurrency. HOMI Token can be used to make payment for daily need softwares and services which are developed by Homihelp team and some 3rd party softwares (or their subscription) can be paid through HOMI Token which are added in HOMIHELP ecosystem. Homihelp claims to have a team of professionals with experience in blockchain, cybersecurity and artificial intelligence. Homihelp already launched the beta of a Live Chat web-based software. \r\n\r\n\r\nWhat does HOMIHELP intend to solve through tokenization?\r\nHomihelp is trying to solve the adoption problem by giving users and businesses fully centralized and decentralised services and business tools, while adding cryptocurrency as a payment model. Homihelp marketplace will connect every software and other service with users who want to pay in cryptocurrency.\r\n\r\n\r\nAbout HOMI Token\r\nHOMI is the utility token used in Homihelp ecosystem. It has a range of purposes, including paying to buy Homihelp ecosystem’s tools and software, 3rd party software Subscription Plans and Booster top-ups, Participating in Holding program and affiliate (Partner) Program Reward, Staking rewards, givebacks, loyalty rewards, activating discounts and several other use case.\r\n\r\nOn 12 Apr 2020, Homihelp verified and released its smart contract on the Ethereum blockchain as an ERC20 token. Businesses/Clients have reportedly been using 'HOMI TOKENS' as Homi Services for Premium Subscriptions.\r\n"
    },
    "country_origin": "IN",
    "genesis_date": null,
    "contract_address": "0xca208bfd69ae6d2667f1fcbe681bae12767c0078",
    "url": "https://www.homihelp.com",
    "explorers": [
        "https://etherscan.io/token/0xCa208BfD69ae6D2667f1FCbE681BAe12767c0078",
        "https://ethplorer.io/address/0xCa208BfD69ae6D2667f1FCbE681BAe12767c0078"
    ],
    "twitter": "homihelp",
    "facebook": "homihelp",
    "telegram": "official_homihelp",
    "github_org": "homihelp"
}