{
    "id": "hora",
    "symbol": "hora",
    "name": "HORA Token",
    "platforms": {
        "tron": "TNjt5fShPVJ4YpsLuU4THuBbg58g2bZoLk"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "What is HORA Token?\r\nWhen we came to an idea to create Crypto Idle Miner video game and started the first concept of it, it was only natural to implement our own cryptocurrency in order to provide you maximum feel of blockchain world simulation. So, we did just that!\r\n\r\nHORA Token will be a brand new and unique type of cryptocurrency on the market, which will be built on the TRC20 system on the Tron network.\r\nOfficial release of HORA Token can be expected with the beta release of the game, meaning that those two will be released simultaneously, side-by-side on the market. Now you are probably wondering how you can earn them and for what they can be used? In order to earn them, you’ll need to play the game and make your progress within the game. You’ll be able to earn resources in our Crypto Idle Miner video game that will redeemable for HORA Tokens.\r\nAnother way of earning HORA Tokens is with our referral system, by bringing new people to our game(s). And yes, HORA Tokens will be the main currency of all our future game titles as well!\r\n\r\nAs any other cryptocurrency, HORA Token will be available for trading on the market, so we would like to encourage you to take an early start and participate in this! But, have no fear, everything will be explained clearly when the right time comes (right before beta release of the Crypto Idle Miner).\r\nOh yeah, did we mention that we will reward our beta testers with certain amount of HORA Tokens? This is our way to say thank you for your hard work! Hopefully, together we can scale everything up and create the new hottest thing in blockchain world!"
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "TNjt5fShPVJ4YpsLuU4THuBbg58g2bZoLk",
    "url": "https://cryptoidleminer.com/",
    "explorers": [
        "https://tronscan.org/#/token20/TNjt5fShPVJ4YpsLuU4THuBbg58g2bZoLk"
    ],
    "twitter": "cryptoidleminer",
    "facebook": "cryptoidleminergame",
    "reddit": "CryptoIdleMiner/"
}