{
    "id": "xp",
    "symbol": "xp",
    "name": "XP",
    "platforms": {},
    "hashing_algorithm": "SHA-256",
    "categories": [],
    "description": {
        "en": "Experience Points, as its mission suggests, it wants to bring XP off the screen and into your daily routine. The project is building a sharing economy for all aspects of life, anything from daily purchases to tourism, all driven by the XP coin.  With Experience points, distribution is limited only to adoption and acceptance; if an industry or service adopts the project’s model, you can earn XP coin for your everyday experiences.\r\n\r\nExperience Points (XP) is a completely independent, platform agnostic incentive rewards token and digital currency combined enabling you to earn XP through video games, activities, sports, education and conservation which you can then spend at participating vendors either online, in-game, or on the high street (cryptocurrency exchanges). The concept of real value rewards merged with the blockchain technology of <a href=\"https://www.coingecko.com/en/coins/bitcoin\">Bitcoin</a> provides an innovative approach to in-game currencies moving towards a unified platform, similar to the standards applied to mobile phone charges, for example.\r\n\r\nThis approach keeps the digital currency completely independent from any bank, central authority, government or corporation but at the same time allowing them all to collaborate and submit proposals, open source code, documentation and content that benefits other participants and parties in the network.\r\n\r\nHowever, the Experience Points team wants to take this model and superimpose it on to real life interactions and transactions.  Basically, consumers and community members can be rewarded in XP for interacting with a service or entity that has adopted the Experience Points platform, such as attending a concert or buying a meal at a restaurant that uses XP.  Users can then spend their XP at participating locations, allowing them to take the experience they’ve gain and put it back into the XP-based economy.\r\n\r\nIn its current stage of development, Experience Points is more geared towards online gaming platforms and services.  Its upcoming development kit will make it easier for developers to integrate the coin into their games for in-game rewards and purchases, as well as giving users a coin to develop a player-driven economy.\r\n\r\nAdopting this token for gaming purposes is one thing, but seeing XP in real world use is another.  A cool concept? Maybe, even if a little bit quirky.  Quixotic to think that the concept will become a reality? Potentially, but it all depends on whether or not some retailers, businesses, and industries see value in using a model like XP to incentivize business.  If they do, and a few get the ball rolling, who knows how far it will go (and who/what it will pick up along the way)."
    },
    "country_origin": "",
    "genesis_date": "2016-08-24",
    "url": "https://www.experiencepoints.io/",
    "explorers": [
        "https://chainz.cryptoid.info/xp/"
    ],
    "twitter": "theBigXP",
    "facebook": "Experience-Points-166962727311331",
    "telegram": "XPcoin0fficial",
    "reddit": "TheBigXP",
    "github_org": "experience-points-development"
}