{
    "id": "xre-global",
    "symbol": "xre",
    "name": "XRE Global",
    "platforms": {
        "tron": ""
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "XRE is a blockchain project that is developing the technology to create faster real estate transactions through the digital registration of NFT deeds on the blockchain using smart contracts and cryptocurrency. XRE global is connecting these three industries of finance, real estate and blockchain to allow buying and selling of properties globally. XRE will register all registered and unregistered properties as an NFT (non fungible token) XRE Global is bringing the estimated 50 trillion dollar non existent sector of unregistered properties to our platform, by using the XRE technology. An all in one platform for all properties is being created for the public, agents, investors and governments to buy, sell, finance, manage rental properties and more. Each property that is placed on the website will agree to be NFT by XRE Global. XRE Global is implementing the blockchain technology of what is said to be the greatest technological advancement in real estate history.\r\n\r\nThe lack of technology for the finance industry globally limits the ability to finance sustainable housing in parts of the world , XREfi will grow to make an impact on the world economy creating a better life for those in undeveloped countries. \r\nPurchase a house or pay for rent with the XRE token on XREfi (defi / decentralized finance) platform. The world of finance is changing and it’s changing with XRE Global. \r\n\r\nXRE is simply taking the current everyday operations of finance, real estate and implementing blockchain, smart contract and crypto. XRE is creating the technology to make transactions instant,  rather than days, weeks or months as is the case with residential and commercial real estate deals. XRE Global has the potential to touch every home in the world, making XRE real estate token the biggest use case the blockchain world has ever seen. The XRE token does not depend on the success of XRE global or other entities, XRE is a utility token used for payments and for fees for our future blockchain that is building the technology to power XRE Global and all other companies that choose to be a part of a better tomorrow. "
    },
    "country_origin": "US",
    "genesis_date": null,
    "url": "https://xreglobal.com/",
    "explorers": [
        "https://tronscan.org/#/token/1003593"
    ],
    "twitter": "xrefoundation",
    "facebook": "xreglobal",
    "telegram": "xreglobal",
    "github_org": "xreglobal"
}