{
    "id": "ycash",
    "symbol": "yec",
    "name": "Ycash",
    "platforms": {},
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Ycash is a digital currency, like Bitcoin or Zcash.\r\n\r\nIn fact, the software for Ycash is based on the software for Zcash, which in turn is based the software for Bitcoin.\r\n\r\nLike Bitcoin and Zcash, the total supply of Ycash is forever capped a 21 million coins. So, unlike government-issued paper cash, you never have to worry about inflation devaluing your Ycash.\r\n\r\nYcash also shares something else in common with Zcash: shared blockchain history. The first 570,000 blocks of the Ycash blockchain are the same as the first 570,000 blocks of the Zcash blockchain. That means that everyone in control of Zcash private keys as of block height 570,000 (around July 18, 2019) will be able to use those private keys to access the same amount of Ycash. So, those that currently have a vested interest in the future of Zcash (by holding Zcash) automatically have a vested interest in the future of Ycash.\r\n\r\nBitcoin is truly revolutionary, but it suffers from several problems, including the following two key problems:\r\n\r\nThe Privacy Problem. Bitcoin lacks privacy. The whole world can see all of your transactions.\r\n\r\nThe Distribution Problem. The ongoing initial distribution of bitcoin (via \"mining\") is dominated by manufacturers of specialized computer hardware and their business partners.\r\n\r\nZcash improved upon Bitcoin by implementing a revolutionary solution to The Privacy Problem. But The Distribution Problem remains.\r\n\r\nBy building upon the Zcash codebase, Ycash leverages Zcash's solution to The Privacy Problem. And by aggressively pursuing mining on commodity hardware by all available means, including periodic changes to Ycash's mining algorithm, Ycash aims to address The Distribution Problem.\r\n\r\nWe believe that addressing The Distribution Problem is necessary for a digital currency to achieve widespread, grassroots adoption. As one engineer working on Ycash put it, if the mining process is largely controlled by specialized hardware created by a far-off foreign manufacturer, the coin seems \"distant\". Mining is an important way for users to participate in a digital currency's community, and mining on commodity hardware opens up the mining process up to a much larger group of users.\r\n\r\nAnother key component of Ycash's approach to addressing The Distribution Problem is upholding a promise that originated from Zcash: that 90% of the coins would be distributed via the mining process. The structure of the Ycash Development Fund upholds that promise: With 5% of the coins starting at block height 570,000 going to the Ycash Development Fund (managed by the nonprofit Ycash Foundation), 90% of the total 21 million Ycash coins will be allocated via the free market mining process.\r\n\r\nBut there are several other coins that also build upon the Zcash codebase and are also trying to address The Distribution Problem; what makes Ycash different?\r\n\r\nThe answer goes back to Ycash's shared blockchain history with Zcash. Ycash is the only coin that is also a chain fork of Zcash. So, not only does Ycash build upon the codebase of Zcash like many other coins, it also uniquely builds upon Zcash's blockchain too. Therefore, the Zcash community, including the world-class engineers and cryptographers at the Electric Coin Company, have a vested interest in Ycash's success (to the extent that those individuals hold Zcash at the time of the Zcash/Ycash split).\r\n\r\nYcash is standing on the shoulders of two giants: Bitcoin and Zcash. We will aggressively compete with both (and all other digital currencies) for user and merchant adoption."
    },
    "country_origin": "",
    "genesis_date": null,
    "url": "https://y.cash/",
    "explorers": [
        "https://yecblockexplorer.com/",
        "https://yec.safe.trade/"
    ],
    "twitter": "YcashFoundation",
    "reddit": "ycashtalk/",
    "github_org": "YcashFoundation"
}