{
    "id": "welltrado",
    "symbol": "wtl",
    "name": "Welltrado",
    "platforms": {
        "ethereum": "0x9a0587eae7ef64b2b38a10442a44cfa43edd7d2a"
    },
    "hashing_algorithm": null,
    "categories": [
        "Finance / Banking"
    ],
    "description": {
        "en": "Crypto is extremely volatile. Investors are often victims of currency manipulation, with few options to spread their portfolio into more stable assets. Welltrado tackles the problem by connecting 4500+ p2p investment platforms into a single network, making over 1 million existing investments available to the Crypto Community.\r\n\r\nP2P investment market is currently experiencing explosive growth. The global market volume reached $114 billion in 2017, with no sign of slowing down.\r\n\r\nHowever, this expansive growth has presented three major problems:\r\n1. Difficulties in diversifying and managing investments.\r\n2. Issues with transparency and reputation.\r\n3.Problems with the mobility of cryptocurrency and assets across borders.\r\n\r\nWe propose three solutions to them:\r\n1. Cross platform loan aggregator with ratings and blockchain.\r\n2. Crypto P2P fund for global and cross-border participants.\r\n3. Portfolio management of loans across platforms in a single dashboard.\r\n\r\nWe believe that this toolbox of solutions is a win for all. The Crypto Community will gain unprecedented access to a decentralized and stable asset class. The large risk-averse institutional investors will get a method to trade the high volumes they seek. The retail investors will benefit of a large amount of assets formerly inaccessible to them."
    },
    "country_origin": "LT",
    "genesis_date": null,
    "contract_address": "0x9a0587eae7ef64b2b38a10442a44cfa43edd7d2a",
    "url": "https://welltrado.io/",
    "explorers": [
        "https://etherscan.io/token/0x9a0587eae7ef64b2b38a10442a44cfa43edd7d2a",
        "https://ethplorer.io/address/0x9a0587eae7ef64b2b38a10442a44cfa43edd7d2a"
    ],
    "twitter": "welltrado",
    "facebook": "Welltrado",
    "telegram": "welltrado",
    "reddit": "welltrado/",
    "github_org": "cryptodus"
}