{
    "id": "wild-ride",
    "symbol": "wild",
    "name": "Wild Ride",
    "platforms": {
        "binance-smart-chain": "0x4f0e7a273c7ff13062fa581bee4ffabdae94328f"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Wild Ride is a project driven and supported by its community. We are committed to building trustful and transparent relationships with all our members.\t\t\r\nIf you’re tired of incompetent developers and look for a community led by a safe, transparent and responsive team, you’re in the right place. We have everything on the right track.\t\t\r\nWild Ride is a token for people, by people.\r\n\t\t\r\nWe are dedicated to developing a multifunctional ecosystem that brings together advertisers and promoters. Everyone who has ever encountered advertising in the blockchain space, knows how difficult it is to find a responsible promoter with respect to their work as well as an advertiser with whom you could face commercial fraud. Our platform will solve this problem once and for all. In addition to that, we will be the first of its kind providing tools for safe and efficient work for both promoters and advertisers.\r\n\t\t\r\nWILD will be gently embedded into the internal architecture of the entire system providing token holders with stable growth which will ensure acceptance in the blockchain world.\t\t\r\nWild Ride is a project aimed at providing a frictionless platform where things are carried out in the most effortless manner. Everything is automatic and simple for every individual to know the token at a glance. Aside from reflection and DeFi mechanics, our goal is to take Wild Ride to the next level with such additions such as unique ecosystem and staking.\t\t\r\nOur strong point is marketing. We have planned a massive marketing strategy for the next month, so you can be sure that our project will not be left without attention."
    },
    "country_origin": "RU",
    "genesis_date": null,
    "contract_address": "0x4f0e7a273c7ff13062fa581bee4ffabdae94328f",
    "url": "https://www.wildride.club/",
    "explorers": [
        "https://bscscan.com/token/0x4f0e7a273c7ff13062fa581bee4ffabdae94328f"
    ],
    "twitter": "wridebsc",
    "facebook": "wridebsc",
    "telegram": "wildridebsc",
    "reddit": "wridebsc/",
    "github_org": "wridebsc"
}