{
    "id": "abcd-token",
    "symbol": "abcd",
    "name": "ABCD Token",
    "platforms": {
        "binance-smart-chain": "0x8c3c5e4cec570888f9bab71643f557a6c912e7fb"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "What is ABCD Token?\r\n\r\nCrypto ABCD is an educational platform that was founded to offer online courses for crypto education. Our goal is to spread knowledge and understanding of digital coins and the market they exist in, in an effort to help investors make informed decisions with their investments. We have assembled a roster of experts to help investors of all backgrounds and experience levels in crypto.\r\n\r\n\r\nWho is The Founder of ABCD Token?\r\n\r\nABCD was founded by Mohamad Aftab, who has profound experience in investments & he is a serial entrepreneur. He is the Found/CEO of ABCD Token. ABCD founded in June 2021 in emergency of the growing popularity and adoptions of cryptocurrencies around the world. The founder's purpose is to provide a platform to educate upcoming new crypto enthusiasts. \r\n\r\n\r\nWhat Makes ABCD Token Unique?\r\n\r\nABCD Token is a DeFi BEP-20 token under Binance Smart Chain (BSC) developed to help cryptocurrency investors access courses from the educational platform, CRYPTO ABCD.\r\nIn order to gain access to these courses, users will have to acquire the ABCD Token. These tokens will be the only utility tokens you can use to interact with our platform.\r\n\r\n\r\nHow Many ABCD Token Are There in Circulation?\r\n\r\nThere is a maximum supply of 75 billion ABCD — but at the time of writing, there was a circulating supply of about 65 billion. Two rounds of public sales of ABCD tokens were held between June 4th, 2021, and June 7th, 2021.\r\n\r\nOut of total supply, 8% is allocated for marketing, advisory & promotions of the project and 5% is allocated for the project development. \r\n\r\n\r\nWhat is ABCD's Tokenomics?\r\n\r\nABCD Token use Tokenomics to reward its holders. There is a total of 8% tax on each transaction which is divided into, 3% given back to all holders, 3% added back into liquidity & 2% is allocated for project development.\r\n\r\n\r\n\r\nWhat is Our Project Goal?\r\n\r\nOur mission is to build an online community that can match the growth of cryptocurrency technology. We are thrilled to support cryptocurrency investors and enthusiasts by providing access to skilled experts in the field, and the programs created by them. Our big picture goal is to improve cryptocurrency culture, by providing education and knowledge to every investor in the space.\r\n\r\n\r\nWhat is the utility of Token?\r\n\r\nUsers will also be able to earn ABCD Tokens by interacting with our learning apps & games. We are currently working on this function as part of our program and we will announce its availability once complete.\r\n\r\n\r\nWhat platforms will be provided by ABCD Team?\r\n\r\nWe will provide online courses ranging from the Beginner’s level to the Advanced level on cryptocurrency which anyone can purchase with the use of our ABCD tokens. Users will be able to earn these tokens as well by interacting with our learning apps & playing the fun games that we will be developing in the foreseen future. These tokens will be the only utility tokens to interact with our platform.\r\n\r\n\r\nWhere Can You Buy ABCD Token?\r\n\r\nSince ABCD Tokens are BEP20 Tokens, one must buy BNB (the native coin of the Binance Smart Chain) and trade them at the PancakeSwap."
    },
    "country_origin": "AE",
    "genesis_date": null,
    "contract_address": "0x8c3c5e4cec570888f9bab71643f557a6c912e7fb",
    "url": "https://www.cryptoabcd.com",
    "explorers": [
        "https://bscscan.com/token/0x8c3c5e4cec570888f9bab71643f557a6c912e7fb"
    ],
    "twitter": "ABCD_Token",
    "telegram": "CryptoABCDedu",
    "reddit": "ABCDToken/",
    "github_org": "Crypto-ABCD"
}