{
    "id": "allohash",
    "symbol": "alh",
    "name": "AlloHash",
    "platforms": {
        "ethereum": "0x4c6719bf85903d18c295da44216f862b01b36f43"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "What Is AlloHash ?\r\n\r\nAlloHash is a Centralized application platform that enables users to Send, Receive, Swap ... Cryptocurrencies without Internet Connections. The platform enables users to use SMS or Phone Calls instead of the internet, in order to trade cryptocurrencies. There are no personal or account details that are required.\r\n\r\nThe platform will be of great use to people who would like to carry out an urgent transaction but there is no internet signal. AlloHash also provides its users with a solution for the long confirmation process and the high fees.\r\n\r\nAlloHash is the native utility token that is used for:\r\n\r\nTopup Your virtual phone Balance to Receive & Send Text or make a call via online Apps.\r\nBy virtual Numbers and use it as a Wallet.\r\nFees for processing transactions and storing data.\r\nALH tools include: * Provided virtual phone numbers serve in making the mobile owner receive or Send Coins via calls or texts from all over the world. * Users can pay merchants, buy goods or services, real or virtual, as well as make deposits or send remittances. * AlloHash control panel will provide the users with all the needed tools. The users can track, analyze, check their balance in real-time, and administrate the services and payment methods. * Additionally, viewing statistics and financial data analytics is provided on a convenient AlloHash control panel.\r\n\r\nHow Many AlloHash Tokens Are There in Circulation?\r\n\r\nAlloHash launched its main-net on January 7, 2021, with 180.000.000 tokens created.\r\n\r\n15% of the supply is issued to pay the GSM network fees, of which 5% goes to Supporting Blockchain Project and 40% to the Network Growth Marketing Strategies. 35% Engineers and R&D, 5%Overhead Token Distribution .\r\n\r\nWho Are the Founders of AlloHash?\r\n\r\nIyes Safari the Co-founder of and the Project Manager and involved in the planning of the entire project of features and functionalities. Isra Cherif responsible for the investment models and the development strategies of the project and the prospectus of the forecast and performance of the Capital and its Variations as well as the Issues, redemptions of the coins, and finally the Calculation of the net asset value compared to the analysis of the Quotation in the crypto-asset market\r\n\r\nWhere Can I Buy AlloHash (ALH)?\r\n\r\nhttps://info.uniswap.org/pair/0x9585f8533942123d9fada9c5c56a346ad4fdb553\r\n\r\nHow Is the AlloHash Network Secured?\r\n\r\nFor security purposes, the trader or user is given a password. Here is a typical transaction example, \" Send 0.8 BTC to +2547112254 PIN GOOGLE2FA \" , and immediately the transaction is completed."
    },
    "country_origin": "QA",
    "genesis_date": null,
    "contract_address": "0x4c6719bf85903d18c295da44216f862b01b36f43",
    "url": "https://allohash.com/",
    "explorers": [
        "https://etherscan.io/token/0x4c6719bf85903d18c295da44216f862b01b36f43",
        "https://ethplorer.io/address/0x4c6719bf85903d18c295da44216f862b01b36f43"
    ],
    "twitter": "allohashcom",
    "facebook": "allohash",
    "telegram": "allohash_com"
}