{
    "id": "alt-estate",
    "symbol": "alt",
    "name": "AltEstate Token",
    "platforms": {
        "ethereum": "0x419b8ed155180a8c9c64145e76dad49c0a4efb97"
    },
    "hashing_algorithm": null,
    "categories": [
        "Real Estate"
    ],
    "description": {
        "en": "Alt.Estate is a financial technology company offering the protocol for real estate tokenization and the platform for buying and trading tokenized property assets in fractions. Using the blockchain technology to disrupt the $217 trillion real estate market, Alt.Estate has a strong potential to become an industry standard for the blockchain-based real estate transactions. A powerful technology stack, a go-to-market strategy with 10x leverage, a working prototype with three already tokenized apartments in key geographies (USA, EU, Japan), and sound community support all position Alt.Estate as a win-win solution for real estate developers and investors. Created by a highly professional team with a background in IT, investment and marketing, who had $400 million worth of real estate deals last year, Alt.Estate benefits from the advisory board with worldwide expertise and transactions in real estate worth more than $3 billion.\r\n\r\nReasons to buy:\r\n1. Alt.Estate disrupts the $217 trillion market with new industry protocol - an “ERC-20” for Real Estate.\r\n2. Strong B2B business model with $150M token income in the first 3 years.\r\n3. Working prototype in top real estate markets: USA, Japan and EU.\r\n4. Experienced team with $400M real estate deals value and expert advisors worth $3Bn from PWC, Savills and Knight Frank.\r\n5. AA+ Rating from Tokenator and excellent marks from ICObench, FoxICO, ICObazaar and others.\r\n6. Demand for tokens is forecasted to be 10X higher vs initial supply.\r\n"
    },
    "country_origin": "VG",
    "genesis_date": null,
    "contract_address": "0x419b8ed155180a8c9c64145e76dad49c0a4efb97",
    "url": "https://alt.estate/",
    "explorers": [
        "https://etherscan.io/token/0x419b8ed155180a8c9c64145e76dad49c0a4efb97",
        "https://ethplorer.io/address/0x419b8ed155180a8c9c64145e76dad49c0a4efb97"
    ],
    "twitter": "alt_estate",
    "facebook": "Alt.Estate",
    "telegram": "AltEstate",
    "reddit": "Alt_Estate/",
    "github_org": "AltEstate"
}