{
    "id": "asia-pacific-electronic-coin",
    "symbol": "apecoin",
    "name": "Asia Pacific Electronic Coin",
    "platforms": {
        "tron": "TGpSN8kvoaHqTFJr5MUiXTdK5L68Yyasqz"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "APECoin (Asia Pacific ELectronic Coin, pronounced as Ah-PEC-Coin) is a Green Cryptocurrency, conceptualized and designed to help mother nature. This is one of the cryptocurrencies in the market that has a value linked in the preservation of our planet. A single significant APECoin makes a massive impact.\r\nThe projects that are linked with APECoin are 1)Solar Renewable Energy 2)Waste to Energy Production 3)Production of Sulphate-Reducing Bacteria. Aside from the mentioned projects, we also have a direct individual participation.Such as Tree Planting, Plastic Trash Collection, Water Clean-up Drive, Non-usage of Plastic, Non-burning of Plastic Garbage, Lesser Domestic Energy Consumption, Lesser usage of Motorized Vehicle, and Lesser usage of Office Paper and the like. These initiatives have equivalent coins to obtain after a thorough inspection.\r\nIn a span of few years, we opt to see positive results from the time it is initiated on the ground. Specifically, it will reduce pollution. Less pollution leads to an environmental healing. As soon as the environment starts to heal, a significant breath of fresher and cleaner air traverse freely. Automatically our body adheres to a positive change, thereby improving the immune system while eliciting positive thoughts that are interconnected to all aspects in life. Be an advocate for environment. Act now & obtain your APECoin reward!"
    },
    "country_origin": "AM",
    "genesis_date": null,
    "contract_address": "TGpSN8kvoaHqTFJr5MUiXTdK5L68Yyasqz",
    "url": "https://apecoin.io/",
    "explorers": [
        "https://tronscan.org/#/token20/TGpSN8kvoaHqTFJr5MUiXTdK5L68Yyasqz"
    ],
    "twitter": "apecoinofficial",
    "telegram": "APECointrx"
}