{
    "id": "aspire",
    "symbol": "asp",
    "name": "Aspire",
    "platforms": {},
    "hashing_algorithm": "SHA-256",
    "categories": [],
    "description": {
        "en": "What is Aspire (ASP)? \r\nAspire is a decentralized asset solution platform that allows users to create their own digital assets and tokens without the need of developer help. The first asset created on Aspire is named ASP. ASP is the native utility asset used on Aspire to create new assets and tokens. At the time of writing, 10 ASP is charged as the fee to create a custom named asset or token. This creation fee may be lowered or raised if necessary, in order to keep asset creation inexpensive for Aspire users. In the future ASP will be used as the fuel for smart contracts. \r\n\r\nIn addition, all transactions on Aspire require a small amount of gas known as GASP.  Aspire's platform runs on the proof-of-work “gAsp” blockchain where all transactions and assets are recorded. Aspire’s gAsp blockchain utilizes advanced checkpoints. This advanced security feature protects all Aspire assets and tokens from 51% mining attacks and double spending.\r\nAspire’s open-source project was built from redesigned legacy Counterparty software. By replacing the Bitcoin blockchain with the gAsp blockchain, Aspire can perform transaction fees to the amount of .00000001 Gatoshi per byte.  This results in over 300k Aspire transactions per GASP. The gAsp blockchain also has 4MB sized blocks to allow for more transactions while supporting a block time average of 2 minutes.\r\n\r\nAspire tools include: \r\nAspire Wallet https://www.aspirewallet.com/ used to create, send, receive, hold and view Aspire assets and tokens. Aspire Wallet is also used to create sub assets and sub tokens, change an assets description or quantity, lock assets and tokens. Additionally, Aspire Wallet offers the ability to easily distribute assets and tokens to holders of other assets/tokens.\r\nAspire Explorer https://www.aspireexplorer.com/ aids in tracking transactions performed on Aspire \r\nAspire API https://aspirecrypto.com/aspire-api/ Information on Aspire API \r\nAspire Fednode https://aspirecrypto.com/exchange-integration/ Simple deployment on local environments.\r\nAspire Command Line Tools for developer application integration.\r\nAspire Github https://github.com/AspireOrg/ Fully open source software.\r\nMore features will be added to Aspire Wallet in 2021. \r\n\r\nHow Many ASP Coins Are There in Circulation?\r\nAspire launched its mainnet on July 4th, 2020 with 1 billion ASP tokens created at genesis. No additional ASP will ever be created. ASP is fully premined and Aspire Technology Inc sells tokens to exchanges as they are needed by community demand.\r\n45% equal to 450 million ASP was allocated to Aspire Technology Inc, these ASP are locked.\r\n25% equal to 250 million ASP was offered by a Bermuda crowdsale (Non-USA Residents)\r\n26% of the private sale sold authorizing 61,483,651 ASP into circulation. \r\n21% of the unsold ASP from the crowdsale were airdropped to bCommerce labs authorizing 52,000,000 ASP into circulation. \r\nThe remaining 53% equal to 136,516,349 of unsold ASP private sale are locked up.\r\n20% equal to 200 million ASP was allocated to founding members, these ASP are locked.\r\n10% equal to 100 million ASP was allocated to external development, these ASP are locked.\r\nAll coins not sold or allocated from the crowdsale are unlocked at 12.5 percent quarterly beginning December 30, 2020.\r\n\r\nWho Are the Founders of Aspire?\r\nThe Aspire project officially began April 10th, 2017 and was founded by CEO Jim Blasko of Las Vegas Nevada and Michael Terpin of San Juan Puerto Rico. The Aspire platform mainnet was launched on July 4th, 2020. \r\n\r\nJim Blasko is a blockchain developer and crypto pioneer known for mining Bitcoin in late 2010, and developing early altcoins such as UnbreakableCoin, Voxels, eBoost, and X-Coin. Jim is the founder of Bitcoin Talk Radio, and Cryptos.io. He has taken roles on other teams including Lunch Money, Talent Joe, FLASH, NetCoin, PIVX, Jewelz, Guardium, Neutron, and Minex. In 2013 Jim teamed up with Michael Terpin to launch bCommerce Labs, a blockchain incubator. Jim is actively found at Bitcoin conventions as a speaker and is now leading Aspire.\r\n\r\nMichael Terpin is founder and CEO of Transform Group , whose divisions include Transform PR, a global public relations firm that has served more than 200 clients in the blockchain field and helped launch more than 100 ICO’s, including Aeternity, Augur, Dent, Ethereum, Factom, Golem, MaidSafe, and Neo; Michael is also the founder of CoinAgenda, a global event series for cryptocurrency investors and blockchain innovators since 2014 and Transform Strategies, the company’s advisory division.\r\n\r\nHow is the Aspire Network Secured?\r\nAspire and the assets/tokens created on Aspire are secured via proof-of-work mining on the gAsp blockchain. The gAsp blockchain is protected by checkpointing every block preventing 51% attacks and double spending on the Aspire platform.\r\n\r\nWhat Makes Aspire Unique?\r\nAspire improves on speed, cost, and security for creating both fungible and non-fungible digital assets and tokens. \r\n\r\nEasy to use - Aspire allows anyone to create assets/tokens in under two minutes.\r\n\r\nSpeed – Instant transactions and two-minute confirmations make Aspire 5 times faster than Bitcoin.\r\n\r\nCost Efficient - 1 GASP allows more than 300,000 transactions of any Aspire asset/token created on the Aspire platform making it the most cost-effective platform in the world.\r\n\r\nSecurity – The first asset creation platform running on a proof-of-work blockchain secured with advanced checkpointing.\""
    },
    "country_origin": "US",
    "genesis_date": null,
    "url": "https://aspirecrypto.com/",
    "explorers": [
        "https://www.aspireexplorer.com/"
    ],
    "twitter": "aspirecrypto",
    "facebook": "aspirecrypto",
    "telegram": "AspireCommunity",
    "github_org": "AspireOrg"
}