{
    "id": "assgard",
    "symbol": "assg",
    "name": "Assgard",
    "platforms": {
        "ethereum": "0x7c52e19e4d350189bcdfb7f7a0868117e9f195e5"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Assgard is creating the most comprehensive portfolio tracker (SafeGard Suite™) currently available for BEP20 and ERC20 Assets.  There are other trackers out there but all the ones that we have tested are lacking and we will to fix this!  \r\n\r\nSafeGard Suite™ will offer new and innovative ways to track your crypto assets. We are changing how people trade on the Block Chain. Alerts. Charts. Data analytics. Value tracking across all tokens in your wallet. One place for all your data needs.\r\n\r\nSafeGard Suite™ will also offer reports on gains/losses, organized for easy tax filing.\r\nThe future of portfolio tracking debuted on the BSC network and now on the ETH network, but our plans are much bigger, and we will take SafeGard Suite™ to other networks in the future.\r\n\r\n\r\nAssgard will soon be adding LaunchGard Suite™ and SafeGard Suite™ Mobile to our portfolio of products.  \r\nLaunchGard Suite™ will be a safer place to launch tokens on the BSC network. Investors will be able to use LaunchGard Suite™ to research the risk level of new tokens. Token creators will be able to launch on our platform after being thoroughly evaluated. LaunchGard Suite™ will connect selective investors with great projects.\r\n\r\nSafeGard Suite™ Mobile will provide the same information as SafeGard Suite™ but in a mobile platform that will work on both Android and IOS devices."
    },
    "country_origin": "US",
    "genesis_date": null,
    "contract_address": "0x7c52e19e4d350189bcdfb7f7a0868117e9f195e5",
    "url": "https://www.assgardtoken.com",
    "explorers": [
        "https://etherscan.io/token/0x7C52e19E4d350189bcdfB7F7A0868117e9F195E5",
        "https://ethplorer.io/address/0x7C52e19E4d350189bcdfB7F7A0868117e9F195E5"
    ],
    "twitter": "ASSGARDToken",
    "telegram": "ASSGardiansCommunity",
    "reddit": "AssgardToken/"
}