{
    "id": "atd",
    "symbol": "atd",
    "name": "A2DAO",
    "platforms": {
        "ethereum": "0x8052327f1baf94a9dc8b26b9100f211ee3774f54"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "A2DAO - Project accelerator & Investment platform for people.\r\n\r\nA2DAO aims to connect startups with smart capital while simultaneously helping to cultivate a passionate community for each individual project.\r\n\r\nOur team of experts will assist projects in marketing, development, tokenomics, and other critical areas of growth. We have reshaped the old fundraising model by distributing allocation to our community members rather than to close-knit VCs and institutions.\r\n\r\nThe A2DAO (ATD) connects promising crypto projects and retail investors. Holding the ATD allows to get the opportunity to invest in crypto startups, both at an early and public stage. Depending on the type of project, each member of the A2DAO community will have guaranteed allocation based on their current tier level.\r\n\r\nAccelerator program — A2Jump\r\n\r\nA2Jump acts as a bridge between early-stage blockchain projects and the A2DAO community before a project goes fully public. Accelerator program is an excellent opportunity for early-stage ventures but it also gives ATD holders lucrative investment opportunities.\r\n\r\nEach project that applies to enter the accelerator program will be required to purchase a certain number of tokens in order to pass further audit by our team. When projects receive the status of “accelerator project” they will receive the status of “partner” and have access to all of our marketing tools.\r\n\r\nChosen projects will receive expertise as part of the A2Jump accelerator program. We believe that the blockchain movement is a fully democratic one and projects that reflect this value deserve to receive the best global expertise and adequate funding.\r\n\r\nThe success of blockchain models applied to solve real-world problems has popularized the technology. In addition, the massive potential of digital assets has caused traditional financial institutions to take notice and the current market rally is largely attributed to an inflow of institutional capital. This has also attracted millions of retail investors and crypto enthusiasts.\r\n\r\nHowever many of these new investors are setting foot into the world of crypto for the first time. They lack the expertise, financial knowledge, and technical capabilities to approach the market with confidence and truly succeed. A2DAO will provide its community investment opportunities with a clear and thorough understanding of each respective project’s strengths and weaknesses.\r\n\r\nProjects will be rated through the A2DAO voting system and internal audit by founders, team members, and our community. This means that all projects selected by the A2DAO community represent a great opportunity for retail investors, which wouldn’t have been possible without an adequate understanding of core fundamentals."
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x8052327f1baf94a9dc8b26b9100f211ee3774f54",
    "url": "https://a2dao.com/",
    "explorers": [
        "https://etherscan.io/token/0x8052327f1baf94a9dc8b26b9100f211ee3774f54",
        "https://ethplorer.io/address/0x8052327f1baf94a9dc8b26b9100f211ee3774f54"
    ],
    "twitter": "a2dao_",
    "telegram": "a2ann"
}