{
    "id": "australian-kelpie",
    "symbol": "knockers",
    "name": "Australian Kelpie",
    "platforms": {
        "binance-smart-chain": "0x711f03c19e54133b1d940112580cc1e94e246f1f"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Operation Underground Railroad exists to rescue children and women from human trafficking and sexual exploitation. OUR performs coordinated rescue missions to save victims of human trafficking and arrest the criminals behind the operations. By holding $KNOCKERS, you are tributing and supporting the hard working men and women at OUR who are literally knocking down doors to save lives.\r\n\r\n$KNOCKERS is the first token to have perpetual marketing and donation. Everyday, 60% of newly added liquidity is pulled for donation to OUR as well as to marketing the project. The $KNOCKERS portion is burnt to a dead address creating daily deflation while BNB is split 50/50 towards donation and marketing. Thus approximately 3% of daily BNB volume in used for marketing to generate attention and holders to the project and 3% of daily BNB volume is donated straight to OUR. On top of all this, 2% of daily volume is reflected amongst all holders to reward long term holding - similar to staking. The remaining 40% of new daily genreated liquidity is locked each day for 100 years.\r\n\r\nThis tokenomic design drives maximum value towards holders as well as our mission. We understand that taking care of our holders maximizes in turn how well we can benefit our cause.  Driving value in terms of deflation and marketing to our $KNOCKERS holders, will in turn maximize holder count and volume in order to generate the largest daily net donations to OUR."
    },
    "country_origin": "US",
    "genesis_date": null,
    "contract_address": "0x711f03c19e54133b1d940112580cc1e94e246f1f",
    "url": "https://knockerscoin.com",
    "explorers": [
        "https://bscscan.com/token/0x711f03c19e54133b1d940112580cc1e94e246f1f"
    ],
    "twitter": "knockerscoin",
    "telegram": "knockerscoin",
    "reddit": "knockerscoin/"
}