{
    "id": "dacxi",
    "symbol": "dacxi",
    "name": "Dacxi",
    "platforms": {
        "ethereum": "0xefab7248d36585e2340e5d25f8a8d243e6e3193f"
    },
    "hashing_algorithm": null,
    "categories": [
        "Education"
    ],
    "description": {
        "en": "\"Dacxi Coin is the native currency for the global Dacxi ecosystem which is a pioneering Crypto-Wealth sector. Founded in 2017, Dacxi now has six offices globally, proprietary exchange network technology, and has launched its platform expansion that will see 100 country platforms launched by end 2022 Crypto-Wealth is expected to become the next big market in Crypto-Assets, which Dacxi already leads in the UK and Australian markets. The primary use of the Dacxi Coin is for cross-border investment transfers, blockchain fees and exchange transactions for a new global tokenised crowd-funding system, based on its global network of licensed Crypto- Wealth platforms. A bespoke blockchain, supported by a marketing machine can support thousands of investment opportunities at any one time. Crowd funding, via tokenisation, is a multi-trillion dollar marketplace. Dacxi’s in-house tech team pioneered have been pioneering the building of global networks of crypto-exchanges since 2017 This includes IP on all code for exchange matching-engines and platform protocols.\r\n\r\nDacxi is pioneering two inter-connected niches for the crypto-world; the Crypto-Wealth sector and global tokenised crowd-funding. Crypto-wealth is the new sector of the global ‘wealth’ industry that treats crypto-assets as an investible asset class. This sector is dominated by tech-phobic investors of over 45 years old yet who control 90% of world’s wealth and need specialist platforms and support. Dacxi leads the UK and Australian markets where it has already built a solid foundation of committed platform users. Dacxi’s Global Innovation Funding System will revolutionise crowd funding and the ICO market. Based on a global network of locally licensed crypto- wealth platforms, and their ‘wealth-investor’ users, Dacxi will be able to secure, create, launch and fulfilled thousands of projects monthly. To empower and protect Dacxi’s older customer base, Dacxi has developed the world's leading education system for crypto-wealth builders, not the traders or speculators addresses by world’s other exchanges, with hundreds of webinars, courses and meetups each months, creating the industry’s most dynamic and committed crypto community."
    },
    "country_origin": "SG",
    "genesis_date": null,
    "contract_address": "0xefab7248d36585e2340e5d25f8a8d243e6e3193f",
    "url": "https://dacxi.com/dacxi-coin",
    "explorers": [
        "https://etherscan.io/token/0xefab7248d36585e2340e5d25f8a8d243e6e3193f",
        "https://ethplorer.io/address/0xefab7248d36585e2340e5d25f8a8d243e6e3193f"
    ],
    "twitter": "DacxiGlobal",
    "facebook": "DacxiGlobal",
    "telegram": "DacxiCoinCommunity",
    "reddit": "DACXI/"
}