{
    "id": "daddyyorkie",
    "symbol": "DDY",
    "name": "DaddyYorkie",
    "platforms": {
        "binance-smart-chain": "0xfbac18b4e8560c0d8358b72d8ff3994ae7c2ddec"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "What is DaddyYorkie?\r\nDaddyYorkie is the second token of the BabyYorkie Ecosystem. DaddyYorkie was born on September, 4, 2021 to feed his son, BabyYorkie.\r\n\r\nWhat is DaddYorkie's Supply?\r\nDaddyYorkie has a supply of 2,100,000,000,000 of which more than 30% has already burned.\r\n\r\nWho are the founders of DaddyYorkie?\r\nThe DaddyYorkie's team is 100x100 doxxed. It is made up of three members: an expert in online marketing and fullstak development, an expert in marketing and social media, and an expert in developing business viability plans. You can see their profiles and social networks at www.daddyyorkie.finance.\r\n\r\nWhere can you buy DaddyYorkie?\r\nYou can buy it at https://pancakeswap.finance. Our contract is: 0xFbac18B4e8560c0d8358B72D8fF3994ae7C2DDEC\r\nSoon we will list in different exchanges like Hotbit, LBank or Big.one\r\n\r\nWhat are DaddyYorkie's future plans?\r\n- Launch on October 8th of our own swap. It will have the functions of swap, staking, farming, pools and lotteries. We will be adding different pools and adding utilities to make a powerful and benchmark platform in the crypto market. You will be able to stake your DDY to obtains BabyYorkie.\r\n\r\n-Visa card. We will have a payment system for businesses related to animals and pets (zoos, veterinarians, pet stores, boutiques ...), so that when paying with this card, owners obtain advantages and discounts.\r\n\r\n- Charity and donations: We will build a shelter for unprotected animals. It will also be a thematic refuge, with a restaurant, attractions and a guided tour with a presentation of the animals proposed for adoption. This project is already underway, working with “Andalucía Emprende” (the platform for promoting Startups of the Junta de Andalucía) to give it consistency and make the project sustainable.\r\n\r\n- Creation of a line of organic food for animals, a tokenized company from which the shares of the company can be bought with one of our currencies and thus be able to collect dividends with that currency.\r\n\r\n- A dream: create our own Blockchain network."
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0xfbac18b4e8560c0d8358b72d8ff3994ae7c2ddec",
    "url": "https://daddyyorkie.finance",
    "explorers": [
        "https://bscscan.com/token/0xFbac18B4e8560c0d8358B72D8fF3994ae7C2DDEC"
    ],
    "twitter": "daddyyorkie",
    "telegram": "daddyyorkietokeneco"
}