{
    "id": "davinci-token",
    "symbol": "vinci",
    "name": "DaVinci Token",
    "platforms": {
        "harmony-shard-0": "0xb8e0497018c991e86311b64efd9d57b06aedbbae"
    },
    "hashing_algorithm": null,
    "categories": [
        "Harmony Ecosystem"
    ],
    "description": {
        "en": "The Launch of DaVinci Gallery represented a paradigm shift in the NFT space on Harmony. The concept of bringing a low cost, frictionless platform for both artists and collectors was and remains an extremely ambitious goal.\r\n\r\nSince their explosion in popularity, the conversation surrounding NFTs has centered primarily around two talking points:\r\n** The artist can own and control their art and its distribution for the first time. Enfranchising millions.\r\n**The environmental impact of NFTs minted on POW(Proof of work) chains, and our responsibility to protect our planet.\r\n\r\nDaVinci Gallery launched on Harmony mainnet allowing, for the first time:\r\n**Artists to mint unique NFTs for a fraction of a penny on a POS chain; an industry first\r\n**Collectors to purchase and resell NFTs in seconds, avoiding the costly “Gas” fees associated with POW (proof of work) networks like Ethereum\r\n\r\nThe Next Generation of Art — Powered by $VINCI\r\n\r\nThe mission statement for the team behind DaVinci Gallery was to create the “Next Generation of Art”.\r\n\r\nHow do you empower a decentralized community to take up the responsibilities of growing an NFT platform while also bringing in all aspects of what makes Harmony the leader in deFi and Proof of Stake protocols?\r\n\r\n$VINCI bridges this gap, goes a step further still and we are beyond thrilled to finally share those details with the world.\r\n\r\nWhat is $VINCI?\r\n$VINCI is the HRC-20 governance and utility token for DaVinci Gallery. \r\nWe centered the core of the $VINCI experience around three pillars\r\n** Community Driven — A fair launch.\r\n** No pre-sale, seed rounds, or early allocations to investors\r\n** Inclusivity — Launching on all major Harmony DEX promoting competition\r\n** Long term Sustainability — Promoting responsible farming, and provided needed capital to further development"
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0xb8e0497018c991e86311b64efd9d57b06aedbbae",
    "url": "https://davinci.gallery/",
    "explorers": [
        "https://explorer.harmony.one/address/0xb8e0497018c991e86311b64efd9d57b06aedbbae"
    ],
    "twitter": "davinci_gallery",
    "telegram": "daVinci_NFT_Marketplace"
}