{
    "id": "decubate",
    "symbol": "dcb",
    "name": "Decubate",
    "platforms": {
        "binance-smart-chain": "0xeac9873291ddaca754ea5642114151f3035c67a2"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "What is Decubate (DCB)\r\n\r\nDecubate is a community-powered investment platform that is bringing the $3 trillion global startup economy on-chain, unlocking liquidity for investors, and accelerating the mass adoption of blockchain technology.\r\nThe Decubate platform pairs web2 startups with the financial and promotional capital of community members to fuel their web3 launch.\r\nCommunity members (DCB holders) receive an investment allocation and staking rewards for backing startups on the Decubate platform. \r\n\r\nWho Are The Founders of Decubate\r\n\r\nDecubate was founded by Elliot Hagemeijer. Hagemeijer is a serial entrepreneur and was an early entrant in the blockchain space. He worked at leading blockchain brokers and exchanges. A champion for early-stage startups, Hagemeijer advises teams on product development and tokenomics.\r\n\r\nWhat Makes Decubate Unique\r\n\r\nDifferentiated Deal Flow: Decubate is the first blockchain project investment platform to focus on web2 startups. They source and onboard startups through their global network of incubator and accelerator partners.\r\n\r\nCommunity-Powered: Startup investments and allocations are decentralized, determined by DCB-holding community members.  \r\n\r\nToken Utility: Beyond staking rewards and transaction fees, the DCB token provides additional benefits to holders who actively engage on the Decubate platform. These benefits include increased voting power, reputation score, and investment rewards. \r\n\r\nCross-Chain: The Decubate platform provides cross-chain support which enables startups and investors to raise funds and invest capital across multiple blockchains at once.\r\n\r\nTop Tier Team: Decubate has assembled a high-quality team with decades of combined experience in blockchain products, startup incubators, software development, and marketing.\r\n"
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0xeac9873291ddaca754ea5642114151f3035c67a2",
    "url": "https://decubate.com/",
    "explorers": [
        "https://bscscan.com/token/0xeac9873291ddaca754ea5642114151f3035c67a2"
    ],
    "twitter": "decubate",
    "telegram": "decubate"
}