{
    "id": "defi-for-you",
    "symbol": "dfy",
    "name": "Defi For You",
    "platforms": {
        "binance-smart-chain": "0xd98560689c6e748dc37bc410b4d3096b1aa3d8c2"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "DeFi For You is a peer-to-peer lending platform where users can loan against crypto, NFTs, and real-world assets.\r\nLenders can earn interest by depositing digital assets into loans, and borrowers can use their crypto and NFTs as collateral for instant loans. Lenders can set terms of loans and interest rates themselves, and negotiate these terms with borrowers before committing to a loan.\r\nDeFi For You is also partnered with pawnbrokers in the UK and has built a system whereby borrowers can bring real-world assets like jewellery, watches, and so on into a pawnshop and have it valued, stored, and turned into an NFT, where it can then be used as collateral for a DeFi loan.\r\nThe project aims to give ordinary people genuine control over their assets by making all lending on the platform peer-to-peer.\r\nWho Are the Founders of DeFi For You?\r\nDeFi For You was founded in September 2020 by the former co-founder of Travala.com (AVA) Adam Chaplin.\r\nAdam began his career as a British Royal Marine Commando where he was eventually responsible for training incoming soldiers both at home and abroad. He then moved into the travel and tourism industry, where he founded an upmarket travel agency and later co-founded Concierge (Travala.com), a crypto-friendly holiday booking website and home of the AVA ERC20 token.\r\nThe core team of DeFi For You is currently split between the UK and Vietnam, the latter of which has an emerging IT and blockchain development sector that rivals the global standard.\r\nWhat Makes DeFi For You Unique?\r\nThe DeFi space has largely neglected the worlds oldest financial service: pawn.\r\nThe pawnbroking industry was hit hard by the pandemic and has barely recovered. DeFi For You is offering this industry a future that will secure it more business by allying itself with DeFi, while giving borrowers the benefit of more liquid collateral.\r\nDeFi For You allows anyone to come onto the platform and set up one of two things:\r\nA digital pawnshop that will become a part of our web of inter-connected DeFi pawn bases.\r\nA P2P lending shop where users can lend out crypto while taking other tokens and coins as collateral.\r\nThis allows anyone to earn interest on DeFi lending and allows instant access to finance for anyone, regardless of their credit history.\r\nThis also allows users to set their own terms and interest rates, something that the wider DeFi industry has failed to offer.\r\nWhat Are the Tokenomics of DFY?\r\nDFY is built on Binance Smart Chain and has a BEP20 - BEP2 bridge.\r\n861,416,467 total existing DFY (no more can be minted)\r\n200 million DFY tokens are locked for 5 years by smart contract (Reserve)\r\n285 million DFY are locked for 2 years by smart contract (R&D)\r\n233 million DFY are staked for 3 - 12 months (28/07/2021)\r\n45 million are reserved for team and founders\r\nDeFi For You executes a quarterly burn of DFY tokens to reduce overall supply and increase the value of the token over time. As of July 2021, a total of 138,583,533 DFY tokens have been burned.\r\nDig Chain Native to DeFi For You\r\nIn August 2021, DeFi For You will be launching its own native POS blockchain called Dig Chain.\r\nThe DIG Coin will be airdropped one-to-one to all DFY holders and will be used as a governance coin for DeFi For You. Members of the community will be able to run nodes and validators for Dig, including on Raspberry Pi, which will allow them to democratically participate in the platform's development.\r\nDig Chain also aims to bring real estate onto the blockchain. Dig Chain will be forked for every local jurisdiction to ensure it can comply with different local regulations. Property governance through the blockchain has not been successfully done before and will open the doors to $280 trillion worth of real estate that could potentially be brought on-chain.\r\nHow is DeFi For You Secured?\r\nDeFi For You is built on Binance Smart Chain which uses a Proof-of-Stake (POS) consensus mechanism. This has the added benefit of making it significantly less energy-consuming.\r\nThe DFY smart contract has been audited by CertiK and has a live Skynet security analysis ongoing.\r\nWhere Can You Buy DFY?\r\nDFY is listed on several major exchanges, including CoinTiger, HotBit and Indacoin, as well as decentralized exchanges, including PancakeSwap, BakerySwap, and JulSwap.\r\n\r\n"
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0xd98560689c6e748dc37bc410b4d3096b1aa3d8c2",
    "url": "https://defiforyou.uk/",
    "explorers": [
        "https://bscscan.com/token/0xd98560689c6e748dc37bc410b4d3096b1aa3d8c2#balances"
    ],
    "twitter": "DeFiForYou",
    "telegram": "DeFiForYou_English",
    "github_org": "defi-vn"
}