{
    "id": "defi-warrior",
    "symbol": "fiwa",
    "name": "Defi Warrior",
    "platforms": {
        "binance-smart-chain": "0x633237c6fa30fae46cc5bb22014da30e50a718cc"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "DeFi Warrior is a DeFi x NFT Play2earn Blockchain game with a fascinating crypto galaxy game story. While NFT games are creating a strong trend, DeFi Warrior stands out with the combination of DeFi and NFT in the game, along with the story of the crypto world in miniature. In DeFi Warrior, each blockchain is a planet, and each crypto is a warrior. The planet is also the place where warriors can build their coin mining factory, and fight against bosses or enemies for rewards.\r\n\r\nThe token FIWA backed by BEP 20 is the main token. FIWA token is required for trading on DeFi Warrior's NFT market place. We'll burn FIWA token during the project's operation. The NFT Warriors backed by BEP 721 are the main characters in game can be traded on the NFT market and staked in pool to earn token.\r\n\r\nSuch game dynamics aim to achieve two essential goals: to bring the world of crypto to masses through gaming, and to pique the curiosity of both gamers and crypto investors.\r\n\r\nI. What makes Defi Warrior unique?\r\nThe following three things can be mentioned as the highlights of Defi Warrior:\r\n\r\n1. The first Crypto character & Crypto galaxy game concept \r\nWe create a miniature world of blockchain in the game.\r\nEach Warrior created is a representative of a Cryptocurrency. For example Bitcoin Warrior, Ethereum Warrior or etc.\r\nSome gameplays simulate how blockchain works such as mining or fork.\r\n\r\n2 Crypto price movement boosts character’s strength\r\nWarrior attributes will be buffed based on the price movement of tokens on the market.\r\n\r\n3 The first Initial Game Offering (IGO)\r\nCrowdfunding call of projects in the game\r\n\r\nII. Defi Warrior team\r\nDefi Warrior is developed by a team of experienced professionals in both technology and Blockchain. We have 5+ years of expertise in developing 05 Crypto exchanges for Japanese & Global markets, crypto wallets, establishing private blockchains, NFT marketplaces, and DEXs. One of our prides is the in-house game development team, Smart Studio Game, with excellent individuals more than 10 years of experience and also produced many outstanding games.\r\n\r\n1. Founding team \r\n- Mark Dao - Co-founder\r\n Founder & CEO - BAP Group. \r\nFormer Game System Engineer and PM at CyberAgent Group Japan (Ameba game). \r\n5+ years in blockchain development and crypto investment \r\n\r\n- Victor Truong - Co-founder \r\nFCCA, Certified Internal Auditor. \r\nCEO - BAP Ventures \r\n10+ years in Business & Finance 4+ years in crypto investment \r\n\r\n- Loi Luu - Cofounding Advisor\r\nCEO & Co-founder at Kyber Network\r\n\r\n- Long Vuong - Cofounding Advisor: \r\nCEO & Founder at Tomochain\r\n\r\n2. Smart Game Studio \r\nThe forerunner of Smart Game Staudio is the Funkoi company whose founder is Mr. Daniel, a Google Technical Leader in Silicon Valley. Later, Funkoi was acquired by BAP and is continuing to grow at the present.\r\n\r\nSome achievements can be named as: - The Beat Master - Top #2 US in 2021 - Screw Factory - Top #100 US market - Metal Heroes - Featured on Google Store\r\n\r\n3. Advisors \r\n- Daniel Jeppsson: \r\nTechnical Project Lead at Google. \r\n18+ years working in game development \r\n\r\n- Riley Tran\r\nCo-founder GFS Ventures. \r\nCountry Director - Near Protocol \r\n\r\n- Barek Sekandari: \r\nCOO of Fantom. \r\nDirector of SKchain Ventures - Alexandre De Damas. \r\nFounder & CEO of Damacorp Global. Partner of Quantum Fintech Group"
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x633237c6fa30fae46cc5bb22014da30e50a718cc",
    "url": "https://defiwarrior.io/",
    "explorers": [
        "https://bscscan.com/token/0x633237C6FA30FAe46Cc5bB22014DA30e50a718cC"
    ],
    "twitter": "DeFiWarriorGame",
    "telegram": "defiwarrior_chat"
}