{
    "id": "dforce-token",
    "symbol": "df",
    "name": "dForce Token",
    "platforms": {
        "ethereum": "0x431ad2ff6a9c365805ebad47ee021148d6f7dbe0",
        "arbitrum-one": "0xae6aab43c4f3e0cea4ab83752c278f8debaba689"
    },
    "hashing_algorithm": null,
    "categories": [
        "Cryptocurrency",
        "Decentralized Finance (DeFi)"
    ],
    "description": {
        "en": "dForce advocates for building an integrated and interoperable open finance protocol matrix, covering assets (multicurrency stablecoins, synthetic assets, USDx, GOLDx), lending (global liquidity pool) and trading (aggregator and AMM). dForce is currently deployed on Ethereum and Binance Smart Chain (BSC).\r\n\r\nOur team includes both crypto veterans and professionals from Goldman Sachs, Standard Chartered Bank, CitiBank, Hony Capital. dForce is backed by investors including CMBI (China Merchants Bank International), Multicoin Capital and Huobi Capital (the investment arm of Huobi Group).\r\n\r\nWe work with the world’s top-ranked security companies (Trail of Bits, Consensys Diligence, Certik, Quantstamp, Certora, PeckShield, SlowMist, SECBIT) on smart contract audits for all dForce native protocols.\r\n\r\ndForce Token (DF) is the governance token across dForce network, conferring holders the power to influence decisions concerning dForce protocols, including onboarding of new assets and collaterals, changes to risk parameters, fee accrual, interest alignment through voting process.\r\n\r\nKey Protocols:\r\n• dForce Lending & Synthetic Asset Protocol (https://app.dforce.network/), a pool-based general lending protocol which supports multisided transactions while featuring native over-collateralized stablecoins such as USX and EUX, essential cryptos such as xBTC and xETH, as well as synthetic assets that track stocks.\r\n• Yield Market (dToken) (https://markets.dforce.network/), the most accessible yield aggregator to farm the most attractive risk-adjusted yield across DeFi protocols. Instant withdrawal supported. • USDx (https://usdx.dforce.network/), the first decentralized and fiat-back stablecoin implementing systematic interest. 1 USDx = 80% USDC +10% PAX + 10% TUSD. USDx holders can earn interest by simply depositing USDx into the USR contract and can withdraw at any time.\r\n• GOLDx (https://goldx.dforce.network/), a gold token 100% backed by physical gold (through constituent gold token PAXG) and is denominated in gram. GOLDx is featured by 0 transaction fee and is 100% compatible with all DeFi protocols, making it easy for DeFi integrations.\r\n• dForce Trade (https://trade.dforce.network), aggregate proper liquidity and secure the best available price across multiple platforms to facilitate large-volume trades."
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x431ad2ff6a9c365805ebad47ee021148d6f7dbe0",
    "url": "https://dforce.network/",
    "explorers": [
        "https://etherscan.io/token/0x431ad2ff6a9c365805ebad47ee021148d6f7dbe0",
        "https://ethplorer.io/address/0x431ad2ff6a9c365805ebad47ee021148d6f7dbe0",
        "https://arbiscan.io/token/0xaE6aab43C4f3E0cea4Ab83752C278f8dEbabA689"
    ],
    "twitter": "dforcenet",
    "telegram": "dforcenet",
    "reddit": "dForceNetwork/",
    "github_org": "dforcenetwork"
}