{
    "id": "dfsocial-gaming",
    "symbol": "dfsg",
    "name": "DFSocial Gaming",
    "platforms": {
        "ethereum": "0x54ee01beb60e745329e6a8711ad2d6cb213e38d7",
        "binance-smart-chain": "0x612c49b95c9121107be3a2fe1fcf1efc1c4730ad"
    },
    "hashing_algorithm": null,
    "categories": [
        "Non-Fungible Tokens (NFT)",
        "Gaming"
    ],
    "description": {
        "en": "DFSocial Gaming is a revolutionary gaming platform that allows all gamers to compete for prizes - in crypto! Tournaments are the name of the game - the more you compete, the more opportunities you have to take home the bragging rights and the grand prize!\r\n\r\nCombining the promising industry of De-Fi (Decentralized Finance) with the ever-expanding Gaming industry will allow gamers of all skill levels to get paid fairly for their gaming skills. \r\n\r\nEven if you’re not a Gamer, you can still become a Sponsor and reap the benefits of sponsoring a skilled gamer of your choice! Prizes will be split down the middle and be processed automatically via smart contract on the Binance SmartChain (BSC).\r\n\r\nUltra-rare and valuable NFTs will power the entire ecosystem to give NFT owners exclusive privileges & increased rewards to maximize their earning potential! The DFSocial NFTs are on sale now for a limited time; check the website for the auction details and stay tuned for the details regarding the advantages of being a DFS NFT holder.\r\n\r\nDFSocial offers some of the most popular and iconic games - from both console systems and PC. However, unlike other gaming platforms, DFSocial aims to provide the best games that the players want and gives voting power to the community to decide for themselves.\r\n\r\nNo other gaming platform offers video, board, and card games, the variety of games DFSocial offers is second-to-none.\r\n\r\nThese games include:\r\nLeague of Legends (LoL)\r\nCall of Duty - Warzone (CoD)\r\nCounter-Strike: Go (CS GO)\r\nBrawl Stars (BS)\r\nPoker \r\nChess\r\nRocket League (RL)\r\n\r\nFor more information, check out the DFSocial Gitbook for guides and resources."
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x54ee01beb60e745329e6a8711ad2d6cb213e38d7",
    "url": "https://dfsocial.com/",
    "explorers": [
        "https://etherscan.io/token/0x54ee01beB60E745329E6a8711Ad2D6cb213e38d7",
        "https://ethplorer.io/address/0x54ee01beB60E745329E6a8711Ad2D6cb213e38d7",
        "https://bscscan.com/token/0x75de745a333a47Fe786e8DbBf3E9440d3d5Bc809#balances"
    ],
    "twitter": "DFSocial_Gaming",
    "telegram": "defisocial"
}