{
    "id": "digibyte",
    "symbol": "dgb",
    "name": "DigiByte",
    "platforms": {},
    "hashing_algorithm": "Multiple Algorithms",
    "categories": [
        "Internet of Things (IOT)",
        "Artificial Intelligence",
        "Cryptocurrency",
        "Smart Contract Platform",
        "Privacy Coins"
    ],
    "description": {
        "en": "What is DigiByte?\r\nDigiByte is more than a faster digital currency. It is an innovative blockchain that can be used for digital assets, smart contracts, decentralized applications and secure authentication.\r\n\r\n\r\nWhat makes DigiByte stronger than others?\r\nDigiByte is a rapidly growing open-source blockchain created in late 2013 and released in early 2014. After 6 years of forward thinking development, DigiByte has become one of the safest, fastest, longest and most decentralized UTXO blockchain in existence.\r\n\r\n\r\nTruly Decentralized.\r\nDigiByte has never been funded through an ICO or significant amount of premined coins. There is no CEO or a company controlling the DigiByte blockchain. It is a volunteer based and global community driven project.\r\n\r\n\r\nMore secure.\r\nDigiByte uses 5 cryptographic algorithms and real time difficulty adjustment to prevent malicious mining centralization and hash power fluctuation. One of which is Odocrypt that changes itself every 10 days for ASIC resistance.\r\n\r\n\r\nMuch faster.\r\nDigiByte blocks occur every 15 seconds which is 40x faster than Bitcoin and 10x faster than Litecoin. Early SegWit implementation and blockchain rigidity enable up to 1066 on-chain transactions per second with negligible fees.\r\n\r\n\r\nForward thinking.\r\nOver the past 6 years, DigiByte has repeatedly set itself apart with multiple blockchain firsts, such asDigiShield guard, MultiAlgo mining, SegWit implementation, Odocrypt algorithm, Dandelion++ privacy protocol, DigiAssets and Digi-ID.\r\n\r\n \r\n \r\n\r\nThis is how the DigiByte blockchain works.\r\nThe three layers are the most innovative parts of the DigiByte blockchain providing the network infrastructure, security and communications to function with cutting edge speed.\r\n \r\n\r\nApplications / DigiAssets.\r\nThe top layer is like an app store with clear real-world uses. All types of digital assets can be created with the DigiAssets protocol on top of the DigiByte blockchain. Decentralized applications (dApps) can be built on top of the DigiByte blockchain. Also smart contracts that leverage the rigidity and security of the DigiByte blockchain can be encoded easily.\r\n\r\n\r\nDigital asset / Public ledger.\r\nThe middle layer provides security and administration. A Digital Byte of data, a representation of larger data or a unit that holds value, and cannot be counterfeited, duplicated or hacked. An immutable public ledger where all transactions of DigiBytes are recorded. DigiByte uses five proof of work algorithms for security. New DigiBytes come from mining only.\r\n\r\n\r\nCore protocol / Global network.\r\nThe bottom layer provides communication and operating procedures. A very low-level way nodes on the DigiByte global network communicate. Thousands of people are running DigiByte software all across the planet. Any server, computer, tablet or mobile phone connected to the DigiByte network becomes a node that helps relay transactions.\r\n\r\n \r\nOpen source / Permissionless.\r\nJust like the DigiByte.io website, the DigiByte blockchain is completely open source and free to use released under the MIT license, which gives you the power to run and modify the software. Transparency allows for independent verification of binaries and their corresponding source code.\r\n\r\n \r\n\r\n \r\n\r\nA digital currency you would absolutely love.\r\nDigiByte (DGB) is a highly scalable peer-to-peer digital currency that enables industry-leading transaction speeds with negligible fees. DigiByte is the best way for payments.\r\n\r\n\r\nEasy to use.\r\nGetting started to use DigiByte is even easier than sending an SMS. You can send and receive DigiBytes using the devices you already know and love. All you need is installing a DigiByte supported wallet then click scan, scan the QR code and send DigiByte. As easy as 1..2..3.\r\n\r\n\r\nNot an ICO.\r\nDigiByte has never been funded through an ICO or significant amount of premined coins (0% remaining). There is no CEO or a company controlling the DigiByte blockchain. The founder, developers and the community are unpaid volunteers that eliminate the bankrupt risk.\r\n\r\n\r\nMuch faster.\r\nDigiByte transactions are confirmed in approx. 15 seconds, which is 40 times faster than Bitcoin and 10 times faster than Litecoin. SegWit enables up to 1066 on-chain transactions per second and negligible fees make DigiByte the ideal currency for daily payments.\r\n\r\n \r\nAlways secure.\r\nDigiByte has been built on the uncrackable technology of the Bitcoin blockchain and implemented various advanced enhancements over it such as DigiShield guard, MultiAlgo mining and the Odocrypt algorithm. Also Dandelion++ privacy protocol helps keep you safe by hiding your IP and physical location. Learn more.\r\n\r\n\r\nMineable.\r\nDigiByte is a 100% Proof of Work (PoW) blockchain that can be mined with five algorithms called Sha256, Scrypt, Skein, Qubit and Odocrypt. MultiAlgo mining contributes to decentralization, security of the network and gives you the freedom to use different kind of hardware's such as an ASIC a FPGA or a GPU. Learn more.\r\n\r\n\r\nManageable units\r\nCompared to 21 million Bitcoin, 21 billion DigiByte (1000:1 ratio to BTC) have been designed to be ready for mass adoption. DigiByte block rewards reduces by 1% every month instead of halving every 4 years. All 21 billion DigiByte will be mined by the year 2035. After 2035 the miners will then rely on transaction fees alone. Learn more.\r\n\r\n\r\n\r\n\r\nA simplified way to create digital assets.\r\nDigiAssets is a secure, scalable layer on top of the DigiByte blockchain that allows for the decentralized issuance of assets, tokens, smart contracts, digital identity and more.\r\n\r\n\r\nLimitless possibilities.\r\nDigiAssets can be used to securely represent anything we find in the physical world. From tangible assets such as real estate or cars, through to scarce digital pieces of art. Signed documents such as deeds and medical bills can be protected.\r\n\r\n\r\nGrowing confidently.\r\nDigiAssets as an ecosystem and platform already has interested parties either planning on or currently building platforms in real estate, finance, remittance, identity, point of sale, racing, trade, healthcare, supply chain, government and more.\r\n\r\n\r\nSolid technology.\r\nDigiAssets leverages unique aspects of a truly decentralized blockchain only found within a permissionless blockchain like DigiByte. This allows DigiAssets to be more secure, scalable and decentralized than any other platform in the market.\r\n\r\n \r\n\r\n\r\nAuthentication at its best.\r\nDigi-ID is a security protocol built on DigiByte blockchain technology that empowers users to effortlessly sign-in to websites, applications, and even into the internet of things.\r\n \r\n\r\nEasy authentication.\r\nDigi-ID eliminates the username, password and 2fa requirements for authentication. Because Digi-ID uses public / private key cryptography, there are no passwords or usernames at risk. This method not only protects the consumer, it also protects the services that the consumer uses.\r\n \r\n\r\nFlawless security.\r\nDigi-ID does not store any data about its users on the DigiByte blockchain. This further strengthens the security while also bolstering end-user’s confidence that their data is neither tracked nor at risk by others negligence. There is no external point of failure for an hacker to exploit your platform.\r\n\r\n\r\nSimple and free.\r\nDigi-ID is completely free! There are no fees, subscription services, or maintenance costs. But the cost is its second best feature. Its primary feature is that, in accordance with DigiBytes security prioritization, Digi-ID is a more secure, yet simple method available to log in to websites, apps and more.\r\n\r\n\r\n\r\n\r\nThe most passionate community ever!\r\nTens of thousands of volunteers from all over the world have contributed to DigiByte in countless ways for years to make it what it is today. It is a truly grassroots movement. We warmly welcome you to join us!\r\n\r\n\r\nDigiByte Foundation.\r\nThe DigiByte Foundation is a volunteer managed organization that operates in a non-profit way. They protect and promote the true principles of decentralization and empower DigiByte and its community to establish and maintain a sustainable decentralized world.\r\nLearn more.\r\n \r\n\r\nDigiByte Awareness Team.\r\n\r\nDGBAT is a community-driven outreach initiative. They are led by a team, whose members in turn manage teams across social media, outreach, education, writers and developers. They aim to promote the DigiByte blockchain through education, outreach and marketing campaigns.\r\nLearn more.\r\n \r\n\r\nDigiByte Developers.\r\n\r\nEveryone that is working on the DigiByte blockchain is an unpaid volunteer who devoted their time and skills to a project they believe in. Start contributing to the DGB development today or build your own app on top of the DigiByte blockchain.\r\nDigiByte Protocol on GitHub.\r\nDigiByte Core Development on GitHub.\r\n\r\n\r\nThe DigiByte Wiki.\r\nThe DigiByte Wiki is an online encyclopedia built by the community, for the community. It contains useful and up to date data such as the DigiByte Ecosystem and how to guides. Anyone can positively contribute to the Wiki by creating a free user account and start adding or updating information on the DigiByte Wiki.\r\n\r\n \r\nMeet the creator of DigiByte.\r\nJared Tate is the founder and creator of the DigiByte blockchain. Jared dedicated full-time development towards DigiByte since October 2013. He has been invited by MIT, Harvard and the US Capitol to speak on blockchain tech. He is also the author of the book Blockchain 2035 The Digital DNA of Internet 3.0, which is the first book written by a blockchain founder."
    },
    "country_origin": "",
    "genesis_date": "2014-01-10",
    "url": "https://DigiByte.org",
    "explorers": [
        "https://digiexplorer.info/",
        "https://chainz.cryptoid.info/dgb/",
        "https://altexplorer.co/coin/dgb",
        "https://digibyteblockexplorer.com/",
        "https://dgb.tokenview.com/"
    ],
    "twitter": "digibytecoin",
    "facebook": "digibytecoin",
    "telegram": "DigiByteCoin",
    "reddit": "Digibyte",
    "github_org": "DigiByte-Core"
}