{
    "id": "divs",
    "symbol": "divs",
    "name": "Divs",
    "platforms": {
        "tron": "TRXmYPy2AXZxacoSbKGjiVto8K1EqwexU7"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "User activity on the site remains anonymous as they go about using the exchange service for cryptocurrencies. You can use any of the 200 listed currencies with zero transaction limits. Divs has simplified the exchange process into three easy steps that can be completed in as little time as possible.\r\n\r\nAdditionally, Divs.io provides users with current exchange rate information to ensure their trade is at the current rates. Their new exchange widget has also been updated, along with 24x7 Support Chat assistance.\r\n\r\nDivs offers a cryptocurrency exchange that’s free to integrate and upon request can customize the front end for your own website. Then stake DIVS tokens earn the fees from all exchanges across all sites the exchange is integrated on.  \r\nAs more websites incorporate DIVS tokens, the company is confident that its use will expand. As a result, exchange coverage will be broader, more rewards will be given, and more buyers will be attracted.     \r\nThe site allows users to manage smart contracts with an API provided by a third-party. A user can also receive rewards in Tron currency as part of the Divs.io token holder program. These rewards are distributed every week at 4 PM UTC. They are not locked for staking purposes and can be withdrawn at any time.\r\n\r\nThe Divs Tokens advantage\r\nThe advantage of Divs.io is that this exchange rate remains the same throughout every transaction. In addition, the API works with all of the known exchanges and, as a result, can provide a host of benefits to each user.\r\n·         No user registration, login ID, or KYC\r\n·         Unlimited exchange limits\r\n·         Faster transaction time (based on the blockchain protocol for each currency type)\r\n·         All transaction data is anonymous and restricted from third-party usage.\r\n·         Users can exchange right on the site using multiple, centralized exchanges\r\nIn addition to its fee structure, Divs.io charges users a flat fee for the API they use. The Divs.io platform boasts a wide range of supported coins for traders who wish to diversify to protect their investments from market volatility. In terms of trading, users have the choice of buying or selling more than 200 types of coins at a fixed rate on each transaction.\r\nDivs have released public announcements about its upcoming crypto exchange on its YouTube, Facebook, and Instagram pages. It is possible to find articles, events on new developments, and a variety of analysts and bloggers discussing cryptocurrency services.      "
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "TRXmYPy2AXZxacoSbKGjiVto8K1EqwexU7",
    "url": "https://www.divs.io",
    "explorers": [
        "https://tronscan.org/#/token20/TRXmYPy2AXZxacoSbKGjiVto8K1EqwexU7"
    ],
    "twitter": "DivsExchange",
    "telegram": "Divs_official"
}