{
    "id": "dogehouse-capital",
    "symbol": "DOGEX",
    "name": "DogeHouse Capital",
    "platforms": {
        "binance-smart-chain": "0x69315c56b987dd9f0234ba0c70b1c7770f8f1852"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "DogeHouse Capital Management is the only microcap cryptocurrency project bringing professional digital asset management  and  practical  utility  to  meme-based  digital  currencies  on  the  Binance  Smart  Chain,  Cardano Blockchain, and beyond. While DogeHouse Capital will officially begin our journey on the Binance Smart Chain, we have no intention of remaining stagnant on a single blockchain. DogeHouse Capital \r\nhas our sights set on the future of decentralized finance (DeFi) – not the past.\r\n\r\nDogeHouse Capital has a fully functioning staking platform for our native token ($DOGEX) and order book-based swap for the Doge Traded Fund ($DTF). The staking platform provides our members with an opportunity to earn automatic dividends and manual rewards in Cardano ($ADA), which is consistent with our long-term goal of migrating to the Cardano Blockchain. The $DTF is the first exchange traded fund (ETF) in DeFi containing a percentage of mega-cap and micro-cap cryptocurrencies in a single wrapped digital asset.\r\n\r\nAt  DogeHouse  Capital,  we  believe  in  investing  in  puppies  with  a  purpose  through  professional  digital  asset management – not unsustainable pump and dump “shitcoins”. That’s why we created a native token backed by strong tokenomics and the first actively managed ETF in DeFi. As we look toward the future, DogeHouse Capital aims to create a series of thematic cross-chain ETFs that provide our investors with balanced exposure to the most dynamic market on the face of the earth – cryptocurrency.   "
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x69315c56b987dd9f0234ba0c70b1c7770f8f1852",
    "url": "https://www.dogehousecapital.com/home",
    "explorers": [
        "https://bscscan.com/token/0x69315c56b987dd9f0234ba0c70b1c7770f8f1852"
    ],
    "twitter": "DogeHouseCap",
    "telegram": "DogeHouseCapital",
    "github_org": "richievangogh"
}