{
    "id": "dreams-quest",
    "symbol": "dreams",
    "name": "Dreams Quest",
    "platforms": {
        "ethereum": ""
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Dreams Quest is a decentralised Play-to-Earn fantasy role play game and fast-paced strategy card game using dynamic NFTs. Players can explore the realms to participate in events and quests. Battle play is player vs player and uses the NFT collectible cards and miscellaneous items for a fast-paced strategy card game.\r\n\r\nThe tokenomics and game design enables players to earn from quests, events, tournaments, and battles. Players participate in a range of quests designed to test your skills and to ultimately find more loot and earn even more from game play.\r\n\r\nIn game quests allow players to discover new places and find valuable loot which they can trade, upgrade, or sell to earn even more.  Users can create card packs which they can also rent out to other players, to their guild or even to professional players who can stream and earn from their gameplay.\r\n\r\nWithin each game battle there are unknown factors such as weather, temperature, storms and more to affect character and card attributes. Miscellaneous cards such as weapons and magic cards can be used to affect card attributes and to help a player gain an advantage over their foes. Outcomes of every battle including any changes to card attributes will be dynamically changed on the NFT and written on chain.\r\n\r\nDreams Quest consists of two sides, called realms. Each side has 3 nations with many types of races found within each nation. The Infernal side of the realms are the classic battle cards that focus on strength and dexterity while the Celestial side focus more on magic and wizardry. Players must choose their side which will then enable them to select the nation they wish to align with.\r\n\r\nThe Guardians are the ultimate protectors of the realms. Each side has an equal number of Guardian NFTs. Guardians have unique powers and abilities that no one else can have and for those powers, they can earn even more. But beware, with special powers, any game can be impacted by a guardian. As watchers of the realm, the Guardians can rally behind you to lead you to victory in battle, and to earn from their support. But if you lose, their powers may also be diminished. Those who use their Guardian cards will continue to increase in power and value. Those who do not will witness their cards weaken over time. For those who continue to play, they will be able to reclaim their status as well.\r\n\r\nAnd as the season reaches conclusion, those who are worthy will be on the leader board with the chance to face the ultimate quest…to raid the Dragon’s Lair. Rally your guardians to support and protect you to ultimately lead you to victory. But fear not, for those who leave in vain may always come back another time if they dare and are worthy."
    },
    "country_origin": "",
    "genesis_date": null,
    "url": "https://dreams.quest",
    "explorers": [],
    "twitter": "DreamsQuestNFT",
    "telegram": "dreamsquesttavern",
    "reddit": "dreamsquestnft/",
    "github_org": "DreamQuestNFT"
}