{
    "id": "drivenx",
    "symbol": "dvx",
    "name": "DRIVENx",
    "platforms": {
        "binance-smart-chain": "0x6db3972c6a5535708e7a4f7ad52f24d178d9a93e"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "\"What is DRIVENecosystem?\r\n\r\nDRIVENecosystem (or just DRIVEN) is a small start-up that aims to integrate cryptocurrencies into everyday life through the use of smart applications. Our primary goal is to make cryptocurrency as simple to use as FIAT.\r\n\r\nPhilosophy and vision\r\n\r\nOur team is guided by core principles such as honesty, integrity, respect, ambition, and fun. By doing so, we build a strong community with the same values as us through time and with a lot of effort - a community that makes us proud, trusts us, and knows us for who we are.\r\n\r\nOur goal is to build a strong DeFi ecosystem where individuals can use cryptocurrency to buy or trade goods and services.\r\n\r\nWhat is DRIVENx?\r\n\r\nDRIVENx (DVX) is a BEP20 token released on the Binance Smart Chain Network in August of 2021. Our focus is on bridging the gaps between cryptocurrency and standard FIAT-based business as usual.\r\n\r\nDRIVEN’s primary goal is to bridge the needs of everyday businesses from your barber to your baker to your candlestick maker with the crypto ecosystem that enables them to use cryptocurrency for goods and services in a simple and intuitive manner, removing complexity from the current cumbersome process.\r\n\r\nWhat is the mission of the DRIVENx?\r\n\r\nWe are creating a platform in which businesses can carry out all of their existing transactions with respect to their customer's supply chain, via cryptocurrency. \r\n\r\nThe platform will enable a business to directly pay or receive funds for goods and/or services without having to convert their cryptocurrency to fiat currency, in turn avoiding costly foreign exchange fees and the associated price fluctuations. They can pay or receive the cryptocurrency of their choosing and transact in a peer-to-peer manner using our service as the intermediary broker for the transactions. \""
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x6db3972c6a5535708e7a4f7ad52f24d178d9a93e",
    "url": "https://www.drivenx.finance/",
    "explorers": [
        "https://bscscan.com/token/0x6db3972c6a5535708e7a4f7ad52f24d178d9a93e"
    ],
    "twitter": "DRIVENprotocol",
    "telegram": "DRIVENx",
    "reddit": "DRIVENecosystem/"
}