{
    "id": "nft-tone",
    "symbol": "tone",
    "name": "NFT Tone",
    "platforms": {
        "binance-smart-chain": "0xbcdfd50ead6b6da1970464985fab894fb83d17c0"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Music-related assets within the world of crypto represent an untapped market with a huge potential. The music industry needs innovation and easier ways for musicians to control both their intellectual property and earnings. This will make it possible for new (and old) talents to be discovered on a decentralized marketplace which will help them to earn money and fulfil their dreams, both at an earlier stage. As of today, the music industry operates from the “top-down”. Our goal is to make it “bottom-up”. \r\n\r\nBased on statistics, music artists earn approximately only 12% of the revenue generated in the industry. The fact is, 90% of revenue is shared amongst 1% of the top music artists which we view as uncredited and unjust. \r\nNFT TONE will be a decentralized and social marketplace where music artists will be able to interact with their admirers in revolutionary ways. \r\nWith NFT TONE, content creators can efficiently and effectively upload their music and get paid directly by their fans and followers. \r\n\r\nKey features:\r\n\r\nEasy creations of NFTs that are sold or auctioned to supporters and investors.\r\n\r\nEnsured provenance and authenticity.\r\n\r\nSecure transactions between artists and fans/investors.\r\n\r\nPartnership with decentralized storage provider(s) to retain high quality and efficient delivery of uploaded content.\r\n\r\nRemarkably efficient token economy powered by the NFT TONE platform token ($TONE) along with stable-coins and FIAT.\r\n\r\nRewards holders of ($TONE) & also artists for all transactions (tax) on the platform.\r\n\r\nRevolutionary marketplace."
    },
    "country_origin": "AR",
    "genesis_date": null,
    "contract_address": "0xbcdfd50ead6b6da1970464985fab894fb83d17c0",
    "url": "https://www.nfttone.net/",
    "explorers": [
        "https://bscscan.com/token/0xbcdfd50ead6b6da1970464985fab894fb83d17c0"
    ],
    "twitter": "NftTone",
    "facebook": "nfttone",
    "telegram": "nft_tone"
}