{
    "id": "nil-dao",
    "symbol": "nil",
    "name": "Nil DAO",
    "platforms": {
        "ethereum": "0x47252a63c723889814aebcac0683e615624cec64"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "Nil is a community-curated marketplace looking to harmonize the relationship between the creator economy participants.\r\n\r\nNFTs are a revolutionary concept which allows novel form of value creation and distribution, liberating creators from traditional constraints.\r\n\r\nEven though, the so-called creator economy establishment is constrained by self-referencing centralized platforms obstructing creators and collectors’ experience.\r\n\r\nBy appropriating the means of artistic production’, centralized protocols limit the Cambrian Explosion intrinsic to permissionless technologies while arbitrarily deciding who will benefit from their recommendations. In addition to favoring insider deals, this situation reduces the emergence of rising artists.\r\n\r\nNonetheless, curation mechanisms are necessary as they positively extract signals from noise while offering a built-in audience for promising artists. Both creators and collectors benefit from noiseless on-chain marketplaces where they can safely nourish fertile links.\r\n\r\nDriven by the burning desire to offer NFT enthusiasts the decentralized experience they deserve, Nil’s initial contributors introduce the Nil DAO, a decentralized cooperative leveraging the Nil Protocol V1.\r\n\r\nThis article will serve as an overview of the mechanism implied in the Nil V1. The journey is just beginning, and contributors are confident the Nil fair launch will ignite a powerful federating movement serving creators all around the world.\r\n\r\nAt the core of Nil resides the concepts of creator’s ownership over their platform in addition to permissionless curation.\r\n\r\nOperating simultaneously on Nil, those parties unlock powerful leverage for participants,  among which curating activities serve the artists while offering them a considerable network of passionate collectors."
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0x47252a63c723889814aebcac0683e615624cec64",
    "url": "https://www.nildao.xyz/",
    "explorers": [
        "https://etherscan.io/token/0x47252A63C723889814AeBcAC0683E615624ceC64",
        "https://ethplorer.io/address/0x47252a63c723889814aebcac0683e615624cec64"
    ],
    "twitter": "Nil__dao",
    "github_org": "nil-dao"
}