{
    "id": "gaj",
    "symbol": "gaj",
    "name": "Gaj Finance",
    "platforms": {
        "avalanche": "0x595c8481c48894771ce8fade54ac6bf59093f9e8",
        "polygon-pos": "0xf4b0903774532aee5ee567c02aab681a81539e92",
        "ethereum": "0x9fda7ceec4c18008096c2fe2b85f05dc300f94d0"
    },
    "hashing_algorithm": null,
    "categories": [
        "Avalanche Ecosystem",
        "Polygon Ecosystem"
    ],
    "description": {
        "en": "Gaj, previously known as PolyGaj, is a multichain platform covering the two most promising subsects of cryptocurrency namely DeFi and NFT. With a vision to be a one-stop solution for users who want to experience both DeFi and NFT and with humble beginnings, Gaj picked up steam due to its unique offerings, especially focused on users who now had a variety of options to earn \r\n\r\nThe team behind Gaj wanted the platform to be robust and quick so that the user experience could be enriched and hence the natively picked up Polygon protocol to built its platform as the protocol promised low transaction fees, extremely fast transactions, staking reward offerings, and enough headroom to scale. \r\n\r\nWith the rise in demand for Gaj and with a mission to expand its users base. Gaj slowly decided to expand to a multichain level, a giant step of the Gaj in the true sense. With the first bridge deployed already, Gaj opened its door to the Binance Smart Chain users with many more bridges to come. \r\n\r\nTo be a one-stop solution, Gaj launched a variety of products at the intersection of DeFi and NFT. These products were designed in a manner that the user can experience the power of both DeFi and the potential of  NFT’s along with great opportunities to earn additional income by staking hodling, and bidding. The range of products that Gaj is providing are all powered by its native token - $GAJ "
    },
    "country_origin": "IN",
    "genesis_date": null,
    "contract_address": "0x595c8481c48894771ce8fade54ac6bf59093f9e8",
    "url": "https://gaj.finance",
    "explorers": [
        "https://cchain.explorer.avax.network/tokens/0x595c8481c48894771CE8FaDE54ac6Bf59093F9E8/token-transfers",
        "https://polygonscan.com/token/0xf4b0903774532aee5ee567c02aab681a81539e92",
        "https://etherscan.io/token/0x9fda7ceec4c18008096c2fe2b85f05dc300f94d0"
    ],
    "twitter": "GajFinance",
    "telegram": "gajfinance",
    "github_org": "PolyGaj"
}