{
    "id": "generic-doge",
    "symbol": "gdoge",
    "name": "Generic Doge",
    "platforms": {
        "binance-smart-chain": "0xf9b2c2f85167d58d1603371a83ffadc676d089dc"
    },
    "hashing_algorithm": null,
    "categories": [],
    "description": {
        "en": "In the past few months, thousands of new crypto tokens have been created on the Binance Smart Chain. These projects had different concepts and tokenomics, various names and different marketing approaches, but they all have one thing in common:\r\n\r\nthe shape of their chart on PooCoin, an inverted parabolic curve. Why is that? \r\n\r\nMost projects promise the Moon: a high risk high return approach, which is heavily based on hype, marketing, and encourages investors to get in early and drop their investment rapidly. \r\n\r\nMany projects have attempted to hide and fight this cycle, but very few have succeeded. Even the powerhouses with massive marketing budgets have reached their peaks and are now as low as they started.\r\n\r\nBy channelling the strength of our community, GDOGE is the first project on the Binance Smart Chain that is not scared to be fully honest with it's investors. All anyone wants is to Moon, and for that, community members and developers alike have to play their part: Shill, marketing, shill, marketing, and more shilling. \r\n\r\nEvery day, the community is asked to complete a precise set of shilling tasks and consulted in regards to marketing decisions. Thanks to the 4% Marketing fee in our tokenomics, the token is guaranteed to prolong the initial stages of \"hype\" and attract new investors, while converting early stage investors into long term holders. We're here to stay, and have no intentions to bullshit our investors. If you believe in our philosophy, join our movement. "
    },
    "country_origin": "",
    "genesis_date": null,
    "contract_address": "0xf9b2c2f85167d58d1603371a83ffadc676d089dc",
    "url": "https://www.genericdoge.com/",
    "explorers": [
        "https://bscscan.com/token/0xf9b2c2f85167d58d1603371a83ffadc676d089dc"
    ],
    "twitter": "genericdoge",
    "telegram": "genericdoge"
}